const DEFAULT_QURAN_INDOPAK = {"baqarah":{"id":"baqarah","surahNum":2,"nameAr":"سُورَةُ ٱلْبَقَرَةِ","nameTa":"அல்-பகரா","nameEn":"Al-Baqarah","ayat":[{"ar":"الٓمّٓۚ"},{"ar":"ذٰلِكَ الۡڪِتٰبُ لَا رَيۡبَۛۚۖ فِيۡهِۛۚ هُدًى لِّلۡمُتَّقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يُؤۡمِنُوۡنَ بِالۡغَيۡبِ وَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَۙ"},{"ar":"وَالَّذِيۡنَ يُؤۡمِنُوۡنَ بِمَۤا اُنۡزِلَ اِلَيۡكَ وَمَاۤ اُنۡزِلَ مِنۡ قَبۡلِكَۚ وَبِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلٰى هُدًى مِّنۡ رَّبِّهِمۡ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا سَوَآءٌ عَلَيۡهِمۡ ءَاَنۡذَرۡتَهُمۡ اَمۡ لَمۡ تُنۡذِرۡهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"خَتَمَ اللّٰهُ عَلَىٰ قُلُوۡبِهِمۡ وَعَلٰى سَمۡعِهِمۡ​ؕ وَعَلٰىٓ اَبۡصَارِهِمۡ غِشَاوَةٌ  وَّلَهُمۡ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ اٰمَنَّا بِاللّٰهِ وَبِالۡيَوۡمِ الۡاٰخِرِ وَمَا هُمۡ بِمُؤۡمِنِيۡنَ​ۘ"},{"ar":"يُخٰدِعُوۡنَ اللّٰهَ وَالَّذِيۡنَ اٰمَنُوۡا ​ۚ وَمَا يَخۡدَعُوۡنَ اِلَّاۤ اَنۡفُسَهُمۡ وَمَا يَشۡعُرُوۡنَؕ"},{"ar":"فِىۡ قُلُوۡبِهِمۡ مَّرَضٌۙ فَزَادَهُمُ اللّٰهُ مَرَضًا ​ۚ وَّلَهُمۡ عَذَابٌ اَلِيۡمٌۙۢبِمَا كَانُوۡا يَكۡذِبُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ لَا تُفۡسِدُوۡا فِىۡ الۡاَرۡضِۙ قَالُوۡاۤ اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ"},{"ar":"اَلَا ۤ اِنَّهُمۡ هُمُ الۡمُفۡسِدُوۡنَ وَلٰـكِنۡ لَّا يَشۡعُرُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا كَمَاۤ اٰمَنَ النَّاسُ قَالُوۡاۤ اَنُؤۡمِنُ كَمَاۤ اٰمَنَ السُّفَهَآءُ​ ؕ اَلَاۤ اِنَّهُمۡ هُمُ السُّفَهَآءُ وَلٰـكِنۡ لَّا يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡاۤ اٰمَنَّا ۖۚ وَاِذَا خَلَوۡا اِلٰى شَيٰطِيۡنِهِمۡۙ قَالُوۡاۤ اِنَّا مَعَكُمۡۙ اِنَّمَا نَحۡنُ مُسۡتَهۡزِءُوۡنَ"},{"ar":"اَللّٰهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِىۡ طُغۡيَانِهِمۡ يَعۡمَهُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى فَمَا رَبِحَتۡ تِّجَارَتُهُمۡ وَمَا كَانُوۡا مُهۡتَدِيۡنَ"},{"ar":"مَثَلُهُمۡ كَمَثَلِ الَّذِى اسۡتَوۡقَدَ نَارًا ​ۚ فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَهٗ ذَهَبَ اللّٰهُ بِنُوۡرِهِمۡ وَتَرَكَهُمۡ فِىۡ ظُلُمٰتٍ لَّا يُبۡصِرُوۡنَ"},{"ar":"صُمٌّۢ بُكۡمٌ عُمۡىٌ فَهُمۡ لَا يَرۡجِعُوۡنَ ۙ"},{"ar":"اَوۡ كَصَيِّبٍ مِّنَ السَّمَآءِ فِيۡهِ ظُلُمٰتٌ وَّرَعۡدٌ وَّبَرۡقٌ​ ۚ يَجۡعَلُوۡنَ اَصَابِعَهُمۡ فِىۡۤ اٰذَانِهِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ​ؕ وَاللّٰهُ مُحِيۡطٌ​ۢ بِالۡكٰفِرِيۡنَ"},{"ar":"يَكَادُ الۡبَرۡقُ يَخۡطَفُ اَبۡصَارَهُمۡ​ؕ كُلَّمَاۤ اَضَآءَ لَهُمۡ مَّشَوۡا فِيۡهِۙ وَاِذَاۤ اَظۡلَمَ عَلَيۡهِمۡ قَامُوۡا​ؕ وَلَوۡ شَآءَ اللّٰهُ لَذَهَبَ بِسَمۡعِهِمۡ وَاَبۡصَارِهِمۡ​ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"يٰۤاَيُّهَا النَّاسُ اعۡبُدُوۡا رَبَّكُمُ الَّذِىۡ خَلَقَكُمۡ وَالَّذِيۡنَ مِنۡ قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَ ۙ"},{"ar":"الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ فِرَاشًا وَّالسَّمَآءَ بِنَآءً وَّاَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَخۡرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّـكُمۡ​ۚ فَلَا تَجۡعَلُوۡا لِلّٰهِ اَنۡدَادًا وَّاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاِنۡ کُنۡتُمۡ فِىۡ رَيۡبٍ مِّمَّا نَزَّلۡنَا عَلٰى عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَةٍ مِّنۡ مِّثۡلِهٖ وَادۡعُوۡا شُهَدَآءَكُمۡ مِّنۡ دُوۡنِ اللّٰهِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَلَنۡ تَفۡعَلُوۡا فَاتَّقُوۡا النَّارَ الَّتِىۡ وَقُوۡدُهَا النَّاسُ وَالۡحِجَارَةُ  ۖۚ اُعِدَّتۡ لِلۡكٰفِرِيۡنَ"},{"ar":"وَبَشِّرِ الَّذِيۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ​ؕ ڪُلَّمَا رُزِقُوۡا مِنۡهَا مِنۡ ثَمَرَةٍ رِّزۡقًا ​ۙ قَالُوۡا هٰذَا الَّذِىۡ رُزِقۡنَا مِنۡ قَبۡلُ وَاُتُوۡا بِهٖ مُتَشَابِهًا ​ؕ وَلَهُمۡ فِيۡهَآ اَزۡوَاجٌ مُّطَهَّرَةٌ ​ۙ وَّهُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ اللّٰهَ لَا يَسۡتَحۡـىٖۤ اَنۡ يَّضۡرِبَ مَثَلًا مَّا ​بَعُوۡضَةً فَمَا فَوۡقَهَا ​ؕ فَاَمَّا ​الَّذِيۡنَ اٰمَنُوۡا فَيَعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ۚ وَاَمَّا الَّذِيۡنَ ڪَفَرُوۡا فَيَقُوۡلُوۡنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ۘ يُضِلُّ بِهٖ ڪَثِيۡرًا وَّيَهۡدِىۡ بِهٖ كَثِيۡرًا ​ؕ وَمَا يُضِلُّ بِهٖۤ اِلَّا الۡفٰسِقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَنۡقُضُوۡنَ عَهۡدَ اللّٰهِ مِنۡۢ بَعۡدِ مِيۡثَاقِهٖ وَيَقۡطَعُوۡنَ مَآ اَمَرَ اللّٰهُ بِهٖۤ اَنۡ يُّوۡصَلَ وَيُفۡسِدُوۡنَ فِى الۡاَرۡضِ​ؕ اُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"كَيۡفَ تَكۡفُرُوۡنَ بِاللّٰهِ وَڪُنۡتُمۡ اَمۡوَاتًا فَاَحۡيَاکُمۡ​ۚ ثُمَّ يُمِيۡتُكُمۡ ثُمَّ يُحۡيِيۡكُمۡ ثُمَّ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"هُوَ الَّذِىۡ خَلَقَ لَـكُمۡ مَّا فِى الۡاَرۡضِ جَمِيۡعًا ثُمَّ اسۡتَوٰۤى اِلَى السَّمَآءِ فَسَوّٰٮهُنَّ سَبۡعَ سَمٰوٰتٍ​ؕ وَهُوَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذۡ قَالَ رَبُّكَ لِلۡمَلٰٓٮِٕكَةِ اِنِّىۡ جَاعِلٌ فِى الۡاَرۡضِ خَلِيۡفَةً ؕ قَالُوۡٓا اَتَجۡعَلُ فِيۡهَا مَنۡ يُّفۡسِدُ فِيۡهَا وَيَسۡفِكُ الدِّمَآءَۚ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَـكَ​ؕ قَالَ اِنِّىۡٓ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَعَلَّمَ اٰدَمَ الۡاَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى الۡمَلٰٓٮِٕكَةِ فَقَالَ اَنۡۢبِــُٔوۡنِىۡ بِاَسۡمَآءِ هٰٓؤُلَآءِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"قَالُوۡا سُبۡحٰنَكَ لَا عِلۡمَ لَنَآ اِلَّا مَا عَلَّمۡتَنَا ؕ اِنَّكَ اَنۡتَ الۡعَلِيۡمُ الۡحَكِيۡمُ"},{"ar":"قَالَ يٰٓـاٰدَمُ اَنۡۢبِئۡهُمۡ بِاَسۡمَآٮِٕهِمۡ​ۚ فَلَمَّآ اَنۡۢبَاَهُمۡ بِاَسۡمَآٮِٕهِمۡۙ قَالَ اَلَمۡ اَقُل لَّـكُمۡ اِنِّىۡٓ اَعۡلَمُ غَيۡبَ السَّمٰوٰتِ وَالۡاَرۡضِۙ وَاَعۡلَمُ مَا تُبۡدُوۡنَ وَمَا كُنۡتُمۡ تَكۡتُمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا لِلۡمَلٰٓٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡٓا اِلَّاۤ اِبۡلِيۡسَؕ اَبٰى وَاسۡتَكۡبَرَ  وَكَانَ مِنَ الۡكٰفِرِيۡنَ"},{"ar":"وَقُلۡنَا يٰٓـاٰدَمُ اسۡكُنۡ اَنۡتَ وَزَوۡجُكَ الۡجَـنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوۡنَا مِنَ الظّٰلِمِيۡنَ"},{"ar":"فَاَزَلَّهُمَا الشَّيۡطٰنُ عَنۡهَا فَاَخۡرَجَهُمَا مِمَّا كَانَا فِيۡهِ​ وَقُلۡنَا اهۡبِطُوۡا بَعۡضُكُمۡ لِبَعۡضٍ عَدُوٌّ ۚ وَلَـكُمۡ فِى الۡاَرۡضِ مُسۡتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيۡنٍ"},{"ar":"فَتَلَقّٰٓى اٰدَمُ مِنۡ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيۡهِ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"قُلۡنَا اهۡبِطُوۡا مِنۡهَا جَمِيۡعًا ​​ۚ فَاِمَّا يَاۡتِيَنَّكُمۡ مِّنِّىۡ هُدًى فَمَنۡ تَبِعَ هُدَاىَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَالَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِـاٰيٰتِنَآ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَوۡفُوۡا بِعَهۡدِىۡٓ اُوۡفِ بِعَهۡدِكُمۡۚ وَاِيَّاىَ فَارۡهَبُوۡنِ"},{"ar":"وَاٰمِنُوۡا بِمَآ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَكُمۡ وَلَا تَكُوۡنُوۡآ اَوَّلَ كَافِرٍۢ بِهٖ​ وَلَا تَشۡتَرُوۡا بِاٰيٰتِىۡ ثَمَنًا قَلِيۡلًا وَّاِيَّاىَ فَاتَّقُوۡنِ"},{"ar":"وَلَا تَلۡبِسُوا الۡحَـقَّ بِالۡبَاطِلِ وَتَكۡتُمُوا الۡحَـقَّ وَاَنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارۡكَعُوۡا مَعَ الرّٰكِعِيۡنَ"},{"ar":"اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَتَنۡسَوۡنَ اَنۡفُسَكُمۡ وَاَنۡتُمۡ تَتۡلُوۡنَ الۡكِتٰبَ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"وَاسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ​ؕ وَاِنَّهَا لَكَبِيۡرَةٌ اِلَّا عَلَى الۡخٰشِعِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوۡا رَبِّهِمۡ وَاَنَّهُمۡ اِلَيۡهِ رٰجِعُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا شَفَاعَةٌ وَّلَا يُؤۡخَذُ مِنۡهَا عَدۡلٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذۡ نَجَّيۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ يَسُوۡمُوۡنَكُمۡ سُوۡٓءَ الۡعَذَابِ يُذَبِّحُوۡنَ اَبۡنَآءَكُمۡ وَيَسۡتَحۡيُوۡنَ نِسَآءَكُمۡ​ؕ وَفِىۡ ذٰلِكُمۡ بَلَاۤءٌ مِّنۡ رَّبِّكُمۡ عَظِيۡمٌ"},{"ar":"وَاِذۡ فَرَقۡنَا بِكُمُ الۡبَحۡرَ فَاَنۡجَيۡنٰکُمۡ وَاَغۡرَقۡنَآ اٰلَ فِرۡعَوۡنَ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"وَاِذۡ وٰعَدۡنَا مُوۡسٰٓى اَرۡبَعِيۡنَ لَيۡلَةً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"ثُمَّ عَفَوۡنَا عَنۡكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ لَعَلَّكُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَالۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُوۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ اِنَّكُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِكُمُ الۡعِجۡلَ فَتُوۡبُوۡآ اِلٰى بَارِٮِٕكُمۡ فَاقۡتُلُوۡٓا اَنۡفُسَكُمۡؕ ذٰ لِكُمۡ خَيۡرٌ لَّـكُمۡ عِنۡدَ بَارِٮِٕكُمۡؕ فَتَابَ عَلَيۡكُمۡ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نُّؤۡمِنَ لَـكَ حَتّٰى نَرَى اللّٰهَ جَهۡرَةً فَاَخَذَتۡكُمُ الصّٰعِقَةُ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"ثُمَّ بَعَثۡنٰكُمۡ مِّنۡۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَظَلَّلۡنَا عَلَيۡکُمُ الۡغَمَامَ وَاَنۡزَلۡنَا عَلَيۡكُمُ الۡمَنَّ وَالسَّلۡوٰى​ؕ كُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ​ؕ وَمَا ظَلَمُوۡنَا وَلٰـكِنۡ كَانُوۡآ اَنۡفُسَهُمۡ يَظۡلِمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا ادۡخُلُوۡا هٰذِهِ الۡقَرۡيَةَ فَکُلُوۡا مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدًا وَّادۡخُلُوا الۡبَابَ سُجَّدًا وَّقُوۡلُوۡا حِطَّةٌ نَّغۡفِرۡ لَـكُمۡ خَطٰيٰكُمۡ​ؕ وَسَنَزِيۡدُ الۡمُحۡسِنِيۡنَ"},{"ar":"فَبَدَّلَ الَّذِيۡنَ ظَلَمُوۡا قَوۡلاً غَيۡرَ الَّذِىۡ قِيۡلَ لَهُمۡ فَاَنۡزَلۡنَا عَلَى الَّذِيۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا كَانُوۡا يَفۡسُقُوۡنَ"},{"ar":"وَاِذِ اسۡتَسۡقَىٰ مُوۡسٰى لِقَوۡمِهٖ فَقُلۡنَا اضۡرِب بِّعَصَاكَ الۡحَجَرَ​ؕ فَانۡفَجَرَتۡ مِنۡهُ اثۡنَتَا عَشۡرَةَ عَيۡنًا​ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَهُمۡ​ؕ کُلُوۡا وَاشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰهِ وَلَا تَعۡثَوۡا فِىۡ الۡاَرۡضِ مُفۡسِدِيۡنَ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نَّصۡبِرَ عَلٰى طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِهَا وَقِثَّـآٮِٕهَا وَفُوۡمِهَا وَعَدَسِهَا وَ بَصَلِهَا​ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِىۡ هُوَ اَدۡنٰى بِالَّذِىۡ هُوَ خَيۡرٌ​ؕ اِهۡبِطُوۡا مِصۡرًا فَاِنَّ لَـکُمۡ مَّا سَاَلۡتُمۡ​ؕ وَضُرِبَتۡ عَلَيۡهِمُ الذِّلَّةُ وَالۡمَسۡکَنَةُ وَبَآءُوۡ بِغَضَبٍ مِّنَ اللّٰهِ​ؕ ذٰلِكَ بِاَنَّهُمۡ كَانُوۡا يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ النَّبِيّٖنَ بِغَيۡرِ الۡحَـقِّ​ؕ ذٰلِكَ بِمَا عَصَوا وَّڪَانُوۡا يَعۡتَدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَادُوۡا وَالنَّصٰرٰى وَالصّٰبِـِٕـيۡنَ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَعَمِلَ صَالِحًـا فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ الطُّوۡرَؕ خُذُوۡا مَآ اٰتَيۡنٰكُمۡ بِقُوَّةٍ وَّ اذۡكُرُوۡا مَا فِيۡهِ لَعَلَّكُمۡ تَتَّقُوۡنَ"},{"ar":"ثُمَّ تَوَلَّيۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ​​ۚ فَلَوۡلَا فَضۡلُ اللّٰهِ عَلَيۡكُمۡ وَرَحۡمَتُهٗ لَـكُنۡتُمۡ مِّنَ الۡخٰسِرِيۡنَ"},{"ar":"وَلَقَدۡ عَلِمۡتُمُ الَّذِيۡنَ اعۡتَدَوۡا مِنۡكُمۡ فِىۡ السَّبۡتِ فَقُلۡنَا لَهُمۡ كُوۡنُوۡا قِرَدَةً خَاسِـِٔـيۡنَ ​ۚ"},{"ar":"فَجَعَلۡنٰهَا نَكٰلاً لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةً لِّلۡمُتَّقِيۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖۤ اِنَّ اللّٰهَ يَاۡمُرُكُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَةً ​ ؕ قَالُوۡآ اَتَتَّخِذُنَا هُزُوًۡا ​ؕ قَالَ اَعُوۡذُ بِاللّٰهِ اَنۡ اَكُوۡنَ مِنَ الۡجٰـهِلِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكۡرٌؕ عَوَانٌۢ بَيۡنَ ذٰلِكَ​ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا لَوۡنُهَا ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ صَفۡرَآءُۙ فَاقِعٌ لَّوۡنُهَا تَسُرُّ النّٰظِرِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَۙ اِنَّ الۡبَقَرَ تَشٰبَهَ عَلَيۡنَا ؕ وَاِنَّـآ اِنۡ شَآءَ اللّٰهُ لَمُهۡتَدُوۡنَ"},{"ar":"قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوۡلٌ تُثِيۡرُ الۡاَرۡضَ وَلَا تَسۡقِى الۡحَـرۡثَ ​ۚ مُسَلَّمَةٌ لَّا شِيَةَ فِيۡهَا ​ؕ قَالُوا الۡـٰٔـنَ جِئۡتَ بِالۡحَـقِّ​ؕ فَذَبَحُوۡهَا وَمَا كَادُوۡا يَفۡعَلُوۡنَ"},{"ar":"وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِيۡهَا ​ؕ وَاللّٰهُ مُخۡرِجٌ مَّا كُنۡتُمۡ تَكۡتُمُوۡنَۚ"},{"ar":"فَقُلۡنَا اضۡرِبُوۡهُ بِبَعۡضِهَا ​ؕ كَذٰلِكَ يُحۡىِ اللّٰهُ الۡمَوۡتٰى ۙ وَيُرِيۡکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"ثُمَّ قَسَتۡ قُلُوۡبُكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ فَهِىَ كَالۡحِجَارَةِ اَوۡ اَشَدُّ قَسۡوَةً ​ ؕ وَاِنَّ مِنَ الۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ الۡاَنۡهٰرُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ الۡمَآءُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اَفَتَطۡمَعُوۡنَ اَنۡ يُّؤۡمِنُوۡا لَـكُمۡ وَقَدۡ كَانَ فَرِيۡقٌ مِّنۡهُمۡ يَسۡمَعُوۡنَ کَلَامَ اللّٰهِ ثُمَّ يُحَرِّفُوۡنَهٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡهُ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَـقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡآ اٰمَنَّا  ۖۚ وَاِذَا خَلَا بَعۡضُهُمۡ اِلٰى بَعۡضٍ قَالُوۡآ اَ تُحَدِّثُوۡنَهُمۡ بِمَا فَتَحَ اللّٰهُ عَلَيۡكُمۡ لِيُحَآجُّوۡكُمۡ بِهٖ عِنۡدَ رَبِّكُمۡ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"اَوَلَا يَعۡلَمُوۡنَ اَنَّ اللّٰهَ يَعۡلَمُ مَا يُسِرُّوۡنَ وَمَا يُعۡلِنُوۡنَ"},{"ar":"وَ مِنۡهُمۡ اُمِّيُّوۡنَ لَا يَعۡلَمُوۡنَ الۡكِتٰبَ اِلَّاۤ اَمَانِىَّ وَاِنۡ هُمۡ اِلَّا يَظُنُّوۡنَ"},{"ar":"فَوَيۡلٌ لِّلَّذِيۡنَ يَكۡتُبُوۡنَ الۡكِتٰبَ بِاَيۡدِيۡهِمۡ ثُمَّ يَقُوۡلُوۡنَ هٰذَا مِنۡ عِنۡدِ اللّٰهِ لِيَشۡتَرُوۡا بِهٖ ثَمَنًا قَلِيۡلًا ؕ فَوَيۡلٌ لَّهُمۡ مِّمَّا کَتَبَتۡ اَيۡدِيۡهِمۡ وَوَيۡلٌ لَّهُمۡ مِّمَّا يَكۡسِبُوۡنَ"},{"ar":"وَقَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعۡدُوۡدَةً ​ ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰهِ عَهۡدًا فَلَنۡ يُّخۡلِفَ اللّٰهُ عَهۡدَهٗۤ​ اَمۡ تَقُوۡلُوۡنَ عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"بَلٰى مَنۡ كَسَبَ سَيِّئَةً وَّاَحَاطَتۡ بِهٖ خَطِيْۤـــَٔتُهٗ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَالَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓٮِٕكَ اَصۡحٰبُ الۡجَـنَّةِ ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَ بَنِىۡٓ اِسۡرَآءِيۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰهَ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا وَّذِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰکِيۡنِ وَقُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ ؕ ثُمَّ تَوَلَّيۡتُمۡ اِلَّا قَلِيۡلًا مِّنۡکُمۡ وَاَنۡـتُمۡ مُّعۡرِضُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ لَا تَسۡفِكُوۡنَ دِمَآءَكُمۡ وَلَا تُخۡرِجُوۡنَ اَنۡفُسَكُمۡ مِّنۡ دِيَارِكُمۡ ثُمَّ اَقۡرَرۡتُمۡ وَاَنۡـتُمۡ تَشۡهَدُوۡنَ"},{"ar":"ثُمَّ اَنۡـتُمۡ هٰٓؤُلَاۤءِ تَقۡتُلُوۡنَ اَنۡفُسَكُمۡ وَتُخۡرِجُوۡنَ فَرِيۡقًا مِّنۡكُمۡ مِّنۡ دِيَارِهِمۡ تَظٰهَرُوۡنَ عَلَيۡهِمۡ بِالۡاِثۡمِ وَالۡعُدۡوَانِؕ وَاِنۡ يَّاۡتُوۡكُمۡ اُسٰرٰى تُفٰدُوۡهُمۡ وَهُوَ مُحَرَّمٌ عَلَيۡڪُمۡ اِخۡرَاجُهُمۡ​​ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡكِتٰبِ وَتَكۡفُرُوۡنَ بِبَعۡضٍ​ۚ فَمَا جَزَآءُ مَنۡ يَّفۡعَلُ ذٰلِكَ مِنۡکُمۡ اِلَّا خِزۡىٌ فِى الۡحَيٰوةِ الدُّنۡيَا ​ۚ وَيَوۡمَ الۡقِيٰمَةِ يُرَدُّوۡنَ اِلٰٓى اَشَدِّ الۡعَذَابِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الۡحَيٰوةَ الدُّنۡيَا بِالۡاٰخِرَةِ​ فَلَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَ لَقَدۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَقَفَّيۡنَا مِنۡۢ بَعۡدِهٖ بِالرُّسُلِ​ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ اَفَكُلَّمَا جَآءَكُمۡ رَسُوۡلٌۢ بِمَا لَا تَهۡوٰٓى اَنۡفُسُكُمُ اسۡتَكۡبَرۡتُمۡ​ۚ فَفَرِيۡقًا كَذَّبۡتُمۡ وَفَرِيۡقًا تَقۡتُلُوۡنَ"},{"ar":"وَقَالُوۡا قُلُوۡبُنَا غُلۡفٌ​ؕ بَل لَّعَنَهُمُ اللّٰهُ بِكُفۡرِهِمۡ فَقَلِيۡلًا مَّا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ كِتٰبٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡۙ وَكَانُوۡا مِنۡ قَبۡلُ يَسۡتَفۡتِحُوۡنَ عَلَى الَّذِيۡنَ كَفَرُوۡا  ​ۖۚ فَلَمَّا جَآءَهُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِهٖ​ فَلَعۡنَةُ اللّٰهِ عَلَى الۡكٰفِرِيۡنَ"},{"ar":"بِئۡسَمَا اشۡتَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ اَنۡ يَّڪۡفُرُوۡا بِمَآ اَنۡزَلَ اللّٰهُ بَغۡيًا اَنۡ يُّنَزِّلَ اللّٰهُ مِنۡ فَضۡلِهٖ عَلٰى مَنۡ يَّشَآءُ مِنۡ عِبَادِهٖ​ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰى غَضَبٍ​ؕ وَلِلۡكٰفِرِيۡنَ عَذَابٌ مُّهِيۡنٌ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا بِمَآ اَنۡزَلَ اللّٰهُ قَالُوۡا نُؤۡمِنُ بِمَآ اُنۡزِلَ عَلَيۡنَا وَيَكۡفُرُوۡنَ بِمَا وَرَآءَهٗ وَهُوَ الۡحَـقُّ مُصَدِّقًا لِّمَا مَعَهُمۡ​ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡـــۢبِيَآءَ اللّٰهِ مِنۡ قَبۡلُ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"وَلَقَدۡ جَآءَکُمۡ مُّوۡسٰى بِالۡبَيِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَآ اٰتَيۡنٰکُمۡ بِقُوَّةٍ وَّاسۡمَعُوۡا ​ ؕ قَالُوۡا سَمِعۡنَا وَعَصَيۡنَا  وَاُشۡرِبُوۡا فِىۡ قُلُوۡبِهِمُ الۡعِجۡلَ بِکُفۡرِهِمۡ ​ؕ قُلۡ بِئۡسَمَا يَاۡمُرُکُمۡ بِهٖۤ اِيۡمَانُكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"قُلۡ اِنۡ كَانَتۡ لَـکُمُ الدَّارُ الۡاٰخِرَةُ عِنۡدَ اللّٰهِ خَالِصَةً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"وَ لَنۡ يَّتَمَنَّوۡهُ اَبَدًاۢ بِمَا قَدَّمَتۡ اَيۡدِيۡهِمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَلَتَجِدَنَّهُمۡ اَحۡرَصَ النَّاسِ عَلٰى حَيٰوةٍ  ۛۚ وَ مِنَ الَّذِيۡنَ اَشۡرَكُوۡا​​  ۛۚ يَوَدُّ اَحَدُهُمۡ لَوۡ يُعَمَّرُ اَ لۡفَ سَنَةٍ ۚ وَمَا هُوَ بِمُزَحۡزِحِهٖ مِنَ الۡعَذَابِ اَنۡ يُّعَمَّرَ​ؕ وَاللّٰهُ بَصِيۡرٌۢ بِمَا يَعۡمَلُوۡنَ "},{"ar":"قُلۡ مَنۡ كَانَ عَدُوًّا لِّجِبۡرِيۡلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلۡبِكَ بِاِذۡنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدًى وَّبُشۡرٰى لِلۡمُؤۡمِنِيۡنَ"},{"ar":"مَنۡ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰٓٮِٕکَتِهٖ وَ رُسُلِهٖ وَجِبۡرِيۡلَ وَمِيۡكٰٮلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلۡكٰفِرِيۡنَ"},{"ar":"وَلَقَدۡ اَنۡزَلۡنَآ اِلَيۡكَ اٰيٰتٍۢ بَيِّنٰتٍ​​ۚ وَمَا يَكۡفُرُ بِهَآ اِلَّا الۡفٰسِقُوۡنَ"},{"ar":"اَوَکُلَّمَا عٰهَدُوۡا عَهۡدًا نَّبَذَهٗ فَرِيۡقٌ مِّنۡهُمۡ​ؕ بَلۡ اَكۡثَرُهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡ نَبَذَ فَرِيۡقٌ مِّنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَۙ کِتٰبَ اللّٰهِ وَرَآءَ ظُهُوۡرِهِمۡ كَاَنَّهُمۡ لَا يَعۡلَمُوۡنَ"},{"ar":"وَاتَّبَعُوۡا مَا تَتۡلُوا الشَّيٰطِيۡنُ عَلٰى مُلۡكِ سُلَيۡمٰنَ​​ۚ وَمَا کَفَرَ سُلَيۡمٰنُ وَلٰـكِنَّ الشَّيٰـطِيۡنَ كَفَرُوۡا يُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ وَمَآ اُنۡزِلَ عَلَى الۡمَلَـکَيۡنِ بِبَابِلَ هَارُوۡتَ وَمَارُوۡتَ​ؕ وَمَا يُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰى يَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَةٌ فَلَا تَكۡفُرۡؕ​ فَيَتَعَلَّمُوۡنَ مِنۡهُمَا مَا يُفَرِّقُوۡنَ بِهٖ بَيۡنَ الۡمَرۡءِ وَ زَوۡجِهٖ​ؕ وَمَا هُمۡ بِضَآرِّيۡنَ بِهٖ مِنۡ اَحَدٍ اِلَّا بِاِذۡنِ اللّٰهِ​ؕ وَيَتَعَلَّمُوۡنَ مَا يَضُرُّهُمۡ وَلَا يَنۡفَعُهُمۡ​ؕ وَلَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮهُ مَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ​ؕ وَلَبِئۡسَ مَا شَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ​ؕ لَوۡ کَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"وَلَوۡ اَنَّهُمۡ اٰمَنُوۡا وَاتَّقَوۡا لَمَثُوۡبَةٌ مِّنۡ عِنۡدِ اللّٰهِ خَيۡرٌ ؕ​ لَوۡ كَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوا انۡظُرۡنَا وَاسۡمَعُوۡا ​ؕ وَلِلۡڪٰفِرِيۡنَ عَذَابٌ اَلِيۡمٌ"},{"ar":"مَا يَوَدُّ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَلَا الۡمُشۡرِكِيۡنَ اَنۡ يُّنَزَّلَ عَلَيۡڪُمۡ مِّنۡ خَيۡرٍ مِّنۡ رَّبِّکُمۡ​ؕ وَاللّٰهُ يَخۡتَصُّ بِرَحۡمَتِهٖ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ"},{"ar":"مَا نَنۡسَخۡ مِنۡ اٰيَةٍ اَوۡ نُنۡسِهَا نَاۡتِ بِخَيۡرٍ مِّنۡهَآ اَوۡ مِثۡلِهَا ​ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَمَا لَـکُمۡ مِّنۡ دُوۡنِ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَمۡ تُرِيۡدُوۡنَ اَنۡ تَسۡـَٔـلُوۡا رَسُوۡلَـكُمۡ كَمَا سُٮِٕلَ مُوۡسٰى مِنۡ قَبۡلُ​ؕ وَمَنۡ يَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِيۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ"},{"ar":"وَدَّ کَثِيۡرٌ مِّنۡ اَهۡلِ الۡكِتٰبِ لَوۡ يَرُدُّوۡنَكُمۡ مِّنۡۢ بَعۡدِ اِيۡمَانِكُمۡ كُفَّارًا ۖۚ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِهِمۡ مِّنۡۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ الۡحَـقُّ​ ۚ فَاعۡفُوۡا وَاصۡفَحُوۡا حَتّٰى يَاۡتِىَ اللّٰهُ بِاَمۡرِهٖ ​ؕ اِنَّ اللّٰهَ عَلٰى کُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ  ​ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَقَالُوۡا لَنۡ يَّدۡخُلَ الۡجَـنَّةَ اِلَّا مَنۡ كَانَ هُوۡدًا اَوۡ نَصٰرٰى​ؕ تِلۡكَ اَمَانِيُّهُمۡ​ؕ قُلۡ هَاتُوۡا بُرۡهَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"بَلٰى مَنۡ اَسۡلَمَ وَجۡهَهٗ لِلّٰهِ وَهُوَ مُحۡسِنٌ فَلَهٗۤ اَجۡرُهٗ عِنۡدَ رَبِّهٖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَقَالَتِ الۡيَهُوۡدُ لَـيۡسَتِ النَّصٰرٰى عَلٰى شَىۡءٍ وَّقَالَتِ النَّصٰرٰى لَـيۡسَتِ الۡيَهُوۡدُ عَلٰى شَىۡءٍۙ وَّهُمۡ يَتۡلُوۡنَ الۡكِتٰبَؕ كَذٰلِكَ قَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ مِثۡلَ قَوۡلِهِمۡ​ۚ فَاللّٰهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ الۡقِيٰمَةِ فِيۡمَا كَانُوۡا فِيۡهِ يَخۡتَلِفُوۡنَ"},{"ar":"وَمَنۡ اَظۡلَمُ مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنۡ يُّذۡكَرَ فِيۡهَا اسۡمُهٗ وَسَعٰـى فِىۡ خَرَابِهَا ​ؕ اُولٰٓٮِٕكَ مَا كَانَ لَهُمۡ اَنۡ يَّدۡخُلُوۡهَآ اِلَّا خَآٮِٕفِيۡنَ ؕ لَهُمۡ فِى الدُّنۡيَا خِزۡىٌ وَّلَهُمۡ فِى الۡاٰخِرَةِ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَلِلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ​ فَاَيۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡهُ اللّٰهِ​ؕ اِنَّ اللّٰهَ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا ۙ​ سُبۡحٰنَهٗ ​ؕ بَل لَّهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ كُلٌّ لَّهٗ قَانِتُوۡنَ"},{"ar":"بَدِيۡعُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَ اِذَا قَضٰٓى اَمۡرًا فَاِنَّمَا يَقُوۡلُ لَهٗ كُنۡ فَيَكُوۡنُ"},{"ar":"وَقَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ لَوۡلَا يُكَلِّمُنَا اللّٰهُ اَوۡ تَاۡتِيۡنَآ اٰيَةٌ ​ ؕ كَذٰلِكَ قَالَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ مِّثۡلَ قَوۡلِهِمۡؕ​ تَشَابَهَتۡ قُلُوۡبُهُمۡ​ؕ قَدۡ بَيَّنَّا الۡاٰيٰتِ لِقَوۡمٍ يُّوۡقِنُوۡنَ"},{"ar":"اِنَّاۤ اَرۡسَلۡنٰكَ بِالۡحَـقِّ بَشِيۡرًا وَّنَذِيۡرًا ۙ​ وَّلَا تُسۡـَٔـلُ عَنۡ اَصۡحٰبِ الۡجَحِيۡمِ"},{"ar":"وَلَنۡ تَرۡضٰى عَنۡكَ الۡيَهُوۡدُ وَلَا النَّصٰرٰى حَتّٰى تَتَّبِعَ مِلَّتَهُمۡ​ؕ قُلۡ اِنَّ هُدَى اللّٰهِ هُوَ الۡهُدٰى​ؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ بَعۡدَ الَّذِىۡ جَآءَكَ مِنَ الۡعِلۡمِ​ۙ مَا لَـكَ مِنَ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَتۡلُوۡنَهٗ حَقَّ تِلَاوَتِهٖؕ اُولٰٓٮِٕكَ يُؤۡمِنُوۡنَ بِهٖ​ ؕ وَمَنۡ يَّكۡفُرۡ بِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا عَدۡلٌ وَّلَا تَنۡفَعُهَا شَفَاعَةٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذِ ابۡتَلٰٓى اِبۡرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ ​ؕ قَالَ اِنِّىۡ جَاعِلُكَ لِلنَّاسِ اِمَامًا ​ؕ قَالَ وَمِنۡ ذُرِّيَّتِىۡ ​ؕ قَالَ لَا يَنَالُ عَهۡدِى الظّٰلِمِيۡنَ"},{"ar":"وَاِذۡ جَعَلۡنَا الۡبَيۡتَ مَثَابَةً لِّلنَّاسِ وَاَمۡنًا ؕ وَاتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰهٖمَ مُصَلًّى​ ؕ وَعَهِدۡنَآ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ اَنۡ طَهِّرَا بَيۡتِىَ لِلطَّآٮِٕفِيۡنَ وَالۡعٰكِفِيۡنَ وَالرُّکَّعِ السُّجُوۡدِ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اجۡعَلۡ هٰذَا بَلَدًا اٰمِنًا وَّارۡزُقۡ اَهۡلَهٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡهُمۡ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ قَالَ وَمَنۡ كَفَرَ فَاُمَتِّعُهٗ قَلِيۡلًا ثُمَّ اَضۡطَرُّهٗۤ اِلٰى عَذَابِ النَّارِ​ؕ وَبِئۡسَ الۡمَصِيۡرُ"},{"ar":"وَاِذۡ يَرۡفَعُ اِبۡرٰهٖمُ الۡقَوَاعِدَ مِنَ الۡبَيۡتِ وَاِسۡمٰعِيۡلُؕ رَبَّنَا تَقَبَّلۡ مِنَّا ​ؕ اِنَّكَ اَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ"},{"ar":"رَبَّنَا وَاجۡعَلۡنَا مُسۡلِمَيۡنِ لَـكَ وَ مِنۡ ذُرِّيَّتِنَآ اُمَّةً مُّسۡلِمَةً لَّكَ وَاَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَا ۚ اِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"رَبَّنَا وَابۡعَثۡ فِيۡهِمۡ رَسُوۡلًا مِّنۡهُمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِكَ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَ يُزَكِّيۡهِمۡ​ؕ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ"},{"ar":"وَمَنۡ يَّرۡغَبُ عَنۡ مِّلَّةِ اِبۡرٰهٖمَ اِلَّا مَنۡ سَفِهَ نَفۡسَهٗ ​ؕ وَلَقَدِ اصۡطَفَيۡنٰهُ فِى الدُّنۡيَا ​ۚ وَاِنَّهٗ فِى الۡاٰخِرَةِ لَمِنَ الصّٰلِحِيۡنَ"},{"ar":"اِذۡ قَالَ لَهٗ رَبُّهٗۤ اَسۡلِمۡ​ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِيۡنَ"},{"ar":"وَوَصّٰى بِهَآ اِبۡرٰهٖمُ بَنِيۡهِ وَ يَعۡقُوۡبُؕ يٰبَنِىَّ اِنَّ اللّٰهَ اصۡطَفٰى لَـكُمُ الدِّيۡنَ فَلَا تَمُوۡتُنَّ اِلَّا وَاَنۡـتُمۡ مُّسۡلِمُوۡنَؕ"},{"ar":"اَمۡ كُنۡتُمۡ شُهَدَآءَ اِذۡ حَضَرَ يَعۡقُوۡبَ الۡمَوۡتُۙ اِذۡ قَالَ لِبَنِيۡهِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِىۡؕ قَالُوۡا نَعۡبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَآٮِٕكَ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ اِلٰهًا وَّاحِدًا ۖۚ وَّنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"وَقَالُوۡا کُوۡنُوۡا هُوۡدًا اَوۡ نَصٰرٰى تَهۡتَدُوۡا ​ؕ قُلۡ بَلۡ مِلَّةَ اِبۡرٰهٖمَ حَنِيۡفًا ​ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ"},{"ar":"قُوۡلُوۡٓا اٰمَنَّا بِاللّٰهِ وَمَآ اُنۡزِلَ اِلَيۡنَا وَمَآ اُنۡزِلَ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَمَآ اُوۡتِىَ مُوۡسٰى وَعِيۡسٰى وَمَآ اُوۡتِىَ النَّبِيُّوۡنَ مِنۡ رَّبِّهِمۡ​ۚ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡهُمۡ وَنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَآ اٰمَنۡتُمۡ بِهٖ فَقَدِ اهۡتَدَوْا ​ۚ وَاِنۡ تَوَلَّوۡا فَاِنَّمَا هُمۡ فِىۡ شِقَاقٍ​ ۚ فَسَيَكۡفِيۡکَهُمُ اللّٰهُ ​ۚ وَهُوَ السَّمِيۡعُ الۡعَلِيۡمُؕ"},{"ar":"صِبۡغَةَ اللّٰهِ ​ۚ وَمَنۡ اَحۡسَنُ مِنَ اللّٰهِ صِبۡغَةً  وَّنَحۡنُ لَهٗ عٰبِدُوۡنَ"},{"ar":"قُلۡ اَ تُحَآجُّوۡنَـنَا فِى اللّٰهِ وَهُوَ رَبُّنَا وَرَبُّکُمۡۚ وَلَنَآ اَعۡمَالُـنَا وَلَـكُمۡ اَعۡمَالُكُمۡۚ وَنَحۡنُ لَهٗ مُخۡلِصُوۡنَۙ"},{"ar":"اَمۡ تَقُوۡلُوۡنَ اِنَّ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَالۡاَسۡبَاطَ كَانُوۡا هُوۡدًا اَوۡ نَصٰرٰى​ؕ قُلۡ ءَاَنۡـتُمۡ اَعۡلَمُ اَمِ اللّٰهُ​ ؕ وَمَنۡ اَظۡلَمُ مِمَّنۡ كَتَمَ شَهَادَةً عِنۡدَهٗ مِنَ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"سَيَقُوۡلُ السُّفَهَآءُ مِنَ النَّاسِ مَا وَلّٰٮهُمۡ عَنۡ قِبۡلَتِهِمُ الَّتِىۡ كَانُوۡا عَلَيۡهَا ​ؕ قُل لِّلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ ؕ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِراطٍ مُّسۡتَقِيۡمٍ"},{"ar":"وَكَذٰلِكَ جَعَلۡنٰكُمۡ اُمَّةً وَّسَطًا لِّتَکُوۡنُوۡا شُهَدَآءَ عَلَى النَّاسِ وَيَكُوۡنَ الرَّسُوۡلُ عَلَيۡكُمۡ شَهِيۡدًا ؕ وَمَا جَعَلۡنَا الۡقِبۡلَةَ الَّتِىۡ كُنۡتَ عَلَيۡهَآ اِلَّا لِنَعۡلَمَ مَنۡ يَّتَّبِعُ الرَّسُوۡلَ مِمَّنۡ يَّنۡقَلِبُ عَلٰى عَقِبَيۡهِ ​ؕ وَاِنۡ كَانَتۡ لَكَبِيۡرَةً اِلَّا عَلَى الَّذِيۡنَ هَدَى اللّٰهُ ؕ وَمَا كَانَ اللّٰهُ لِيُضِيْعَ اِيۡمَانَكُمۡ​ ؕ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوۡفٌ رَّحِيۡمٌ"},{"ar":"قَدۡ نَرٰى تَقَلُّبَ وَجۡهِكَ فِى السَّمَآءِ​​ۚ فَلَـنُوَلِّيَنَّكَ قِبۡلَةً تَرۡضٰٮهَا​ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَكُمۡ شَطۡرَهٗ ​ؕ وَاِنَّ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ لَيَـعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا يَعۡمَلُوۡنَ"},{"ar":"وَلَٮِٕنۡ اَ تَيۡتَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ بِكُلِّ اٰيَةٍ مَّا تَبِعُوۡا قِبۡلَتَكَ​ۚ وَمَآ اَنۡتَ بِتَابِعٍ قِبۡلَتَهُمۡ​ۚ وَمَا بَعۡضُهُمۡ بِتَابِعٍ قِبۡلَةَ بَعۡضٍؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَكَ مِنَ الۡعِلۡمِ​ۙ اِنَّكَ اِذًا لَّمِنَ الظّٰلِمِيۡنَ​ۘ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَعۡرِفُوۡنَهٗ كَمَا يَعۡرِفُوۡنَ اَبۡنَآءَهُمۡؕ وَاِنَّ فَرِيۡقًا مِّنۡهُمۡ لَيَكۡتُمُوۡنَ الۡحَـقَّ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"اَلۡحَـقُّ مِنۡ رَّبِّكَ فَلَا تَكُوۡنَنَّ مِنَ الۡمُمۡتَرِيۡنَ"},{"ar":"وَلِكُلٍّ وِّجۡهَةٌ هُوَ مُوَلِّيۡهَا ​ۚ فَاسۡتَبِقُوا الۡخَيۡرٰتِؕ اَيۡنَ مَا تَكُوۡنُوۡا يَاۡتِ بِكُمُ اللّٰهُ جَمِيۡعًا ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَاِنَّهٗ لَـلۡحَقُّ مِنۡ رَّبِّكَؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَڪُمۡ شَطۡرَهٗ ۙ لِئَلَّا يَكُوۡنَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ اِلَّا الَّذِيۡنَ ظَلَمُوۡا مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَاخۡشَوۡنِىۡ وَلِاُتِمَّ نِعۡمَتِىۡ عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُوۡنَ ۙ​ۛ"},{"ar":"كَمَآ اَرۡسَلۡنَا فِيۡکُمۡ رَسُوۡلًا مِّنۡکُمۡ يَتۡلُوۡا عَلَيۡكُمۡ اٰيٰتِنَا وَيُزَكِّيۡکُمۡ وَيُعَلِّمُکُمُ الۡكِتٰبَ وَالۡحِکۡمَةَ وَيُعَلِّمُكُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ ؕ​ۛ"},{"ar":"فَاذۡكُرُوۡنِىۡٓ اَذۡكُرۡكُمۡ وَاشۡکُرُوۡا لِىۡ وَلَا تَكۡفُرُوۡنِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا اسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ؕ اِنَّ اللّٰهَ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَا تَقُوۡلُوۡا لِمَنۡ يُّقۡتَلُ فِىۡ سَبِيۡلِ اللّٰهِ اَمۡوَاتٌ ؕ بَلۡ اَحۡيَآءٌ وَّلٰـكِنۡ لَّا تَشۡعُرُوۡنَ"},{"ar":"وَلَـنَبۡلُوَنَّكُمۡ بِشَىۡءٍ مِّنَ الۡخَـوۡفِ وَالۡجُـوۡعِ وَنَقۡصٍ مِّنَ الۡاَمۡوَالِ وَالۡاَنۡفُسِ وَالثَّمَرٰتِؕ وَبَشِّرِ الصّٰبِرِيۡنَۙ"},{"ar":"الَّذِيۡنَ اِذَآ اَصَابَتۡهُمۡ مُّصِيۡبَةٌ  ۙ قَالُوۡٓا اِنَّا لِلّٰهِ وَاِنَّـآ اِلَيۡهِ رٰجِعُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلَيۡهِمۡ صَلَوٰتٌ مِّنۡ رَّبِّهِمۡ وَرَحۡمَةٌ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُهۡتَدُوۡنَ"},{"ar":"اِنَّ الصَّفَا وَالۡمَرۡوَةَ مِنۡ شَعَآٮِٕرِ اللّٰهِۚ فَمَنۡ حَجَّ الۡبَيۡتَ اَوِ اعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ اَنۡ يَّطَّوَّفَ بِهِمَا ؕ وَمَنۡ تَطَوَّعَ خَيۡرًا ۙ فَاِنَّ اللّٰهَ شَاكِرٌ عَلِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلۡنَا مِنَ الۡبَيِّنٰتِ وَالۡهُدٰى مِنۡۢ بَعۡدِ مَا بَيَّنّٰهُ لِلنَّاسِ فِى الۡكِتٰبِۙ اُولٰٓٮِٕكَ يَلۡعَنُهُمُ اللّٰهُ وَ يَلۡعَنُهُمُ اللّٰعِنُوۡنَۙ"},{"ar":"اِلَّا الَّذِيۡنَ تَابُوۡا وَاَصۡلَحُوۡا وَبَيَّـنُوۡا فَاُولٰٓٮِٕكَ اَ تُوۡبُ عَلَيۡهِمۡۚ وَاَنَا التَّوَّابُ الرَّحِيۡمُ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا وَمَاتُوۡا وَهُمۡ كُفَّارٌ اُولٰٓٮِٕكَ عَلَيۡهِمۡ لَعۡنَةُ اللّٰهِ وَالۡمَلٰٓٮِٕكَةِ وَالنَّاسِ اَجۡمَعِيۡنَۙ"},{"ar":"خٰلِدِيۡنَ فِيۡهَا ۚ لَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡظَرُوۡنَ"},{"ar":"وَاِلٰهُكُمۡ اِلٰهٌ وَّاحِدٌ  ۚ لَآ اِلٰهَ اِلَّا هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ"},{"ar":"اِنَّ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ وَاخۡتِلَافِ الَّيۡلِ وَالنَّهَارِ وَالۡفُلۡكِ الَّتِىۡ تَجۡرِىۡ فِى الۡبَحۡرِ بِمَا يَنۡفَعُ النَّاسَ وَمَآ اَنۡزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنۡ مَّآءٍ فَاَحۡيَا بِهِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيۡهَا مِنۡ کُلِّ دَآ بَّةٍ وَّتَصۡرِيۡفِ الرِّيٰحِ وَالسَّحَابِ الۡمُسَخَّرِ بَيۡنَ السَّمَآءِ وَالۡاَرۡضِ لَاٰيٰتٍ لِّقَوۡمٍ يَّعۡقِلُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّتَّخِذُ مِنۡ دُوۡنِ اللّٰهِ اَنۡدَادًا يُّحِبُّوۡنَهُمۡ كَحُبِّ اللّٰهِؕ وَالَّذِيۡنَ اٰمَنُوۡٓا اَشَدُّ حُبًّا لِّلّٰهِ ؕ وَلَوۡ يَرَى الَّذِيۡنَ ظَلَمُوۡٓا اِذۡ يَرَوۡنَ الۡعَذَابَۙ اَنَّ الۡقُوَّةَ لِلّٰهِ جَمِيۡعًا ۙ وَّاَنَّ اللّٰهَ شَدِيۡدُ الۡعَذَابِ"},{"ar":"اِذۡ تَبَرَّاَ الَّذِيۡنَ اتُّبِعُوۡا مِنَ الَّذِيۡنَ اتَّبَعُوۡا وَرَاَوُا الۡعَذَابَ وَ تَقَطَّعَتۡ بِهِمُ الۡاَسۡبَابُ"},{"ar":"وَقَالَ الَّذِيۡنَ اتَّبَعُوۡا لَوۡ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنۡهُمۡ كَمَا تَبَرَّءُوۡا مِنَّا ؕ كَذٰلِكَ يُرِيۡهِمُ اللّٰهُ اَعۡمَالَهُمۡ حَسَرٰتٍ عَلَيۡهِمۡؕ وَمَا هُمۡ بِخٰرِجِيۡنَ مِنَ النَّارِ"},{"ar":"يٰٓاَيُّهَا النَّاسُ كُلُوۡا مِمَّا فِى الۡاَرۡضِ حَلٰلًا طَيِّبًا  ۖ وَّلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِؕ اِنَّهٗ لَـكُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"اِنَّمَا يَاۡمُرُكُمۡ بِالسُّوۡٓءِ وَالۡفَحۡشَآءِ وَاَنۡ تَقُوۡلُوۡا عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمُ اتَّبِعُوۡا مَآ اَنۡزَلَ اللّٰهُ قَالُوۡا بَلۡ نَـتَّبِعُ مَآ اَلۡفَيۡنَا عَلَيۡهِ اٰبَآءَنَا ؕ اَوَلَوۡ كَانَ اٰبَآؤُهُمۡ لَا يَعۡقِلُوۡنَ شَيۡـًٔـا وَّلَا يَهۡتَدُوۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ کَفَرُوۡا كَمَثَلِ الَّذِىۡ يَنۡعِقُ بِمَا لَا يَسۡمَعُ اِلَّا دُعَآءً وَّنِدَآءً ؕ صُمٌّۢ بُكۡمٌ عُمۡـىٌ فَهُمۡ لَا يَعۡقِلُوۡنَ"},{"ar":"يٰٓاَ يُّهَا الَّذِيۡنَ اٰمَنُوۡا کُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ وَاشۡكُرُوۡا لِلّٰهِ اِنۡ کُنۡتُمۡ اِيَّاهُ تَعۡبُدُوۡنَ"},{"ar":"اِنَّمَا حَرَّمَ عَلَيۡکُمُ الۡمَيۡتَةَ وَالدَّمَ وَلَحۡمَ الۡخِنۡزِيۡرِ وَمَآ اُهِلَّ بِهٖ لِغَيۡرِ اللّٰهِ​ۚ فَمَنِ اضۡطُرَّ غَيۡرَ بَاغٍ وَّلَا عَادٍ فَلَاۤ اِثۡمَ عَلَيۡهِ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلَ اللّٰهُ مِنَ الۡکِتٰبِ وَ يَشۡتَرُوۡنَ بِهٖ ثَمَنًا قَلِيۡلًا ۙ اُولٰٓٮِٕكَ مَا يَاۡكُلُوۡنَ فِىۡ بُطُوۡنِهِمۡ اِلَّا النَّارَ وَلَا يُکَلِّمُهُمُ اللّٰهُ يَوۡمَ الۡقِيٰمَةِ وَلَا يُزَکِّيۡهِمۡ ۖۚ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى وَالۡعَذَابَ بِالۡمَغۡفِرَةِ​ ۚ فَمَآ اَصۡبَرَهُمۡ عَلَى النَّارِ"},{"ar":"ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الۡکِتٰبَ بِالۡحَـقِّؕ وَاِنَّ الَّذِيۡنَ اخۡتَلَفُوۡا فِى الۡكِتٰبِ لَفِىۡ شِقَاقٍۢ بَعِيۡدٍ"},{"ar":"لَيۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡهَكُمۡ قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَلٰـكِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَالۡمَلٰٓٮِٕکَةِ وَالۡكِتٰبِ وَالنَّبِيّٖنَ​ۚ وَاٰتَى الۡمَالَ عَلٰى حُبِّهٖ ذَوِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنَ وَابۡنَ السَّبِيۡلِۙ وَالسَّآٮِٕلِيۡنَ وَفِى الرِّقَابِ​ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّکٰوةَ ​ ۚ وَالۡمُوۡفُوۡنَ بِعَهۡدِهِمۡ اِذَا عٰهَدُوۡا ۚ وَالصّٰبِرِيۡنَ فِى الۡبَاۡسَآءِ وَالضَّرَّآءِ وَحِيۡنَ الۡبَاۡسِؕ اُولٰٓٮِٕكَ الَّذِيۡنَ صَدَقُوۡا ؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُتَّقُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡكُمُ الۡقِصَاصُ فِى الۡقَتۡلٰى  ؕ الۡحُرُّ بِالۡحُـرِّ وَالۡعَبۡدُ بِالۡعَبۡدِ وَالۡاُنۡثَىٰ بِالۡاُنۡثٰىؕ فَمَنۡ عُفِىَ لَهٗ مِنۡ اَخِيۡهِ شَىۡءٌ فَاتِّبَاعٌۢ بِالۡمَعۡرُوۡفِ وَاَدَآءٌ اِلَيۡهِ بِاِحۡسَانٍؕ ذٰلِكَ تَخۡفِيۡفٌ مِّنۡ رَّبِّكُمۡ وَرَحۡمَةٌ  ؕ فَمَنِ اعۡتَدٰى بَعۡدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيۡمٌۚ"},{"ar":"وَ لَـكُمۡ فِى الۡقِصَاصِ حَيٰوةٌ يّٰٓـاُولِىۡ الۡاَلۡبَابِ لَعَلَّکُمۡ تَتَّقُوۡنَ"},{"ar":"كُتِبَ عَلَيۡكُمۡ اِذَا حَضَرَ اَحَدَكُمُ الۡمَوۡتُ اِنۡ تَرَكَ خَيۡرَا  ۖۚ اۨلۡوَصِيَّةُ لِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ بِالۡمَعۡرُوۡفِۚ حَقًّا عَلَى الۡمُتَّقِيۡنَؕ"},{"ar":"فَمَنۡۢ بَدَّلَهٗ بَعۡدَمَا سَمِعَهٗ فَاِنَّمَآ اِثۡمُهٗ عَلَى الَّذِيۡنَ يُبَدِّلُوۡنَهٗؕ اِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌؕ"},{"ar":"فَمَنۡ خَافَ مِنۡ مُّوۡصٍ جَنَفًا اَوۡ اِثۡمًا فَاَصۡلَحَ بَيۡنَهُمۡ فَلَاۤ اِثۡمَ عَلَيۡهِؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يٰٓـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡکُمُ الصِّيَامُ کَمَا كُتِبَ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَۙ"},{"ar":"اَيَّامًا مَّعۡدُوۡدٰتٍؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَ​ؕ وَعَلَى الَّذِيۡنَ يُطِيۡقُوۡنَهٗ فِدۡيَةٌ طَعَامُ مِسۡكِيۡنٍؕ فَمَنۡ تَطَوَّعَ خَيۡرًا فَهُوَ خَيۡرٌ لَّهٗ ؕ وَاَنۡ تَصُوۡمُوۡا خَيۡرٌ لَّـکُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"شَهۡرُ رَمَضَانَ الَّذِىۡٓ اُنۡزِلَ فِيۡهِ الۡقُرۡاٰنُ هُدًى لِّلنَّاسِ وَ بَيِّنٰتٍ مِّنَ الۡهُدٰى وَالۡفُرۡقَانِۚ فَمَنۡ شَهِدَ مِنۡكُمُ الشَّهۡرَ فَلۡيَـصُمۡهُ ؕ وَمَنۡ کَانَ مَرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَؕ يُرِيۡدُ اللّٰهُ بِکُمُ الۡيُسۡرَ وَلَا يُرِيۡدُ بِکُمُ الۡعُسۡرَ وَلِتُکۡمِلُوا الۡعِدَّةَ وَلِتُکَبِّرُوا اللّٰهَ عَلٰى مَا هَدٰٮكُمۡ وَلَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذَا سَاَلَـكَ عِبَادِىۡ عَنِّىۡ فَاِنِّىۡ قَرِيۡبٌؕ اُجِيۡبُ دَعۡوَةَ الدَّاعِ اِذَا دَعَانِ فَلۡيَسۡتَجِيۡبُوۡا لِىۡ وَلۡيُؤۡمِنُوۡا بِىۡ لَعَلَّهُمۡ يَرۡشُدُوۡنَ"},{"ar":"اُحِلَّ لَـکُمۡ لَيۡلَةَ الصِّيَامِ الرَّفَثُ اِلٰى نِسَآٮِٕكُمۡ​ؕ هُنَّ لِبَاسٌ لَّـكُمۡ وَاَنۡـتُمۡ لِبَاسٌ لَّهُنَّ ؕ عَلِمَ اللّٰهُ اَنَّکُمۡ كُنۡتُمۡ تَخۡتَانُوۡنَ اَنۡفُسَکُمۡ فَتَابَ عَلَيۡكُمۡ وَعَفَا عَنۡكُمۡۚ فَالۡـــٰٔنَ بَاشِرُوۡهُنَّ وَابۡتَغُوۡا مَا کَتَبَ اللّٰهُ لَـكُمۡ وَكُلُوۡا وَاشۡرَبُوۡا حَتّٰى يَتَبَيَّنَ لَـكُمُ الۡخَـيۡطُ الۡاَبۡيَضُ مِنَ الۡخَـيۡطِ الۡاَسۡوَدِ مِنَ الۡفَجۡرِ​ؕ ثُمَّ اَتِمُّوا الصِّيَامَ اِلَى الَّيۡلِ​ۚ وَلَا تُبَاشِرُوۡهُنَّ وَاَنۡـتُمۡ عٰكِفُوۡنَ فِى الۡمَسٰجِدِؕ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَقۡرَبُوۡهَا ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَّقُوۡنَ"},{"ar":"وَلَا تَاۡكُلُوۡٓا اَمۡوَالَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ وَتُدۡلُوۡا بِهَآ اِلَى الۡحُـکَّامِ لِتَاۡکُلُوۡا فَرِيۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡاَهِلَّةِ ​ؕ قُلۡ هِىَ مَوَاقِيۡتُ لِلنَّاسِ وَالۡحَجِّ ؕ وَلَيۡسَ الۡبِرُّ بِاَنۡ تَاۡتُوا الۡبُيُوۡتَ مِنۡ ظُهُوۡرِهَا وَلٰـكِنَّ الۡبِرَّ مَنِ اتَّقٰى​ۚ وَاۡتُوا الۡبُيُوۡتَ مِنۡ اَبۡوَابِهَا وَاتَّقُوا اللّٰهَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ الَّذِيۡنَ يُقَاتِلُوۡنَكُمۡ وَلَا تَعۡتَدُوۡا ؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُعۡتَدِيۡنَ"},{"ar":"وَاقۡتُلُوۡهُمۡ حَيۡثُ ثَقِفۡتُمُوۡهُمۡ وَاَخۡرِجُوۡهُمۡ مِّنۡ حَيۡثُ اَخۡرَجُوۡكُمۡ​ وَالۡفِتۡنَةُ اَشَدُّ مِنَ الۡقَتۡلِۚ وَلَا تُقٰتِلُوۡهُمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَـرَامِ حَتّٰى يُقٰتِلُوۡكُمۡ فِيۡهِ​ۚ فَاِنۡ قٰتَلُوۡكُمۡ فَاقۡتُلُوۡهُمۡؕ كَذٰلِكَ جَزَآءُ الۡكٰفِرِيۡنَ"},{"ar":"فَاِنِ انۡـتَهَوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَقٰتِلُوۡهُمۡ حَتّٰى لَا تَكُوۡنَ فِتۡنَةٌ وَّيَكُوۡنَ الدِّيۡنُ لِلّٰهِ​ؕ فَاِنِ انتَهَوۡا فَلَا عُدۡوَانَ اِلَّا عَلَى الظّٰلِمِيۡنَ"},{"ar":"اَلشَّهۡرُ الۡحَـرَامُ بِالشَّهۡرِ الۡحَـرَامِ وَالۡحُرُمٰتُ قِصَاصٌ​ؕ فَمَنِ اعۡتَدٰى عَلَيۡكُمۡ فَاعۡتَدُوۡا عَلَيۡهِ بِمِثۡلِ مَا اعۡتَدٰى عَلَيۡكُمۡ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ مَعَ الۡمُتَّقِيۡنَ"},{"ar":"وَاَنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلَا تُلۡقُوۡا بِاَيۡدِيۡكُمۡ اِلَى التَّهۡلُكَةِ ۖ  ۛۚ وَاَحۡسِنُوۡا  ۛۚ اِنَّ اللّٰهَ يُحِبُّ الۡمُحۡسِنِيۡنَ"},{"ar":"وَاَتِمُّوا الۡحَجَّ وَالۡعُمۡرَةَ لِلّٰهِؕ فَاِنۡ اُحۡصِرۡتُمۡ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ وَلَا تَحۡلِقُوۡا رُءُوۡسَكُمۡ حَتّٰى يَبۡلُغَ الۡهَدۡىُ مَحِلَّهٗ ؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ بِهٖۤ اَذًى مِّنۡ رَّاۡسِهٖ فَفِدۡيَةٌ مِّنۡ صِيَامٍ اَوۡ صَدَقَةٍ اَوۡ نُسُكٍۚ فَاِذَآ اَمِنۡتُمۡ فَمَنۡ تَمَتَّعَ بِالۡعُمۡرَةِ اِلَى الۡحَجِّ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ فَمَنۡ لَّمۡ يَجِدۡ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ فِى الۡحَجِّ وَسَبۡعَةٍ اِذَا رَجَعۡتُمۡؕ تِلۡكَ عَشَرَةٌ كَامِلَةٌ  ؕ ذٰ لِكَ لِمَنۡ لَّمۡ يَكُنۡ اَهۡلُهٗ حَاضِرِىۡ الۡمَسۡجِدِ الۡحَـرَامِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"اَلۡحَجُّ اَشۡهُرٌ مَّعۡلُوۡمٰتٌ ​ۚ فَمَنۡ فَرَضَ فِيۡهِنَّ الۡحَجَّ فَلَا رَفَثَ وَلَا فُسُوۡقَۙ وَلَا جِدَالَ فِى الۡحَجِّ ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ يَّعۡلَمۡهُ اللّٰهُ ​ؕ وَتَزَوَّدُوۡا فَاِنَّ خَيۡرَ الزَّادِ التَّقۡوٰى وَاتَّقُوۡنِ يٰٓاُولِى الۡاَلۡبَابِ"},{"ar":"​لَيۡسَ عَلَيۡکُمۡ جُنَاحٌ اَنۡ تَبۡتَغُوۡا فَضۡلًا مِّنۡ رَّبِّکُمۡؕ فَاِذَآ اَفَضۡتُمۡ مِّنۡ عَرَفٰتٍ فَاذۡکُرُوا اللّٰهَ عِنۡدَ الۡمَشۡعَرِ الۡحَـرَامِ وَاذۡکُرُوۡهُ کَمَا هَدٰٮکُمۡ​ۚ وَاِنۡ کُنۡتُمۡ مِّنۡ قَبۡلِهٖ لَمِنَ الضَّآ لِّيۡنَ"},{"ar":"ثُمَّ اَفِيۡضُوۡا مِنۡ حَيۡثُ اَفَاضَ النَّاسُ وَاسۡتَغۡفِرُوا اللّٰهَ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"فَاِذَا قَضَيۡتُمۡ مَّنَاسِكَکُمۡ فَاذۡکُرُوا اللّٰهَ كَذِكۡرِكُمۡ اٰبَآءَکُمۡ اَوۡ اَشَدَّ ذِکۡرًا ؕ فَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا وَمَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ"},{"ar":"وَمِنۡهُمۡ مَّنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا حَسَنَةً وَّفِى الۡاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ"},{"ar":"اُولٰٓٮِٕكَ لَهُمۡ نَصِيۡبٌ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ سَرِيۡعُ الۡحِسَابِ"},{"ar":"وَاذۡكُرُوا اللّٰهَ فِىۡٓ اَيَّامٍ مَّعۡدُوۡدٰتٍ​ؕ فَمَنۡ تَعَجَّلَ فِىۡ يَوۡمَيۡنِ فَلَاۤ اِثۡمَ عَلَيۡهِ ۚ وَمَنۡ تَاَخَّرَ فَلَاۤ اِثۡمَ عَلَيۡه​ِ ۙ لِمَنِ اتَّقٰى ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ اِلَيۡهِ تُحۡشَرُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يُّعۡجِبُكَ قَوۡلُهٗ فِى الۡحَيٰوةِ الدُّنۡيَا وَيُشۡهِدُ اللّٰهَ عَلٰى مَا فِىۡ قَلۡبِهٖۙ وَهُوَ اَلَدُّ الۡخِصَامِ"},{"ar":"وَاِذَا تَوَلّٰى سَعٰى فِى الۡاَرۡضِ لِيُفۡسِدَ فِيۡهَا وَيُهۡلِكَ الۡحَـرۡثَ وَالنَّسۡلَ​ؕ وَاللّٰهُ لَا يُحِبُّ الۡفَسَادَ"},{"ar":"وَاِذَا قِيۡلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتۡهُ الۡعِزَّةُ بِالۡاِثۡمِ​ فَحَسۡبُهٗ جَهَنَّمُ​ؕ وَلَبِئۡسَ الۡمِهَادُ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّشۡرِىۡ نَفۡسَهُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ​ؕ وَ اللّٰهُ رَءُوۡفٌ ۢ بِالۡعِبَادِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا ادۡخُلُوۡا فِى السِّلۡمِ کَآفَّةً  وَلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِ​ؕ اِنَّهٗ لَـکُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"فَاِنۡ زَلَـلۡتُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡکُمُ الۡبَيِّنٰتُ فَاعۡلَمُوۡٓا اَنَّ اللّٰهَ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"هَلۡ يَنۡظُرُوۡنَ اِلَّاۤ اَنۡ يَّاۡتِيَهُمُ اللّٰهُ فِىۡ ظُلَلٍ مِّنَ الۡغَمَامِ وَالۡمَلٰٓٮِٕکَةُ وَقُضِىَ الۡاَمۡرُ​ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ"},{"ar":"سَلۡ بَنِىۡٓ اِسۡرَآءِيۡلَ كَمۡ اٰتَيۡنٰهُمۡ مِّنۡ اٰيَةٍۢ بَيِّنَةٍ ​ؕ وَمَنۡ يُّبَدِّلۡ نِعۡمَةَ اللّٰهِ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُ فَاِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"زُيِّنَ لِلَّذِيۡنَ كَفَرُوا الۡحَيٰوةُ الدُّنۡيَا وَيَسۡخَرُوۡنَ مِنَ الَّذِيۡنَ اٰمَنُوۡا ​ ۘ وَالَّذِيۡنَ اتَّقَوۡا فَوۡقَهُمۡ يَوۡمَ الۡقِيٰمَةِ ؕ وَاللّٰهُ يَرۡزُقُ مَنۡ يَّشَآءُ بِغَيۡرِ حِسَابٍ"},{"ar":"كَانَ النَّاسُ اُمَّةً وَّاحِدَةً  فَبَعَثَ اللّٰهُ النَّبِيّٖنَ مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ وَاَنۡزَلَ مَعَهُمُ الۡكِتٰبَ بِالۡحَـقِّ لِيَحۡكُمَ بَيۡنَ النَّاسِ فِيۡمَا اخۡتَلَفُوۡا فِيۡهِ ​ؕ وَمَا اخۡتَلَفَ فِيۡهِ اِلَّا الَّذِيۡنَ اُوۡتُوۡهُ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ بَغۡيًا ۢ بَيۡنَهُمۡ​ۚ فَهَدَى اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا لِمَا اخۡتَلَفُوۡا فِيۡهِ مِنَ الۡحَـقِّ بِاِذۡنِهٖ​ ؕ وَاللّٰهُ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ"},{"ar":"اَمۡ حَسِبۡتُمۡ اَنۡ تَدۡخُلُوا الۡجَـنَّةَ وَ لَمَّا يَاۡتِكُمۡ مَّثَلُ الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلِكُمۡؕ مَسَّتۡهُمُ الۡبَاۡسَآءُ وَالضَّرَّآءُ وَزُلۡزِلُوۡا حَتّٰى يَقُوۡلَ الرَّسُوۡلُ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ مَتٰى نَصۡرُ اللّٰهِؕ اَلَاۤ اِنَّ نَصۡرَ اللّٰهِ قَرِيۡبٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَ ؕ قُلۡ مَآ اَنۡفَقۡتُمۡ مِّنۡ خَيۡرٍ فَلِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنِ وَابۡنِ السَّبِيۡلِ​ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"كُتِبَ عَلَيۡکُمُ الۡقِتَالُ وَهُوَ كُرۡهٌ لَّـكُمۡ​ۚ وَعَسٰۤى اَنۡ تَكۡرَهُوۡا شَيۡـــًٔا وَّهُوَ خَيۡرٌ لَّـکُمۡ​ۚ وَعَسٰۤى اَنۡ تُحِبُّوۡا شَيۡـــًٔا وَّهُوَ شَرٌّ لَّـكُمۡؕ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الشَّهۡرِ الۡحَـرَامِ قِتَالٍ فِيۡهِ​ؕ قُلۡ قِتَالٌ فِيۡهِ كَبِيۡرٌ ​ؕ وَصَدٌّ عَنۡ سَبِيۡلِ اللّٰهِ وَ کُفۡرٌ ۢ بِهٖ وَالۡمَسۡجِدِ الۡحَـرَامِ وَاِخۡرَاجُ اَهۡلِهٖ مِنۡهُ اَكۡبَرُ عِنۡدَ اللّٰهِ ​​ۚ وَالۡفِتۡنَةُ اَکۡبَرُ مِنَ الۡقَتۡلِ​ؕ وَلَا يَزَالُوۡنَ يُقَاتِلُوۡنَكُمۡ حَتّٰى يَرُدُّوۡكُمۡ عَنۡ دِيۡـنِکُمۡ اِنِ اسۡتَطَاعُوۡا ​ؕ وَمَنۡ يَّرۡتَدِدۡ مِنۡكُمۡ عَنۡ دِيۡـنِهٖ فَيَمُتۡ وَهُوَ کَافِرٌ فَاُولٰٓٮِٕكَ حَبِطَتۡ اَعۡمَالُهُمۡ فِى الدُّنۡيَا وَالۡاٰخِرَةِ ​​ۚ وَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَاجَرُوۡا وَجَاهَدُوۡا فِىۡ سَبِيۡلِ اللّٰهِۙ اُولٰٓٮِٕكَ يَرۡجُوۡنَ رَحۡمَتَ اللّٰهِؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡخَمۡرِ وَالۡمَيۡسِرِ​ؕ قُلۡ فِيۡهِمَآ اِثۡمٌ کَبِيۡرٌ وَّمَنَافِعُ لِلنَّاسِ وَاِثۡمُهُمَآ اَکۡبَرُ مِنۡ نَّفۡعِهِمَا ؕ وَيَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَؕ  قُلِ الۡعَفۡوَ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّکُمۡ تَتَفَكَّرُوۡنَۙ"},{"ar":"فِى الدُّنۡيَا وَالۡاٰخِرَةِؕ وَيَسۡـــَٔلُوۡنَكَ عَنِ الۡيَتٰمٰىؕ قُلۡ اِصۡلَاحٌ لَّهُمۡ خَيۡرٌ ؕ وَاِنۡ تُخَالِطُوۡهُمۡ فَاِخۡوَانُكُمۡ​ؕ وَاللّٰهُ يَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ​ؕ وَلَوۡ شَآءَ اللّٰهُ لَاَعۡنَتَكُمۡؕ اِنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"وَلَا تَنۡكِحُوا الۡمُشۡرِكٰتِ حَتّٰى يُؤۡمِنَّ​ؕ وَلَاَمَةٌ مُّؤۡمِنَةٌ خَيۡرٌ مِّنۡ مُّشۡرِكَةٍ وَّلَوۡ اَعۡجَبَتۡكُمۡ​ۚ وَلَا تُنۡكِحُوا الۡمُشۡرِكِيۡنَ حَتّٰى يُؤۡمِنُوۡا ​ؕ وَلَعَبۡدٌ مُّؤۡمِنٌ خَيۡرٌ مِّنۡ مُّشۡرِكٍ وَّلَوۡ اَعۡجَبَكُمۡؕ اُولٰٓٮِٕكَ يَدۡعُوۡنَ اِلَى النَّارِ  ۖۚ وَاللّٰهُ يَدۡعُوۡٓا اِلَى الۡجَـنَّةِ وَالۡمَغۡفِرَةِ بِاِذۡنِهٖ​ۚ وَيُبَيِّنُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُوۡنَ "},{"ar":"وَ يَسۡـــَٔلُوۡنَكَ عَنِ الۡمَحِيۡضِ​ۙ قُلۡ هُوَ اَذًى فَاعۡتَزِلُوۡا النِّسَآءَ فِى الۡمَحِيۡضِ​ۙ وَلَا تَقۡرَبُوۡهُنَّ حَتّٰى يَطۡهُرۡنَ​​ۚ فَاِذَا تَطَهَّرۡنَ فَاۡتُوۡهُنَّ مِنۡ حَيۡثُ اَمَرَكُمُ اللّٰهُ​ؕ اِنَّ اللّٰهَ يُحِبُّ التَّوَّابِيۡنَ وَيُحِبُّ الۡمُتَطَهِّرِيۡنَ"},{"ar":"نِسَآؤُكُمۡ حَرۡثٌ لَّـكُمۡ فَاۡتُوۡا حَرۡثَكُمۡ اَنّٰى شِئۡتُمۡ​  وَقَدِّمُوۡا لِاَنۡفُسِكُمۡ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ مُّلٰقُوۡهُ ​ؕ وَ بَشِّرِ الۡمُؤۡمِنِيۡنَ"},{"ar":"وَلَا تَجۡعَلُوا اللّٰهَ عُرۡضَةً لِّاَيۡمَانِکُمۡ اَنۡ تَبَرُّوۡا وَتَتَّقُوۡا وَتُصۡلِحُوۡا بَيۡنَ النَّاسِ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغۡوِ فِىۡٓ اَيۡمَانِكُمۡ وَلٰـكِنۡ يُّؤَاخِذُكُمۡ بِمَا كَسَبَتۡ قُلُوۡبُكُمۡ​ؕ وَاللّٰهُ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لِّـلَّذِيۡنَ يُؤۡلُوۡنَ مِنۡ نِّسَآٮِٕهِمۡ تَرَبُّصُ اَرۡبَعَةِ اَشۡهُرٍ​​ۚ فَاِنۡ فَآءُوۡ فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَاِنۡ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"وَالۡمُطَلَّقٰتُ يَتَرَ بَّصۡنَ بِاَنۡفُسِهِنَّ ثَلٰثَةَ قُرُوۡٓءٍ ​ؕ وَلَا يَحِلُّ لَهُنَّ اَنۡ يَّكۡتُمۡنَ مَا خَلَقَ اللّٰهُ فِىۡٓ اَرۡحَامِهِنَّ اِنۡ كُنَّ يُؤۡمِنَّ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ وَبُعُوۡلَتُهُنَّ اَحَقُّ بِرَدِّهِنَّ فِىۡ ذٰ لِكَ اِنۡ اَرَادُوۡٓا اِصۡلَاحًا ​ؕ وَلَهُنَّ مِثۡلُ الَّذِىۡ عَلَيۡهِنَّ بِالۡمَعۡرُوۡفِ​ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٌ ​ ؕ وَاللّٰهُ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"اَلطَّلَاقُ مَرَّتٰنِ​ فَاِمۡسَاكٌ ۢ بِمَعۡرُوۡفٍ اَوۡ تَسۡرِيۡحٌ ۢ بِاِحۡسَانٍ​ ؕوَلَا يَحِلُّ لَـکُمۡ اَنۡ تَاۡخُذُوۡا مِمَّآ اٰتَيۡتُمُوۡهُنَّ شَيۡـــًٔا اِلَّاۤ اَنۡ يَّخَافَآ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ فَاِنۡ خِفۡتُمۡ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِۙ فَلَا جُنَاحَ عَلَيۡهِمَا فِيۡمَا افۡتَدَتۡ بِهٖؕ​ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَعۡتَدُوۡهَا ​ۚ​ وَمَنۡ يَّتَعَدَّ حُدُوۡدَ اللّٰهِ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"فَاِنۡ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنۡۢ بَعۡدُ حَتّٰى تَنۡكِحَ زَوۡجًا غَيۡرَهٗ ​ؕ فَاِنۡ طَلَّقَهَا فَلَا جُنَاحَ عَلَيۡهِمَآ اَنۡ يَّتَرَاجَعَآ اِنۡ ظَنَّآ اَنۡ يُّقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ يُبَيِّنُهَا لِقَوۡمٍ يَّعۡلَمُوۡنَ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَاَمۡسِكُوۡهُنَّ بِمَعۡرُوۡفٍ اَوۡ سَرِّحُوۡهُنَّ بِمَعۡرُوۡفٍ​ وَلَا تُمۡسِكُوۡهُنَّ ضِرَارًا لِّتَعۡتَدُوۡا​ ۚ وَمَنۡ يَّفۡعَلۡ ذٰ لِكَ فَقَدۡ ظَلَمَ نَفۡسَهٗ ​ؕ وَلَا تَتَّخِذُوۡٓا اٰيٰتِ اللّٰهِ هُزُوًا​ وَّاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ وَمَآ اَنۡزَلَ عَلَيۡكُمۡ مِّنَ الۡكِتٰبِ وَالۡحِكۡمَةِ يَعِظُكُمۡ بِهٖ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَلَا تَعۡضُلُوۡهُنَّ اَنۡ يَّنۡكِحۡنَ اَزۡوَاجَهُنَّ اِذَا تَرَاضَوۡا بَيۡنَهُمۡ بِالۡمَعۡرُوۡفِ​ؕ ذٰ لِكَ يُوۡعَظُ بِهٖ مَنۡ كَانَ مِنۡكُمۡ يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِؕ ذٰ لِكُمۡ اَزۡکٰى لَـكُمۡ وَاَطۡهَرُؕ​ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"وَالۡوَالِدٰتُ يُرۡضِعۡنَ اَوۡلَادَهُنَّ حَوۡلَيۡنِ كَامِلَيۡنِ​ لِمَنۡ اَرَادَ اَنۡ يُّتِمَّ الرَّضَاعَةَ ​ ؕ وَعَلَى الۡمَوۡلُوۡدِ لَهٗ رِزۡقُهُنَّ وَكِسۡوَتُهُنَّ بِالۡمَعۡرُوۡفِ​ؕ لَا تُكَلَّفُ نَفۡسٌ اِلَّا وُسۡعَهَا ۚ لَا تُضَآرَّ وَالِدَةٌ ۢ بِوَلَدِهَا وَلَا مَوۡلُوۡدٌ لَّهٗ بِوَلَدِهٖ وَعَلَى الۡوَارِثِ مِثۡلُ ذٰ لِكَ ۚ فَاِنۡ اَرَادَا فِصَالًا عَنۡ تَرَاضٍ مِّنۡهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيۡهِمَا ​ؕ وَاِنۡ اَرَدْتُّمۡ اَنۡ تَسۡتَرۡضِعُوۡٓا اَوۡلَادَكُمۡ فَلَا جُنَاحَ عَلَيۡكُمۡ اِذَا سَلَّمۡتُمۡ مَّآ اٰتَيۡتُمۡ بِالۡمَعۡرُوۡفِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡكُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا يَّتَرَبَّصۡنَ بِاَنۡفُسِهِنَّ اَرۡبَعَةَ اَشۡهُرٍ وَّعَشۡرًا ​​ۚ فَاِذَا بَلَغۡنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ بِالۡمَعۡرُوۡفِؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"وَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا عَرَّضۡتُمۡ بِهٖ مِنۡ خِطۡبَةِ النِّسَآءِ اَوۡ اَکۡنَنۡتُمۡ فِىۡٓ اَنۡفُسِكُمۡ​ؕ عَلِمَ اللّٰهُ اَنَّكُمۡ سَتَذۡكُرُوۡنَهُنَّ وَلٰـكِنۡ لَّا تُوَاعِدُوۡهُنَّ سِرًّا اِلَّاۤ اَنۡ تَقُوۡلُوۡا قَوۡلًا مَّعۡرُوۡفًا ​ؕ وَلَا تَعۡزِمُوۡا عُقۡدَةَ النِّکَاحِ حَتّٰى يَبۡلُغَ الۡكِتٰبُ اَجَلَهٗ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ يَعۡلَمُ مَا فِىۡٓ اَنۡفُسِكُمۡ فَاحۡذَرُوۡهُ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لَا جُنَاحَ عَلَيۡكُمۡ اِنۡ طَلَّقۡتُمُ النِّسَآءَ مَا لَمۡ تَمَسُّوۡهُنَّ اَوۡ تَفۡرِضُوۡا لَهُنَّ فَرِيۡضَةً  ۖۚ وَّمَتِّعُوۡهُنَّ ​ۚ عَلَى الۡمُوۡسِعِ قَدَرُهٗ وَ عَلَى الۡمُقۡتِرِ قَدَرُهٗ ​ۚ مَتَاعًا ۢ بِالۡمَعۡرُوۡفِ​​ۚ حَقًّا عَلَى الۡمُحۡسِنِيۡنَ"},{"ar":"وَاِنۡ طَلَّقۡتُمُوۡهُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيۡضَةً فَنِصۡفُ مَا فَرَضۡتُمۡ اِلَّاۤ اَنۡ يَّعۡفُوۡنَ اَوۡ يَعۡفُوَا الَّذِىۡ بِيَدِهٖ عُقۡدَةُ النِّكَاحِ ​ؕ وَاَنۡ تَعۡفُوۡٓا اَقۡرَبُ لِلتَّقۡوٰى​ؕ وَ لَا تَنۡسَوُا الۡفَضۡلَ بَيۡنَكُمۡ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"حَافِظُوۡا عَلَى الصَّلَوٰتِ وَالصَّلٰوةِ الۡوُسۡطٰى وَقُوۡمُوۡا لِلّٰهِ قٰنِتِيۡنَ"},{"ar":"فَاِنۡ خِفۡتُمۡ فَرِجَالًا اَوۡ رُكۡبَانًا ​​ ۚ فَاِذَآ اَمِنۡتُمۡ فَاذۡکُرُوا اللّٰهَ کَمَا عَلَّمَکُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡکُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا  ۖۚ وَّصِيَّةً لِّاَزۡوَاجِهِمۡ مَّتَاعًا اِلَى الۡحَـوۡلِ غَيۡرَ اِخۡرَاجٍ​​ ۚ فَاِنۡ خَرَجۡنَ فَلَا جُنَاحَ عَلَيۡکُمۡ فِىۡ مَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ مِنۡ مَّعۡرُوۡفٍؕ وَاللّٰهُ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"وَلِلۡمُطَلَّقٰتِ مَتَاعٌ ۢ بِالۡمَعۡرُوۡفِ ​ؕ حَقًّا عَلَى الۡمُتَّقِيۡنَ"},{"ar":"كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِيۡنَ خَرَجُوۡا مِنۡ دِيَارِهِمۡ وَهُمۡ اُلُوۡفٌ حَذَرَ الۡمَوۡتِ فَقَالَ لَهُمُ اللّٰهُ مُوۡتُوۡا ثُمَّ اَحۡيَاھُمۡ​ؕ اِنَّ اللّٰهَ لَذُوۡ فَضۡلٍ عَلَى النَّاسِ وَلٰـكِنَّ اَکۡثَرَ النَّاسِ لَا يَشۡکُرُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗۤ اَضۡعَافًا کَثِيۡرَةً  ​ؕ وَاللّٰهُ يَقۡبِضُ وَيَبۡصُۜطُ وَ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الۡمَلَاِ مِنۡۢ بَنِىۡٓ اِسۡرَآءِيۡلَ مِنۡۢ بَعۡدِ مُوۡسٰى​ۘ اِذۡ قَالُوۡا لِنَبِىٍّ لَّهُمُ ابۡعَثۡ لَنَا مَلِکًا نُّقَاتِلۡ فِىۡ سَبِيۡلِ اللّٰهِ​ؕ قَالَ هَلۡ عَسَيۡتُمۡ اِنۡ کُتِبَ عَلَيۡکُمُ الۡقِتَالُ اَلَّا تُقَاتِلُوۡا ؕ قَالُوۡا وَمَا لَنَآ اَلَّا نُقَاتِلَ فِىۡ سَبِيۡلِ اللّٰهِ وَقَدۡ اُخۡرِجۡنَا مِنۡ دِيَارِنَا وَاَبۡنَآٮِٕنَا ​ؕ فَلَمَّا کُتِبَ عَلَيۡهِمُ الۡقِتَالُ تَوَلَّوۡا اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اللّٰهَ قَدۡ بَعَثَ لَـکُمۡ طَالُوۡتَ مَلِكًا ​ؕ قَالُوۡٓا اَنّٰى يَكُوۡنُ لَهُ الۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ اَحَقُّ بِالۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةً مِّنَ الۡمَالِ​ؕ قَالَ اِنَّ اللّٰهَ اصۡطَفٰٮهُ عَلَيۡکُمۡ وَزَادَهٗ بَسۡطَةً فِى الۡعِلۡمِ وَ الۡجِسۡمِ​ؕ وَاللّٰهُ يُؤۡتِىۡ مُلۡکَهٗ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اٰيَةَ مُلۡکِهٖۤ اَنۡ يَّاۡتِيَکُمُ التَّابُوۡتُ فِيۡهِ سَکِيۡنَةٌ مِّنۡ رَّبِّکُمۡ وَبَقِيَّةٌ مِّمَّا تَرَكَ اٰلُ مُوۡسٰى وَاٰلُ هٰرُوۡنَ تَحۡمِلُهُ الۡمَلٰٓٮِٕكَةُ​ ؕ اِنَّ فِىۡ ذٰلِكَ لَاٰيَةً لَّـکُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَلَمَّا فَصَلَ طَالُوۡتُ بِالۡجُـنُوۡدِۙ قَالَ اِنَّ اللّٰهَ مُبۡتَلِيۡکُمۡ بِنَهَرٍ​ۚ فَمَنۡ شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّىۡ​ۚ وَمَنۡ لَّمۡ يَطۡعَمۡهُ فَاِنَّهٗ مِنِّىۡٓ اِلَّا مَنِ اغۡتَرَفَ غُرۡفَةً ۢ بِيَدِهٖ​​ۚ فَشَرِبُوۡا مِنۡهُ اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ فَلَمَّا جَاوَزَهٗ هُوَ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ ۙ قَالُوۡا لَا طَاقَةَ لَنَا الۡيَوۡمَ بِجَالُوۡتَ وَجُنُوۡدِهٖ​ؕ قَالَ الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوا اللّٰهِۙ کَمۡ مِّنۡ فِئَةٍ قَلِيۡلَةٍ غَلَبَتۡ فِئَةً کَثِيۡرَةً ۢ بِاِذۡنِ اللّٰهِ​ؕ وَاللّٰهُ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَمَّا بَرَزُوۡا لِجَـالُوۡتَ وَجُنُوۡدِهٖ قَالُوۡا رَبَّنَآ اَفۡرِغۡ عَلَيۡنَا صَبۡرًا وَّثَبِّتۡ اَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡکٰفِرِيۡنَؕ"},{"ar":"فَهَزَمُوۡهُمۡ بِاِذۡنِ اللّٰهِ ۙ وَقَتَلَ دَاوٗدُ جَالُوۡتَ وَاٰتٰٮهُ اللّٰهُ الۡمُلۡكَ وَالۡحِکۡمَةَ وَعَلَّمَهٗ مِمَّا يَشَآءُ ​ؕ وَلَوۡلَا دَفۡعُ اللّٰهِ النَّاسَ بَعۡضَهُمۡ بِبَعۡضٍ لَّفَسَدَتِ الۡاَرۡضُ وَلٰـکِنَّ اللّٰهَ ذُوۡ فَضۡلٍ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"تِلۡكَ اٰيٰتُ اللّٰهِ نَـتۡلُوۡهَا عَلَيۡكَ بِالۡحَـقِّ​ؕ وَاِنَّكَ لَمِنَ الۡمُرۡسَلِيۡنَ"},{"ar":"تِلۡكَ الرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلٰى بَعۡضٍ​ۘ مِنۡهُمۡ مَّنۡ كَلَّمَ اللّٰهُ​ وَرَفَعَ بَعۡضَهُمۡ دَرَجٰتٍ​ؕ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلَ الَّذِيۡنَ مِنۡۢ بَعۡدِهِمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ وَلٰـكِنِ اخۡتَلَفُوۡا فَمِنۡهُمۡ مَّنۡ اٰمَنَ وَمِنۡهُمۡ مَّنۡ كَفَرَ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلُوۡا وَلٰـكِنَّ اللّٰهَ يَفۡعَلُ مَا يُرِيۡدُ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِمَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ يَوۡمٌ لَّا بَيۡعٌ فِيۡهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ ​ ؕ وَالۡكٰفِرُوۡنَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَـىُّ الۡقَيُّوۡمُۚ  لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ​ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ​ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ​ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ​​ۚ وَلَا يَـــُٔوۡدُهٗ حِفۡظُهُمَا ​ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ"},{"ar":"لَاۤ اِكۡرَاهَ فِى الدِّيۡنِ​ۙ  قَد تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَىِّ​ۚ فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡۢ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقٰى لَا انْفِصَامَ لَهَا​​ ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"اَللّٰهُ وَلِىُّ الَّذِيۡنَ اٰمَنُوۡا يُخۡرِجُهُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ​ؕ  وَالَّذِيۡنَ كَفَرُوۡۤا اَوۡلِيٰٓـــُٔهُمُ الطَّاغُوۡتُۙ يُخۡرِجُوۡنَهُمۡ مِّنَ النُّوۡرِ اِلَى الظُّلُمٰتِ​ؕ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِىۡ حَآجَّ اِبۡرٰهٖمَ فِىۡ رَبِّهٖۤ اَنۡ اٰتٰٮهُ اللّٰهُ الۡمُلۡكَ​ۘ اِذۡ قَالَ اِبۡرٰهٖمُ رَبِّىَ الَّذِىۡ يُحۡىٖ وَيُمِيۡتُۙ قَالَ اَنَا اُحۡىٖ وَاُمِيۡتُ​ؕ قَالَ اِبۡرٰهٖمُ فَاِنَّ اللّٰهَ يَاۡتِىۡ بِالشَّمۡسِ مِنَ الۡمَشۡرِقِ فَاۡتِ بِهَا مِنَ الۡمَغۡرِبِ فَبُهِتَ الَّذِىۡ كَفَرَ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ​ۚ"},{"ar":"اَوۡ كَالَّذِىۡ مَرَّ عَلٰى قَرۡيَةٍ وَّ هِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا ​ۚ قَالَ اَنّٰى يُحۡىٖ هٰذِهِ اللّٰهُ بَعۡدَ مَوۡتِهَا ​ۚ فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ ​ؕ قَالَ كَمۡ لَبِثۡتَ​ؕ قَالَ لَبِثۡتُ يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ​ؕ قَالَ بَلۡ لَّبِثۡتَ مِائَةَ عَامٍ فَانۡظُرۡ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡ​ۚ وَانْظُرۡ اِلٰى حِمَارِكَ وَلِنَجۡعَلَكَ اٰيَةً لِّلنَّاسِ​ وَانْظُرۡ اِلَى الۡعِظَامِ كَيۡفَ نُـنۡشِزُهَا ثُمَّ نَكۡسُوۡهَا لَحۡمًا ​ؕ فَلَمَّا تَبَيَّنَ لَهٗ ۙ قَالَ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اَرِنِىۡ كَيۡفَ تُحۡىِ الۡمَوۡتٰى ؕ قَالَ اَوَلَمۡ تُؤۡمِنۡ​ؕ قَالَ بَلٰى وَلٰـكِنۡ لِّيَطۡمَٮِٕنَّ قَلۡبِىۡ​ؕ قَالَ فَخُذۡ اَرۡبَعَةً مِّنَ الطَّيۡرِ فَصُرۡهُنَّ اِلَيۡكَ ثُمَّ اجۡعَلۡ عَلٰى كُلِّ جَبَلٍ مِّنۡهُنَّ جُزۡءًا ثُمَّ ادۡعُهُنَّ يَاۡتِيۡنَكَ سَعۡيًا ​ؕ وَاعۡلَمۡ اَنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"مَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِىۡ كُلِّ سُنۡۢبُلَةٍ مِّائَةُ حَبَّةٍ​ؕ وَاللّٰهُ يُضٰعِفُ لِمَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ ثُمَّ لَا يُتۡبِعُوۡنَ مَاۤ اَنۡفَقُوۡا مَنًّا وَّلَاۤ اَذًى​ۙ لَّهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"قَوۡلٌ مَّعۡرُوۡفٌ وَّمَغۡفِرَةٌ خَيۡرٌ مِّنۡ صَدَقَةٍ يَّتۡبَعُهَاۤ اَذًى​ؕ وَاللّٰهُ غَنِىٌّ حَلِيۡمٌ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِكُمۡ بِالۡمَنِّ وَالۡاَذٰىۙ كَالَّذِىۡ يُنۡفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ فَمَثَلُهٗ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلۡدًا ​ؕ لَا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الۡـكٰفِرِيۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ وَ تَثۡبِيۡتًا مِّنۡ اَنۡفُسِهِمۡ كَمَثَلِ جَنَّةٍۢ بِرَبۡوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتۡ اُكُلَهَا ضِعۡفَيۡنِ​ۚ فَاِنۡ لَّمۡ يُصِبۡهَا وَابِلٌ فَطَلٌّ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"اَيَوَدُّ اَحَدُكُمۡ اَنۡ تَكُوۡنَ لَهٗ جَنَّةٌ مِّنۡ نَّخِيۡلٍ وَّاَعۡنَابٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُۙ لَهٗ فِيۡهَا مِنۡ كُلِّ الثَّمَرٰتِۙ وَاَصَابَهُ الۡكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَآءُ ۖۚ فَاَصَابَهَاۤ اِعۡصَارٌ فِيۡهِ نَارٌ فَاحۡتَرَقَتۡ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّكُمۡ تَتَفَكَّرُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِنۡ طَيِّبٰتِ مَا كَسَبۡتُمۡ وَمِمَّاۤ اَخۡرَجۡنَا لَـكُمۡ مِّنَ الۡاَرۡضِ وَلَا تَيَمَّمُوا الۡخَبِيۡثَ مِنۡهُ تُنۡفِقُوۡنَ وَلَسۡتُمۡ بِاٰخِذِيۡهِ اِلَّاۤ اَنۡ تُغۡمِضُوۡا فِيۡهِ​ؕ وَاعۡلَمُوۡۤا اَنَّ اللّٰهَ غَنِىٌّ حَمِيۡدٌ"},{"ar":"اَلشَّيۡطٰنُ يَعِدُكُمُ الۡـفَقۡرَ وَيَاۡمُرُكُمۡ بِالۡفَحۡشَآءِ​ ۚ وَاللّٰهُ يَعِدُكُمۡ مَّغۡفِرَةً مِّنۡهُ وَفَضۡلًا ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌۚ  ۙۖ"},{"ar":"يُؤۡتِى الۡحِكۡمَةَ مَنۡ يَّشَآءُ​​ ۚ وَمَنۡ يُّؤۡتَ الۡحِكۡمَةَ فَقَدۡ اُوۡتِىَ خَيۡرًا كَثِيۡرًا​ ؕ وَمَا يَذَّكَّرُ اِلَّاۤ اُولُوا الۡاَلۡبَابِ"},{"ar":"وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَةٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰهَ يَعۡلَمُهٗ ؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ"},{"ar":"اِنۡ تُبۡدُوا الصَّدَقٰتِ فَنِعِمَّا هِىَ​ۚ وَاِنۡ تُخۡفُوۡهَا وَ تُؤۡتُوۡهَا الۡفُقَرَآءَ فَهُوَ خَيۡرٌ لَّكُمۡ​ؕ وَيُكَفِّرُ عَنۡكُمۡ مِّنۡ سَيِّاٰتِكُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"لَيۡسَ عَلَيۡكَ هُدٰٮهُمۡ وَلٰـكِنَّ اللّٰهَ يَهۡدِىۡ مَنۡ يَّشَآءُ​ ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَلِاَنۡفُسِكُمۡ​ؕ وَمَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡهِ اللّٰهِ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ يُّوَفَّ اِلَيۡكُمۡ وَاَنۡـتُمۡ لَا تُظۡلَمُوۡنَ"},{"ar":"لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِى الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ​ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ​ۚ لَا يَسۡـــَٔلُوۡنَ النَّاسَ اِلۡحَــافًا ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ بِالَّيۡلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"اَلَّذِيۡنَ يَاۡكُلُوۡنَ الرِّبٰوا لَا يَقُوۡمُوۡنَ اِلَّا كَمَا يَقُوۡمُ الَّذِىۡ يَتَخَبَّطُهُ الشَّيۡطٰنُ مِنَ الۡمَسِّ​ؕ ذٰ لِكَ بِاَنَّهُمۡ قَالُوۡۤا اِنَّمَا الۡبَيۡعُ مِثۡلُ الرِّبٰوا​ ۘ​ وَاَحَلَّ اللّٰهُ الۡبَيۡعَ وَحَرَّمَ الرِّبٰوا​ ؕ فَمَنۡ جَآءَهٗ مَوۡعِظَةٌ مِّنۡ رَّبِّهٖ فَانۡتَهٰى فَلَهٗ مَا سَلَفَؕ وَاَمۡرُهٗۤ اِلَى اللّٰهِ​ؕ وَمَنۡ عَادَ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يَمۡحَقُ اللّٰهُ الرِّبٰوا وَيُرۡبِى الصَّدَقٰتِ​ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيۡمٍ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوۡا مَا بَقِىَ مِنَ الرِّبٰٓوا اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا فَاۡذَنُوۡا بِحَرۡبٍ مِّنَ اللّٰهِ وَرَسُوۡلِهٖ​ۚ وَاِنۡ تُبۡتُمۡ فَلَـكُمۡ رُءُوۡسُ اَمۡوَالِكُمۡ​ۚ لَا تَظۡلِمُوۡنَ وَلَا تُظۡلَمُوۡنَ"},{"ar":"وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ ​ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ​ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا تُرۡجَعُوۡنَ فِيۡهِ اِلَى اللّٰهِ ثُمَّ تُوَفّٰى كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا تَدَايَنۡتُمۡ بِدَيۡنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكۡتُبُوۡهُ ​ؕ وَلۡيَكۡتُب بَّيۡنَكُمۡ كَاتِبٌۢ بِالۡعَدۡلِ​ وَلَا يَاۡبَ كَاتِبٌ اَنۡ يَّكۡتُبَ كَمَا عَلَّمَهُ اللّٰهُ​ فَلۡيَكۡتُبۡ ​ۚوَلۡيُمۡلِلِ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبۡخَسۡ مِنۡهُ شَيۡـــًٔا ​ؕ فَاِنۡ كَانَ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ سَفِيۡهًا اَوۡ ضَعِيۡفًا اَوۡ لَا يَسۡتَطِيۡعُ اَنۡ يُّمِلَّ هُوَ فَلۡيُمۡلِلۡ وَلِيُّهٗ بِالۡعَدۡلِ​ؕ وَاسۡتَشۡهِدُوۡا شَهِيۡدَيۡنِ مِنۡ رِّجَالِكُمۡ​ۚ فَاِنۡ لَّمۡ يَكُوۡنَا رَجُلَيۡنِ فَرَجُلٌ وَّامۡرَاَتٰنِ مِمَّنۡ تَرۡضَوۡنَ مِنَ الشُّهَدَآءِ اَنۡ تَضِلَّ اِحۡدٰٮهُمَا فَتُذَكِّرَ اِحۡدٰٮهُمَا الۡاُخۡرٰى​ؕ وَ لَا يَاۡبَ الشُّهَدَآءُ اِذَا مَا دُعُوۡا ​ؕ وَلَا تَسۡـــَٔمُوۡۤا اَنۡ تَكۡتُبُوۡهُ صَغِيۡرًا اَوۡ كَبِيۡرًا اِلٰٓى اَجَلِهٖ​ؕ ذٰ لِكُمۡ اَقۡسَطُ عِنۡدَ اللّٰهِ وَاَقۡوَمُ لِلشَّهَادَةِ وَاَدۡنٰۤى اَلَّا تَرۡتَابُوۡٓا اِلَّاۤ اَنۡ تَكُوۡنَ تِجَارَةً حَاضِرَةً تُدِيۡرُوۡنَهَا بَيۡنَكُمۡ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ اَلَّا تَكۡتُبُوۡهَا ​ؕ وَاَشۡهِدُوۡۤا اِذَا تَبَايَعۡتُمۡ وَلَا يُضَآرَّ كَاتِبٌ وَّلَا شَهِيۡدٌ  ؕ وَاِنۡ تَفۡعَلُوۡا فَاِنَّهٗ فُسُوۡقٌ ۢ بِكُمۡ ؕ وَ اتَّقُوا اللّٰهَ​ ؕ وَيُعَلِّمُكُمُ اللّٰهُ​ ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِنۡ كُنۡتُمۡ عَلٰى سَفَرٍ وَّلَمۡ تَجِدُوۡا كَاتِبًا فَرِهٰنٌ مَّقۡبُوۡضَةٌ ​ ؕ فَاِنۡ اَمِنَ بَعۡضُكُمۡ بَعۡضًا فَلۡيُؤَدِّ الَّذِى اؤۡتُمِنَ اَمَانَـتَهٗ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ​ؕ وَلَا تَكۡتُمُوا الشَّهَادَةَ ​ ؕ وَمَنۡ يَّكۡتُمۡهَا فَاِنَّهٗۤ اٰثِمٌ قَلۡبُهٗ​ؕ وَ اللّٰهُ بِمَا تَعۡمَلُوۡنَ عَلِيۡمٌ"},{"ar":"لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ وَاِنۡ تُبۡدُوۡا مَا فِىۡۤ اَنۡفُسِكُمۡ اَوۡ تُخۡفُوۡهُ يُحَاسِبۡكُمۡ بِهِ اللّٰهُ​ؕ فَيَـغۡفِرُ لِمَنۡ يَّشَآءُ وَيُعَذِّبُ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ​ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓٮِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ​ وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا​ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ"},{"ar":"لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ​ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ​ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ​ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ​​ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ​ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ"}]}};
const DEFAULT_QURAN_UTHMANI = {"baqarah":{"id":"baqarah","surahNum":2,"nameAr":"سُورَةُ ٱلْبَقَرَةِ","nameTa":"அல்-பகரா","nameEn":"Al-Baqarah","ayat":[{"ar":"الٓمّٓۚ"},{"ar":"ذٰلِكَ الۡڪِتٰبُ لَا رَيۡبَۛۚۖ فِيۡهِۛۚ هُدًى لِّلۡمُتَّقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يُؤۡمِنُوۡنَ بِالۡغَيۡبِ وَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَۙ"},{"ar":"وَالَّذِيۡنَ يُؤۡمِنُوۡنَ بِمَۤا اُنۡزِلَ اِلَيۡكَ وَمَاۤ اُنۡزِلَ مِنۡ قَبۡلِكَۚ وَبِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلٰى هُدًى مِّنۡ رَّبِّهِمۡ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا سَوَآءٌ عَلَيۡهِمۡ ءَاَنۡذَرۡتَهُمۡ اَمۡ لَمۡ تُنۡذِرۡهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"خَتَمَ اللّٰهُ عَلَىٰ قُلُوۡبِهِمۡ وَعَلٰى سَمۡعِهِمۡ​ؕ وَعَلٰىٓ اَبۡصَارِهِمۡ غِشَاوَةٌ  وَّلَهُمۡ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ اٰمَنَّا بِاللّٰهِ وَبِالۡيَوۡمِ الۡاٰخِرِ وَمَا هُمۡ بِمُؤۡمِنِيۡنَ​ۘ"},{"ar":"يُخٰدِعُوۡنَ اللّٰهَ وَالَّذِيۡنَ اٰمَنُوۡا ​ۚ وَمَا يَخۡدَعُوۡنَ اِلَّاۤ اَنۡفُسَهُمۡ وَمَا يَشۡعُرُوۡنَؕ"},{"ar":"فِىۡ قُلُوۡبِهِمۡ مَّرَضٌۙ فَزَادَهُمُ اللّٰهُ مَرَضًا ​ۚ وَّلَهُمۡ عَذَابٌ اَلِيۡمٌۙۢبِمَا كَانُوۡا يَكۡذِبُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ لَا تُفۡسِدُوۡا فِىۡ الۡاَرۡضِۙ قَالُوۡاۤ اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ"},{"ar":"اَلَا ۤ اِنَّهُمۡ هُمُ الۡمُفۡسِدُوۡنَ وَلٰـكِنۡ لَّا يَشۡعُرُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا كَمَاۤ اٰمَنَ النَّاسُ قَالُوۡاۤ اَنُؤۡمِنُ كَمَاۤ اٰمَنَ السُّفَهَآءُ​ ؕ اَلَاۤ اِنَّهُمۡ هُمُ السُّفَهَآءُ وَلٰـكِنۡ لَّا يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡاۤ اٰمَنَّا ۖۚ وَاِذَا خَلَوۡا اِلٰى شَيٰطِيۡنِهِمۡۙ قَالُوۡاۤ اِنَّا مَعَكُمۡۙ اِنَّمَا نَحۡنُ مُسۡتَهۡزِءُوۡنَ"},{"ar":"اَللّٰهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِىۡ طُغۡيَانِهِمۡ يَعۡمَهُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى فَمَا رَبِحَتۡ تِّجَارَتُهُمۡ وَمَا كَانُوۡا مُهۡتَدِيۡنَ"},{"ar":"مَثَلُهُمۡ كَمَثَلِ الَّذِى اسۡتَوۡقَدَ نَارًا ​ۚ فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَهٗ ذَهَبَ اللّٰهُ بِنُوۡرِهِمۡ وَتَرَكَهُمۡ فِىۡ ظُلُمٰتٍ لَّا يُبۡصِرُوۡنَ"},{"ar":"صُمٌّۢ بُكۡمٌ عُمۡىٌ فَهُمۡ لَا يَرۡجِعُوۡنَ ۙ"},{"ar":"اَوۡ كَصَيِّبٍ مِّنَ السَّمَآءِ فِيۡهِ ظُلُمٰتٌ وَّرَعۡدٌ وَّبَرۡقٌ​ ۚ يَجۡعَلُوۡنَ اَصَابِعَهُمۡ فِىۡۤ اٰذَانِهِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ​ؕ وَاللّٰهُ مُحِيۡطٌ​ۢ بِالۡكٰفِرِيۡنَ"},{"ar":"يَكَادُ الۡبَرۡقُ يَخۡطَفُ اَبۡصَارَهُمۡ​ؕ كُلَّمَاۤ اَضَآءَ لَهُمۡ مَّشَوۡا فِيۡهِۙ وَاِذَاۤ اَظۡلَمَ عَلَيۡهِمۡ قَامُوۡا​ؕ وَلَوۡ شَآءَ اللّٰهُ لَذَهَبَ بِسَمۡعِهِمۡ وَاَبۡصَارِهِمۡ​ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"يٰۤاَيُّهَا النَّاسُ اعۡبُدُوۡا رَبَّكُمُ الَّذِىۡ خَلَقَكُمۡ وَالَّذِيۡنَ مِنۡ قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَ ۙ"},{"ar":"الَّذِىۡ جَعَلَ لَـكُمُ الۡاَرۡضَ فِرَاشًا وَّالسَّمَآءَ بِنَآءً وَّاَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَخۡرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّـكُمۡ​ۚ فَلَا تَجۡعَلُوۡا لِلّٰهِ اَنۡدَادًا وَّاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاِنۡ کُنۡتُمۡ فِىۡ رَيۡبٍ مِّمَّا نَزَّلۡنَا عَلٰى عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَةٍ مِّنۡ مِّثۡلِهٖ وَادۡعُوۡا شُهَدَآءَكُمۡ مِّنۡ دُوۡنِ اللّٰهِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَلَنۡ تَفۡعَلُوۡا فَاتَّقُوۡا النَّارَ الَّتِىۡ وَقُوۡدُهَا النَّاسُ وَالۡحِجَارَةُ  ۖۚ اُعِدَّتۡ لِلۡكٰفِرِيۡنَ"},{"ar":"وَبَشِّرِ الَّذِيۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ​ؕ ڪُلَّمَا رُزِقُوۡا مِنۡهَا مِنۡ ثَمَرَةٍ رِّزۡقًا ​ۙ قَالُوۡا هٰذَا الَّذِىۡ رُزِقۡنَا مِنۡ قَبۡلُ وَاُتُوۡا بِهٖ مُتَشَابِهًا ​ؕ وَلَهُمۡ فِيۡهَآ اَزۡوَاجٌ مُّطَهَّرَةٌ ​ۙ وَّهُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ اللّٰهَ لَا يَسۡتَحۡـىٖۤ اَنۡ يَّضۡرِبَ مَثَلًا مَّا ​بَعُوۡضَةً فَمَا فَوۡقَهَا ​ؕ فَاَمَّا ​الَّذِيۡنَ اٰمَنُوۡا فَيَعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ۚ وَاَمَّا الَّذِيۡنَ ڪَفَرُوۡا فَيَقُوۡلُوۡنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ۘ يُضِلُّ بِهٖ ڪَثِيۡرًا وَّيَهۡدِىۡ بِهٖ كَثِيۡرًا ​ؕ وَمَا يُضِلُّ بِهٖۤ اِلَّا الۡفٰسِقِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَنۡقُضُوۡنَ عَهۡدَ اللّٰهِ مِنۡۢ بَعۡدِ مِيۡثَاقِهٖ وَيَقۡطَعُوۡنَ مَآ اَمَرَ اللّٰهُ بِهٖۤ اَنۡ يُّوۡصَلَ وَيُفۡسِدُوۡنَ فِى الۡاَرۡضِ​ؕ اُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"كَيۡفَ تَكۡفُرُوۡنَ بِاللّٰهِ وَڪُنۡتُمۡ اَمۡوَاتًا فَاَحۡيَاکُمۡ​ۚ ثُمَّ يُمِيۡتُكُمۡ ثُمَّ يُحۡيِيۡكُمۡ ثُمَّ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"هُوَ الَّذِىۡ خَلَقَ لَـكُمۡ مَّا فِى الۡاَرۡضِ جَمِيۡعًا ثُمَّ اسۡتَوٰۤى اِلَى السَّمَآءِ فَسَوّٰٮهُنَّ سَبۡعَ سَمٰوٰتٍ​ؕ وَهُوَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذۡ قَالَ رَبُّكَ لِلۡمَلٰٓٮِٕكَةِ اِنِّىۡ جَاعِلٌ فِى الۡاَرۡضِ خَلِيۡفَةً ؕ قَالُوۡٓا اَتَجۡعَلُ فِيۡهَا مَنۡ يُّفۡسِدُ فِيۡهَا وَيَسۡفِكُ الدِّمَآءَۚ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَـكَ​ؕ قَالَ اِنِّىۡٓ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَعَلَّمَ اٰدَمَ الۡاَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى الۡمَلٰٓٮِٕكَةِ فَقَالَ اَنۡۢبِــُٔوۡنِىۡ بِاَسۡمَآءِ هٰٓؤُلَآءِ اِنۡ كُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"قَالُوۡا سُبۡحٰنَكَ لَا عِلۡمَ لَنَآ اِلَّا مَا عَلَّمۡتَنَا ؕ اِنَّكَ اَنۡتَ الۡعَلِيۡمُ الۡحَكِيۡمُ"},{"ar":"قَالَ يٰٓـاٰدَمُ اَنۡۢبِئۡهُمۡ بِاَسۡمَآٮِٕهِمۡ​ۚ فَلَمَّآ اَنۡۢبَاَهُمۡ بِاَسۡمَآٮِٕهِمۡۙ قَالَ اَلَمۡ اَقُل لَّـكُمۡ اِنِّىۡٓ اَعۡلَمُ غَيۡبَ السَّمٰوٰتِ وَالۡاَرۡضِۙ وَاَعۡلَمُ مَا تُبۡدُوۡنَ وَمَا كُنۡتُمۡ تَكۡتُمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا لِلۡمَلٰٓٮِٕكَةِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡٓا اِلَّاۤ اِبۡلِيۡسَؕ اَبٰى وَاسۡتَكۡبَرَ  وَكَانَ مِنَ الۡكٰفِرِيۡنَ"},{"ar":"وَقُلۡنَا يٰٓـاٰدَمُ اسۡكُنۡ اَنۡتَ وَزَوۡجُكَ الۡجَـنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوۡنَا مِنَ الظّٰلِمِيۡنَ"},{"ar":"فَاَزَلَّهُمَا الشَّيۡطٰنُ عَنۡهَا فَاَخۡرَجَهُمَا مِمَّا كَانَا فِيۡهِ​ وَقُلۡنَا اهۡبِطُوۡا بَعۡضُكُمۡ لِبَعۡضٍ عَدُوٌّ ۚ وَلَـكُمۡ فِى الۡاَرۡضِ مُسۡتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيۡنٍ"},{"ar":"فَتَلَقّٰٓى اٰدَمُ مِنۡ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيۡهِ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"قُلۡنَا اهۡبِطُوۡا مِنۡهَا جَمِيۡعًا ​​ۚ فَاِمَّا يَاۡتِيَنَّكُمۡ مِّنِّىۡ هُدًى فَمَنۡ تَبِعَ هُدَاىَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَالَّذِيۡنَ كَفَرُوۡا وَكَذَّبُوۡا بِـاٰيٰتِنَآ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَوۡفُوۡا بِعَهۡدِىۡٓ اُوۡفِ بِعَهۡدِكُمۡۚ وَاِيَّاىَ فَارۡهَبُوۡنِ"},{"ar":"وَاٰمِنُوۡا بِمَآ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَكُمۡ وَلَا تَكُوۡنُوۡآ اَوَّلَ كَافِرٍۢ بِهٖ​ وَلَا تَشۡتَرُوۡا بِاٰيٰتِىۡ ثَمَنًا قَلِيۡلًا وَّاِيَّاىَ فَاتَّقُوۡنِ"},{"ar":"وَلَا تَلۡبِسُوا الۡحَـقَّ بِالۡبَاطِلِ وَتَكۡتُمُوا الۡحَـقَّ وَاَنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارۡكَعُوۡا مَعَ الرّٰكِعِيۡنَ"},{"ar":"اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَتَنۡسَوۡنَ اَنۡفُسَكُمۡ وَاَنۡتُمۡ تَتۡلُوۡنَ الۡكِتٰبَ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"وَاسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ​ؕ وَاِنَّهَا لَكَبِيۡرَةٌ اِلَّا عَلَى الۡخٰشِعِيۡنَۙ"},{"ar":"الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوۡا رَبِّهِمۡ وَاَنَّهُمۡ اِلَيۡهِ رٰجِعُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا شَفَاعَةٌ وَّلَا يُؤۡخَذُ مِنۡهَا عَدۡلٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذۡ نَجَّيۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ يَسُوۡمُوۡنَكُمۡ سُوۡٓءَ الۡعَذَابِ يُذَبِّحُوۡنَ اَبۡنَآءَكُمۡ وَيَسۡتَحۡيُوۡنَ نِسَآءَكُمۡ​ؕ وَفِىۡ ذٰلِكُمۡ بَلَاۤءٌ مِّنۡ رَّبِّكُمۡ عَظِيۡمٌ"},{"ar":"وَاِذۡ فَرَقۡنَا بِكُمُ الۡبَحۡرَ فَاَنۡجَيۡنٰکُمۡ وَاَغۡرَقۡنَآ اٰلَ فِرۡعَوۡنَ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"وَاِذۡ وٰعَدۡنَا مُوۡسٰٓى اَرۡبَعِيۡنَ لَيۡلَةً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"ثُمَّ عَفَوۡنَا عَنۡكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ لَعَلَّكُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَالۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُوۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖ يٰقَوۡمِ اِنَّكُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِكُمُ الۡعِجۡلَ فَتُوۡبُوۡآ اِلٰى بَارِٮِٕكُمۡ فَاقۡتُلُوۡٓا اَنۡفُسَكُمۡؕ ذٰ لِكُمۡ خَيۡرٌ لَّـكُمۡ عِنۡدَ بَارِٮِٕكُمۡؕ فَتَابَ عَلَيۡكُمۡ​ؕ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نُّؤۡمِنَ لَـكَ حَتّٰى نَرَى اللّٰهَ جَهۡرَةً فَاَخَذَتۡكُمُ الصّٰعِقَةُ وَاَنۡتُمۡ تَنۡظُرُوۡنَ"},{"ar":"ثُمَّ بَعَثۡنٰكُمۡ مِّنۡۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَظَلَّلۡنَا عَلَيۡکُمُ الۡغَمَامَ وَاَنۡزَلۡنَا عَلَيۡكُمُ الۡمَنَّ وَالسَّلۡوٰى​ؕ كُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ​ؕ وَمَا ظَلَمُوۡنَا وَلٰـكِنۡ كَانُوۡآ اَنۡفُسَهُمۡ يَظۡلِمُوۡنَ"},{"ar":"وَاِذۡ قُلۡنَا ادۡخُلُوۡا هٰذِهِ الۡقَرۡيَةَ فَکُلُوۡا مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدًا وَّادۡخُلُوا الۡبَابَ سُجَّدًا وَّقُوۡلُوۡا حِطَّةٌ نَّغۡفِرۡ لَـكُمۡ خَطٰيٰكُمۡ​ؕ وَسَنَزِيۡدُ الۡمُحۡسِنِيۡنَ"},{"ar":"فَبَدَّلَ الَّذِيۡنَ ظَلَمُوۡا قَوۡلاً غَيۡرَ الَّذِىۡ قِيۡلَ لَهُمۡ فَاَنۡزَلۡنَا عَلَى الَّذِيۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا كَانُوۡا يَفۡسُقُوۡنَ"},{"ar":"وَاِذِ اسۡتَسۡقَىٰ مُوۡسٰى لِقَوۡمِهٖ فَقُلۡنَا اضۡرِب بِّعَصَاكَ الۡحَجَرَ​ؕ فَانۡفَجَرَتۡ مِنۡهُ اثۡنَتَا عَشۡرَةَ عَيۡنًا​ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَهُمۡ​ؕ کُلُوۡا وَاشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰهِ وَلَا تَعۡثَوۡا فِىۡ الۡاَرۡضِ مُفۡسِدِيۡنَ"},{"ar":"وَاِذۡ قُلۡتُمۡ يٰمُوۡسٰى لَنۡ نَّصۡبِرَ عَلٰى طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِهَا وَقِثَّـآٮِٕهَا وَفُوۡمِهَا وَعَدَسِهَا وَ بَصَلِهَا​ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِىۡ هُوَ اَدۡنٰى بِالَّذِىۡ هُوَ خَيۡرٌ​ؕ اِهۡبِطُوۡا مِصۡرًا فَاِنَّ لَـکُمۡ مَّا سَاَلۡتُمۡ​ؕ وَضُرِبَتۡ عَلَيۡهِمُ الذِّلَّةُ وَالۡمَسۡکَنَةُ وَبَآءُوۡ بِغَضَبٍ مِّنَ اللّٰهِ​ؕ ذٰلِكَ بِاَنَّهُمۡ كَانُوۡا يَكۡفُرُوۡنَ بِاٰيٰتِ اللّٰهِ وَيَقۡتُلُوۡنَ النَّبِيّٖنَ بِغَيۡرِ الۡحَـقِّ​ؕ ذٰلِكَ بِمَا عَصَوا وَّڪَانُوۡا يَعۡتَدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَادُوۡا وَالنَّصٰرٰى وَالصّٰبِـِٕـيۡنَ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَعَمِلَ صَالِحًـا فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ الطُّوۡرَؕ خُذُوۡا مَآ اٰتَيۡنٰكُمۡ بِقُوَّةٍ وَّ اذۡكُرُوۡا مَا فِيۡهِ لَعَلَّكُمۡ تَتَّقُوۡنَ"},{"ar":"ثُمَّ تَوَلَّيۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ​​ۚ فَلَوۡلَا فَضۡلُ اللّٰهِ عَلَيۡكُمۡ وَرَحۡمَتُهٗ لَـكُنۡتُمۡ مِّنَ الۡخٰسِرِيۡنَ"},{"ar":"وَلَقَدۡ عَلِمۡتُمُ الَّذِيۡنَ اعۡتَدَوۡا مِنۡكُمۡ فِىۡ السَّبۡتِ فَقُلۡنَا لَهُمۡ كُوۡنُوۡا قِرَدَةً خَاسِـِٔـيۡنَ ​ۚ"},{"ar":"فَجَعَلۡنٰهَا نَكٰلاً لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةً لِّلۡمُتَّقِيۡنَ"},{"ar":"وَاِذۡ قَالَ مُوۡسٰى لِقَوۡمِهٖۤ اِنَّ اللّٰهَ يَاۡمُرُكُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَةً ​ ؕ قَالُوۡآ اَتَتَّخِذُنَا هُزُوًۡا ​ؕ قَالَ اَعُوۡذُ بِاللّٰهِ اَنۡ اَكُوۡنَ مِنَ الۡجٰـهِلِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكۡرٌؕ عَوَانٌۢ بَيۡنَ ذٰلِكَ​ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا لَوۡنُهَا ​ؕ قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ صَفۡرَآءُۙ فَاقِعٌ لَّوۡنُهَا تَسُرُّ النّٰظِرِيۡنَ"},{"ar":"قَالُوا ادۡعُ لَنَا رَبَّكَ يُبَيِّنۡ لَّنَا مَا هِىَۙ اِنَّ الۡبَقَرَ تَشٰبَهَ عَلَيۡنَا ؕ وَاِنَّـآ اِنۡ شَآءَ اللّٰهُ لَمُهۡتَدُوۡنَ"},{"ar":"قَالَ اِنَّهٗ يَقُوۡلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوۡلٌ تُثِيۡرُ الۡاَرۡضَ وَلَا تَسۡقِى الۡحَـرۡثَ ​ۚ مُسَلَّمَةٌ لَّا شِيَةَ فِيۡهَا ​ؕ قَالُوا الۡـٰٔـنَ جِئۡتَ بِالۡحَـقِّ​ؕ فَذَبَحُوۡهَا وَمَا كَادُوۡا يَفۡعَلُوۡنَ"},{"ar":"وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِيۡهَا ​ؕ وَاللّٰهُ مُخۡرِجٌ مَّا كُنۡتُمۡ تَكۡتُمُوۡنَۚ"},{"ar":"فَقُلۡنَا اضۡرِبُوۡهُ بِبَعۡضِهَا ​ؕ كَذٰلِكَ يُحۡىِ اللّٰهُ الۡمَوۡتٰى ۙ وَيُرِيۡکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"ثُمَّ قَسَتۡ قُلُوۡبُكُمۡ مِّنۡۢ بَعۡدِ ذٰلِكَ فَهِىَ كَالۡحِجَارَةِ اَوۡ اَشَدُّ قَسۡوَةً ​ ؕ وَاِنَّ مِنَ الۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ الۡاَنۡهٰرُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ الۡمَآءُ​ؕ وَاِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اَفَتَطۡمَعُوۡنَ اَنۡ يُّؤۡمِنُوۡا لَـكُمۡ وَقَدۡ كَانَ فَرِيۡقٌ مِّنۡهُمۡ يَسۡمَعُوۡنَ کَلَامَ اللّٰهِ ثُمَّ يُحَرِّفُوۡنَهٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡهُ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"وَاِذَا لَـقُوۡا الَّذِيۡنَ اٰمَنُوۡا قَالُوۡآ اٰمَنَّا  ۖۚ وَاِذَا خَلَا بَعۡضُهُمۡ اِلٰى بَعۡضٍ قَالُوۡآ اَ تُحَدِّثُوۡنَهُمۡ بِمَا فَتَحَ اللّٰهُ عَلَيۡكُمۡ لِيُحَآجُّوۡكُمۡ بِهٖ عِنۡدَ رَبِّكُمۡ​ؕ اَفَلَا تَعۡقِلُوۡنَ"},{"ar":"اَوَلَا يَعۡلَمُوۡنَ اَنَّ اللّٰهَ يَعۡلَمُ مَا يُسِرُّوۡنَ وَمَا يُعۡلِنُوۡنَ"},{"ar":"وَ مِنۡهُمۡ اُمِّيُّوۡنَ لَا يَعۡلَمُوۡنَ الۡكِتٰبَ اِلَّاۤ اَمَانِىَّ وَاِنۡ هُمۡ اِلَّا يَظُنُّوۡنَ"},{"ar":"فَوَيۡلٌ لِّلَّذِيۡنَ يَكۡتُبُوۡنَ الۡكِتٰبَ بِاَيۡدِيۡهِمۡ ثُمَّ يَقُوۡلُوۡنَ هٰذَا مِنۡ عِنۡدِ اللّٰهِ لِيَشۡتَرُوۡا بِهٖ ثَمَنًا قَلِيۡلًا ؕ فَوَيۡلٌ لَّهُمۡ مِّمَّا کَتَبَتۡ اَيۡدِيۡهِمۡ وَوَيۡلٌ لَّهُمۡ مِّمَّا يَكۡسِبُوۡنَ"},{"ar":"وَقَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعۡدُوۡدَةً ​ ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰهِ عَهۡدًا فَلَنۡ يُّخۡلِفَ اللّٰهُ عَهۡدَهٗۤ​ اَمۡ تَقُوۡلُوۡنَ عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"بَلٰى مَنۡ كَسَبَ سَيِّئَةً وَّاَحَاطَتۡ بِهٖ خَطِيْۤـــَٔتُهٗ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَالَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ اُولٰٓٮِٕكَ اَصۡحٰبُ الۡجَـنَّةِ ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَ بَنِىۡٓ اِسۡرَآءِيۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰهَ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا وَّذِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰکِيۡنِ وَقُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ ؕ ثُمَّ تَوَلَّيۡتُمۡ اِلَّا قَلِيۡلًا مِّنۡکُمۡ وَاَنۡـتُمۡ مُّعۡرِضُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ لَا تَسۡفِكُوۡنَ دِمَآءَكُمۡ وَلَا تُخۡرِجُوۡنَ اَنۡفُسَكُمۡ مِّنۡ دِيَارِكُمۡ ثُمَّ اَقۡرَرۡتُمۡ وَاَنۡـتُمۡ تَشۡهَدُوۡنَ"},{"ar":"ثُمَّ اَنۡـتُمۡ هٰٓؤُلَاۤءِ تَقۡتُلُوۡنَ اَنۡفُسَكُمۡ وَتُخۡرِجُوۡنَ فَرِيۡقًا مِّنۡكُمۡ مِّنۡ دِيَارِهِمۡ تَظٰهَرُوۡنَ عَلَيۡهِمۡ بِالۡاِثۡمِ وَالۡعُدۡوَانِؕ وَاِنۡ يَّاۡتُوۡكُمۡ اُسٰرٰى تُفٰدُوۡهُمۡ وَهُوَ مُحَرَّمٌ عَلَيۡڪُمۡ اِخۡرَاجُهُمۡ​​ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡكِتٰبِ وَتَكۡفُرُوۡنَ بِبَعۡضٍ​ۚ فَمَا جَزَآءُ مَنۡ يَّفۡعَلُ ذٰلِكَ مِنۡکُمۡ اِلَّا خِزۡىٌ فِى الۡحَيٰوةِ الدُّنۡيَا ​ۚ وَيَوۡمَ الۡقِيٰمَةِ يُرَدُّوۡنَ اِلٰٓى اَشَدِّ الۡعَذَابِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الۡحَيٰوةَ الدُّنۡيَا بِالۡاٰخِرَةِ​ فَلَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَ لَقَدۡ اٰتَيۡنَا مُوۡسَى الۡكِتٰبَ وَقَفَّيۡنَا مِنۡۢ بَعۡدِهٖ بِالرُّسُلِ​ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ اَفَكُلَّمَا جَآءَكُمۡ رَسُوۡلٌۢ بِمَا لَا تَهۡوٰٓى اَنۡفُسُكُمُ اسۡتَكۡبَرۡتُمۡ​ۚ فَفَرِيۡقًا كَذَّبۡتُمۡ وَفَرِيۡقًا تَقۡتُلُوۡنَ"},{"ar":"وَقَالُوۡا قُلُوۡبُنَا غُلۡفٌ​ؕ بَل لَّعَنَهُمُ اللّٰهُ بِكُفۡرِهِمۡ فَقَلِيۡلًا مَّا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ كِتٰبٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡۙ وَكَانُوۡا مِنۡ قَبۡلُ يَسۡتَفۡتِحُوۡنَ عَلَى الَّذِيۡنَ كَفَرُوۡا  ​ۖۚ فَلَمَّا جَآءَهُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِهٖ​ فَلَعۡنَةُ اللّٰهِ عَلَى الۡكٰفِرِيۡنَ"},{"ar":"بِئۡسَمَا اشۡتَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ اَنۡ يَّڪۡفُرُوۡا بِمَآ اَنۡزَلَ اللّٰهُ بَغۡيًا اَنۡ يُّنَزِّلَ اللّٰهُ مِنۡ فَضۡلِهٖ عَلٰى مَنۡ يَّشَآءُ مِنۡ عِبَادِهٖ​ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰى غَضَبٍ​ؕ وَلِلۡكٰفِرِيۡنَ عَذَابٌ مُّهِيۡنٌ"},{"ar":"وَاِذَا قِيۡلَ لَهُمۡ اٰمِنُوۡا بِمَآ اَنۡزَلَ اللّٰهُ قَالُوۡا نُؤۡمِنُ بِمَآ اُنۡزِلَ عَلَيۡنَا وَيَكۡفُرُوۡنَ بِمَا وَرَآءَهٗ وَهُوَ الۡحَـقُّ مُصَدِّقًا لِّمَا مَعَهُمۡ​ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡـــۢبِيَآءَ اللّٰهِ مِنۡ قَبۡلُ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"وَلَقَدۡ جَآءَکُمۡ مُّوۡسٰى بِالۡبَيِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِهٖ وَاَنۡـتُمۡ ظٰلِمُوۡنَ"},{"ar":"وَاِذۡ اَخَذۡنَا مِيۡثَاقَكُمۡ وَرَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَآ اٰتَيۡنٰکُمۡ بِقُوَّةٍ وَّاسۡمَعُوۡا ​ ؕ قَالُوۡا سَمِعۡنَا وَعَصَيۡنَا  وَاُشۡرِبُوۡا فِىۡ قُلُوۡبِهِمُ الۡعِجۡلَ بِکُفۡرِهِمۡ ​ؕ قُلۡ بِئۡسَمَا يَاۡمُرُکُمۡ بِهٖۤ اِيۡمَانُكُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"قُلۡ اِنۡ كَانَتۡ لَـکُمُ الدَّارُ الۡاٰخِرَةُ عِنۡدَ اللّٰهِ خَالِصَةً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"وَ لَنۡ يَّتَمَنَّوۡهُ اَبَدًاۢ بِمَا قَدَّمَتۡ اَيۡدِيۡهِمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَلَتَجِدَنَّهُمۡ اَحۡرَصَ النَّاسِ عَلٰى حَيٰوةٍ  ۛۚ وَ مِنَ الَّذِيۡنَ اَشۡرَكُوۡا​​  ۛۚ يَوَدُّ اَحَدُهُمۡ لَوۡ يُعَمَّرُ اَ لۡفَ سَنَةٍ ۚ وَمَا هُوَ بِمُزَحۡزِحِهٖ مِنَ الۡعَذَابِ اَنۡ يُّعَمَّرَ​ؕ وَاللّٰهُ بَصِيۡرٌۢ بِمَا يَعۡمَلُوۡنَ "},{"ar":"قُلۡ مَنۡ كَانَ عَدُوًّا لِّجِبۡرِيۡلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلۡبِكَ بِاِذۡنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدًى وَّبُشۡرٰى لِلۡمُؤۡمِنِيۡنَ"},{"ar":"مَنۡ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰٓٮِٕکَتِهٖ وَ رُسُلِهٖ وَجِبۡرِيۡلَ وَمِيۡكٰٮلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلۡكٰفِرِيۡنَ"},{"ar":"وَلَقَدۡ اَنۡزَلۡنَآ اِلَيۡكَ اٰيٰتٍۢ بَيِّنٰتٍ​​ۚ وَمَا يَكۡفُرُ بِهَآ اِلَّا الۡفٰسِقُوۡنَ"},{"ar":"اَوَکُلَّمَا عٰهَدُوۡا عَهۡدًا نَّبَذَهٗ فَرِيۡقٌ مِّنۡهُمۡ​ؕ بَلۡ اَكۡثَرُهُمۡ لَا يُؤۡمِنُوۡنَ"},{"ar":"وَلَمَّا جَآءَهُمۡ رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمۡ نَبَذَ فَرِيۡقٌ مِّنَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَۙ کِتٰبَ اللّٰهِ وَرَآءَ ظُهُوۡرِهِمۡ كَاَنَّهُمۡ لَا يَعۡلَمُوۡنَ"},{"ar":"وَاتَّبَعُوۡا مَا تَتۡلُوا الشَّيٰطِيۡنُ عَلٰى مُلۡكِ سُلَيۡمٰنَ​​ۚ وَمَا کَفَرَ سُلَيۡمٰنُ وَلٰـكِنَّ الشَّيٰـطِيۡنَ كَفَرُوۡا يُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ وَمَآ اُنۡزِلَ عَلَى الۡمَلَـکَيۡنِ بِبَابِلَ هَارُوۡتَ وَمَارُوۡتَ​ؕ وَمَا يُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰى يَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَةٌ فَلَا تَكۡفُرۡؕ​ فَيَتَعَلَّمُوۡنَ مِنۡهُمَا مَا يُفَرِّقُوۡنَ بِهٖ بَيۡنَ الۡمَرۡءِ وَ زَوۡجِهٖ​ؕ وَمَا هُمۡ بِضَآرِّيۡنَ بِهٖ مِنۡ اَحَدٍ اِلَّا بِاِذۡنِ اللّٰهِ​ؕ وَيَتَعَلَّمُوۡنَ مَا يَضُرُّهُمۡ وَلَا يَنۡفَعُهُمۡ​ؕ وَلَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮهُ مَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ​ؕ وَلَبِئۡسَ مَا شَرَوۡا بِهٖۤ اَنۡفُسَهُمۡ​ؕ لَوۡ کَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"وَلَوۡ اَنَّهُمۡ اٰمَنُوۡا وَاتَّقَوۡا لَمَثُوۡبَةٌ مِّنۡ عِنۡدِ اللّٰهِ خَيۡرٌ ؕ​ لَوۡ كَانُوۡا يَعۡلَمُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوا انۡظُرۡنَا وَاسۡمَعُوۡا ​ؕ وَلِلۡڪٰفِرِيۡنَ عَذَابٌ اَلِيۡمٌ"},{"ar":"مَا يَوَدُّ الَّذِيۡنَ كَفَرُوۡا مِنۡ اَهۡلِ الۡكِتٰبِ وَلَا الۡمُشۡرِكِيۡنَ اَنۡ يُّنَزَّلَ عَلَيۡڪُمۡ مِّنۡ خَيۡرٍ مِّنۡ رَّبِّکُمۡ​ؕ وَاللّٰهُ يَخۡتَصُّ بِرَحۡمَتِهٖ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ ذُو الۡفَضۡلِ الۡعَظِيۡمِ"},{"ar":"مَا نَنۡسَخۡ مِنۡ اٰيَةٍ اَوۡ نُنۡسِهَا نَاۡتِ بِخَيۡرٍ مِّنۡهَآ اَوۡ مِثۡلِهَا ​ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰهَ لَهٗ مُلۡكُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَمَا لَـکُمۡ مِّنۡ دُوۡنِ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَمۡ تُرِيۡدُوۡنَ اَنۡ تَسۡـَٔـلُوۡا رَسُوۡلَـكُمۡ كَمَا سُٮِٕلَ مُوۡسٰى مِنۡ قَبۡلُ​ؕ وَمَنۡ يَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِيۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ"},{"ar":"وَدَّ کَثِيۡرٌ مِّنۡ اَهۡلِ الۡكِتٰبِ لَوۡ يَرُدُّوۡنَكُمۡ مِّنۡۢ بَعۡدِ اِيۡمَانِكُمۡ كُفَّارًا ۖۚ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِهِمۡ مِّنۡۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ الۡحَـقُّ​ ۚ فَاعۡفُوۡا وَاصۡفَحُوۡا حَتّٰى يَاۡتِىَ اللّٰهُ بِاَمۡرِهٖ ​ؕ اِنَّ اللّٰهَ عَلٰى کُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّکٰوةَ  ​ؕ وَمَا تُقَدِّمُوۡا لِاَنۡفُسِكُمۡ مِّنۡ خَيۡرٍ تَجِدُوۡهُ عِنۡدَ اللّٰهِ ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَقَالُوۡا لَنۡ يَّدۡخُلَ الۡجَـنَّةَ اِلَّا مَنۡ كَانَ هُوۡدًا اَوۡ نَصٰرٰى​ؕ تِلۡكَ اَمَانِيُّهُمۡ​ؕ قُلۡ هَاتُوۡا بُرۡهَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِيۡنَ"},{"ar":"بَلٰى مَنۡ اَسۡلَمَ وَجۡهَهٗ لِلّٰهِ وَهُوَ مُحۡسِنٌ فَلَهٗۤ اَجۡرُهٗ عِنۡدَ رَبِّهٖ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"وَقَالَتِ الۡيَهُوۡدُ لَـيۡسَتِ النَّصٰرٰى عَلٰى شَىۡءٍ وَّقَالَتِ النَّصٰرٰى لَـيۡسَتِ الۡيَهُوۡدُ عَلٰى شَىۡءٍۙ وَّهُمۡ يَتۡلُوۡنَ الۡكِتٰبَؕ كَذٰلِكَ قَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ مِثۡلَ قَوۡلِهِمۡ​ۚ فَاللّٰهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ الۡقِيٰمَةِ فِيۡمَا كَانُوۡا فِيۡهِ يَخۡتَلِفُوۡنَ"},{"ar":"وَمَنۡ اَظۡلَمُ مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰهِ اَنۡ يُّذۡكَرَ فِيۡهَا اسۡمُهٗ وَسَعٰـى فِىۡ خَرَابِهَا ​ؕ اُولٰٓٮِٕكَ مَا كَانَ لَهُمۡ اَنۡ يَّدۡخُلُوۡهَآ اِلَّا خَآٮِٕفِيۡنَ ؕ لَهُمۡ فِى الدُّنۡيَا خِزۡىٌ وَّلَهُمۡ فِى الۡاٰخِرَةِ عَذَابٌ عَظِيۡمٌ"},{"ar":"وَلِلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ​ فَاَيۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡهُ اللّٰهِ​ؕ اِنَّ اللّٰهَ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا ۙ​ سُبۡحٰنَهٗ ​ؕ بَل لَّهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ كُلٌّ لَّهٗ قَانِتُوۡنَ"},{"ar":"بَدِيۡعُ السَّمٰوٰتِ وَالۡاَرۡضِ​ؕ وَ اِذَا قَضٰٓى اَمۡرًا فَاِنَّمَا يَقُوۡلُ لَهٗ كُنۡ فَيَكُوۡنُ"},{"ar":"وَقَالَ الَّذِيۡنَ لَا يَعۡلَمُوۡنَ لَوۡلَا يُكَلِّمُنَا اللّٰهُ اَوۡ تَاۡتِيۡنَآ اٰيَةٌ ​ ؕ كَذٰلِكَ قَالَ الَّذِيۡنَ مِنۡ قَبۡلِهِمۡ مِّثۡلَ قَوۡلِهِمۡؕ​ تَشَابَهَتۡ قُلُوۡبُهُمۡ​ؕ قَدۡ بَيَّنَّا الۡاٰيٰتِ لِقَوۡمٍ يُّوۡقِنُوۡنَ"},{"ar":"اِنَّاۤ اَرۡسَلۡنٰكَ بِالۡحَـقِّ بَشِيۡرًا وَّنَذِيۡرًا ۙ​ وَّلَا تُسۡـَٔـلُ عَنۡ اَصۡحٰبِ الۡجَحِيۡمِ"},{"ar":"وَلَنۡ تَرۡضٰى عَنۡكَ الۡيَهُوۡدُ وَلَا النَّصٰرٰى حَتّٰى تَتَّبِعَ مِلَّتَهُمۡ​ؕ قُلۡ اِنَّ هُدَى اللّٰهِ هُوَ الۡهُدٰى​ؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ بَعۡدَ الَّذِىۡ جَآءَكَ مِنَ الۡعِلۡمِ​ۙ مَا لَـكَ مِنَ اللّٰهِ مِنۡ وَّلِىٍّ وَّلَا نَصِيۡرٍ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَتۡلُوۡنَهٗ حَقَّ تِلَاوَتِهٖؕ اُولٰٓٮِٕكَ يُؤۡمِنُوۡنَ بِهٖ​ ؕ وَمَنۡ يَّكۡفُرۡ بِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡخٰسِرُوۡنَ"},{"ar":"يٰبَنِىۡٓ اِسۡرَآءِيۡلَ اذۡكُرُوۡا نِعۡمَتِىَ الَّتِىۡٓ اَنۡعَمۡتُ عَلَيۡكُمۡ وَاَنِّىۡ فَضَّلۡتُكُمۡ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا لَّا تَجۡزِىۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَيۡـًٔـا وَّلَا يُقۡبَلُ مِنۡهَا عَدۡلٌ وَّلَا تَنۡفَعُهَا شَفَاعَةٌ وَّلَا هُمۡ يُنۡصَرُوۡنَ"},{"ar":"وَاِذِ ابۡتَلٰٓى اِبۡرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ ​ؕ قَالَ اِنِّىۡ جَاعِلُكَ لِلنَّاسِ اِمَامًا ​ؕ قَالَ وَمِنۡ ذُرِّيَّتِىۡ ​ؕ قَالَ لَا يَنَالُ عَهۡدِى الظّٰلِمِيۡنَ"},{"ar":"وَاِذۡ جَعَلۡنَا الۡبَيۡتَ مَثَابَةً لِّلنَّاسِ وَاَمۡنًا ؕ وَاتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰهٖمَ مُصَلًّى​ ؕ وَعَهِدۡنَآ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ اَنۡ طَهِّرَا بَيۡتِىَ لِلطَّآٮِٕفِيۡنَ وَالۡعٰكِفِيۡنَ وَالرُّکَّعِ السُّجُوۡدِ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اجۡعَلۡ هٰذَا بَلَدًا اٰمِنًا وَّارۡزُقۡ اَهۡلَهٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡهُمۡ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ قَالَ وَمَنۡ كَفَرَ فَاُمَتِّعُهٗ قَلِيۡلًا ثُمَّ اَضۡطَرُّهٗۤ اِلٰى عَذَابِ النَّارِ​ؕ وَبِئۡسَ الۡمَصِيۡرُ"},{"ar":"وَاِذۡ يَرۡفَعُ اِبۡرٰهٖمُ الۡقَوَاعِدَ مِنَ الۡبَيۡتِ وَاِسۡمٰعِيۡلُؕ رَبَّنَا تَقَبَّلۡ مِنَّا ​ؕ اِنَّكَ اَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ"},{"ar":"رَبَّنَا وَاجۡعَلۡنَا مُسۡلِمَيۡنِ لَـكَ وَ مِنۡ ذُرِّيَّتِنَآ اُمَّةً مُّسۡلِمَةً لَّكَ وَاَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَا ۚ اِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ"},{"ar":"رَبَّنَا وَابۡعَثۡ فِيۡهِمۡ رَسُوۡلًا مِّنۡهُمۡ يَتۡلُوۡا عَلَيۡهِمۡ اٰيٰتِكَ وَيُعَلِّمُهُمُ الۡكِتٰبَ وَالۡحِكۡمَةَ وَ يُزَكِّيۡهِمۡ​ؕ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ"},{"ar":"وَمَنۡ يَّرۡغَبُ عَنۡ مِّلَّةِ اِبۡرٰهٖمَ اِلَّا مَنۡ سَفِهَ نَفۡسَهٗ ​ؕ وَلَقَدِ اصۡطَفَيۡنٰهُ فِى الدُّنۡيَا ​ۚ وَاِنَّهٗ فِى الۡاٰخِرَةِ لَمِنَ الصّٰلِحِيۡنَ"},{"ar":"اِذۡ قَالَ لَهٗ رَبُّهٗۤ اَسۡلِمۡ​ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِيۡنَ"},{"ar":"وَوَصّٰى بِهَآ اِبۡرٰهٖمُ بَنِيۡهِ وَ يَعۡقُوۡبُؕ يٰبَنِىَّ اِنَّ اللّٰهَ اصۡطَفٰى لَـكُمُ الدِّيۡنَ فَلَا تَمُوۡتُنَّ اِلَّا وَاَنۡـتُمۡ مُّسۡلِمُوۡنَؕ"},{"ar":"اَمۡ كُنۡتُمۡ شُهَدَآءَ اِذۡ حَضَرَ يَعۡقُوۡبَ الۡمَوۡتُۙ اِذۡ قَالَ لِبَنِيۡهِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِىۡؕ قَالُوۡا نَعۡبُدُ اِلٰهَكَ وَاِلٰهَ اٰبَآٮِٕكَ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ اِلٰهًا وَّاحِدًا ۖۚ وَّنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"وَقَالُوۡا کُوۡنُوۡا هُوۡدًا اَوۡ نَصٰرٰى تَهۡتَدُوۡا ​ؕ قُلۡ بَلۡ مِلَّةَ اِبۡرٰهٖمَ حَنِيۡفًا ​ؕ وَمَا كَانَ مِنَ الۡمُشۡرِكِيۡنَ"},{"ar":"قُوۡلُوۡٓا اٰمَنَّا بِاللّٰهِ وَمَآ اُنۡزِلَ اِلَيۡنَا وَمَآ اُنۡزِلَ اِلٰٓى اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَمَآ اُوۡتِىَ مُوۡسٰى وَعِيۡسٰى وَمَآ اُوۡتِىَ النَّبِيُّوۡنَ مِنۡ رَّبِّهِمۡ​ۚ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡهُمۡ وَنَحۡنُ لَهٗ مُسۡلِمُوۡنَ"},{"ar":"فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَآ اٰمَنۡتُمۡ بِهٖ فَقَدِ اهۡتَدَوْا ​ۚ وَاِنۡ تَوَلَّوۡا فَاِنَّمَا هُمۡ فِىۡ شِقَاقٍ​ ۚ فَسَيَكۡفِيۡکَهُمُ اللّٰهُ ​ۚ وَهُوَ السَّمِيۡعُ الۡعَلِيۡمُؕ"},{"ar":"صِبۡغَةَ اللّٰهِ ​ۚ وَمَنۡ اَحۡسَنُ مِنَ اللّٰهِ صِبۡغَةً  وَّنَحۡنُ لَهٗ عٰبِدُوۡنَ"},{"ar":"قُلۡ اَ تُحَآجُّوۡنَـنَا فِى اللّٰهِ وَهُوَ رَبُّنَا وَرَبُّکُمۡۚ وَلَنَآ اَعۡمَالُـنَا وَلَـكُمۡ اَعۡمَالُكُمۡۚ وَنَحۡنُ لَهٗ مُخۡلِصُوۡنَۙ"},{"ar":"اَمۡ تَقُوۡلُوۡنَ اِنَّ اِبۡرٰهٖمَ وَاِسۡمٰعِيۡلَ وَاِسۡحٰقَ وَيَعۡقُوۡبَ وَالۡاَسۡبَاطَ كَانُوۡا هُوۡدًا اَوۡ نَصٰرٰى​ؕ قُلۡ ءَاَنۡـتُمۡ اَعۡلَمُ اَمِ اللّٰهُ​ ؕ وَمَنۡ اَظۡلَمُ مِمَّنۡ كَتَمَ شَهَادَةً عِنۡدَهٗ مِنَ اللّٰهِ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"تِلۡكَ اُمَّةٌ قَدۡ خَلَتۡ​ۚ لَهَا مَا كَسَبَتۡ وَلَـكُمۡ مَّا كَسَبۡتُمۡ​ۚ وَلَا تُسۡـَٔـلُوۡنَ عَمَّا كَانُوۡا يَعۡمَلُوۡنَ"},{"ar":"سَيَقُوۡلُ السُّفَهَآءُ مِنَ النَّاسِ مَا وَلّٰٮهُمۡ عَنۡ قِبۡلَتِهِمُ الَّتِىۡ كَانُوۡا عَلَيۡهَا ​ؕ قُل لِّلّٰهِ الۡمَشۡرِقُ وَالۡمَغۡرِبُ ؕ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِراطٍ مُّسۡتَقِيۡمٍ"},{"ar":"وَكَذٰلِكَ جَعَلۡنٰكُمۡ اُمَّةً وَّسَطًا لِّتَکُوۡنُوۡا شُهَدَآءَ عَلَى النَّاسِ وَيَكُوۡنَ الرَّسُوۡلُ عَلَيۡكُمۡ شَهِيۡدًا ؕ وَمَا جَعَلۡنَا الۡقِبۡلَةَ الَّتِىۡ كُنۡتَ عَلَيۡهَآ اِلَّا لِنَعۡلَمَ مَنۡ يَّتَّبِعُ الرَّسُوۡلَ مِمَّنۡ يَّنۡقَلِبُ عَلٰى عَقِبَيۡهِ ​ؕ وَاِنۡ كَانَتۡ لَكَبِيۡرَةً اِلَّا عَلَى الَّذِيۡنَ هَدَى اللّٰهُ ؕ وَمَا كَانَ اللّٰهُ لِيُضِيْعَ اِيۡمَانَكُمۡ​ ؕ اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوۡفٌ رَّحِيۡمٌ"},{"ar":"قَدۡ نَرٰى تَقَلُّبَ وَجۡهِكَ فِى السَّمَآءِ​​ۚ فَلَـنُوَلِّيَنَّكَ قِبۡلَةً تَرۡضٰٮهَا​ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَكُمۡ شَطۡرَهٗ ​ؕ وَاِنَّ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ لَيَـعۡلَمُوۡنَ اَنَّهُ الۡحَـقُّ مِنۡ رَّبِّهِمۡ​ؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا يَعۡمَلُوۡنَ"},{"ar":"وَلَٮِٕنۡ اَ تَيۡتَ الَّذِيۡنَ اُوۡتُوا الۡكِتٰبَ بِكُلِّ اٰيَةٍ مَّا تَبِعُوۡا قِبۡلَتَكَ​ۚ وَمَآ اَنۡتَ بِتَابِعٍ قِبۡلَتَهُمۡ​ۚ وَمَا بَعۡضُهُمۡ بِتَابِعٍ قِبۡلَةَ بَعۡضٍؕ وَلَٮِٕنِ اتَّبَعۡتَ اَهۡوَآءَهُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَكَ مِنَ الۡعِلۡمِ​ۙ اِنَّكَ اِذًا لَّمِنَ الظّٰلِمِيۡنَ​ۘ"},{"ar":"اَلَّذِيۡنَ اٰتَيۡنٰهُمُ الۡكِتٰبَ يَعۡرِفُوۡنَهٗ كَمَا يَعۡرِفُوۡنَ اَبۡنَآءَهُمۡؕ وَاِنَّ فَرِيۡقًا مِّنۡهُمۡ لَيَكۡتُمُوۡنَ الۡحَـقَّ وَهُمۡ يَعۡلَمُوۡنَ"},{"ar":"اَلۡحَـقُّ مِنۡ رَّبِّكَ فَلَا تَكُوۡنَنَّ مِنَ الۡمُمۡتَرِيۡنَ"},{"ar":"وَلِكُلٍّ وِّجۡهَةٌ هُوَ مُوَلِّيۡهَا ​ۚ فَاسۡتَبِقُوا الۡخَيۡرٰتِؕ اَيۡنَ مَا تَكُوۡنُوۡا يَاۡتِ بِكُمُ اللّٰهُ جَمِيۡعًا ؕ اِنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَاِنَّهٗ لَـلۡحَقُّ مِنۡ رَّبِّكَؕ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ"},{"ar":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ الۡمَسۡجِدِ الۡحَـرَامِؕ وَحَيۡثُ مَا كُنۡتُمۡ فَوَلُّوۡا وُجُوۡهَڪُمۡ شَطۡرَهٗ ۙ لِئَلَّا يَكُوۡنَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ اِلَّا الَّذِيۡنَ ظَلَمُوۡا مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَاخۡشَوۡنِىۡ وَلِاُتِمَّ نِعۡمَتِىۡ عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُوۡنَ ۙ​ۛ"},{"ar":"كَمَآ اَرۡسَلۡنَا فِيۡکُمۡ رَسُوۡلًا مِّنۡکُمۡ يَتۡلُوۡا عَلَيۡكُمۡ اٰيٰتِنَا وَيُزَكِّيۡکُمۡ وَيُعَلِّمُکُمُ الۡكِتٰبَ وَالۡحِکۡمَةَ وَيُعَلِّمُكُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ ؕ​ۛ"},{"ar":"فَاذۡكُرُوۡنِىۡٓ اَذۡكُرۡكُمۡ وَاشۡکُرُوۡا لِىۡ وَلَا تَكۡفُرُوۡنِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا اسۡتَعِيۡنُوۡا بِالصَّبۡرِ وَالصَّلٰوةِ ؕ اِنَّ اللّٰهَ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَا تَقُوۡلُوۡا لِمَنۡ يُّقۡتَلُ فِىۡ سَبِيۡلِ اللّٰهِ اَمۡوَاتٌ ؕ بَلۡ اَحۡيَآءٌ وَّلٰـكِنۡ لَّا تَشۡعُرُوۡنَ"},{"ar":"وَلَـنَبۡلُوَنَّكُمۡ بِشَىۡءٍ مِّنَ الۡخَـوۡفِ وَالۡجُـوۡعِ وَنَقۡصٍ مِّنَ الۡاَمۡوَالِ وَالۡاَنۡفُسِ وَالثَّمَرٰتِؕ وَبَشِّرِ الصّٰبِرِيۡنَۙ"},{"ar":"الَّذِيۡنَ اِذَآ اَصَابَتۡهُمۡ مُّصِيۡبَةٌ  ۙ قَالُوۡٓا اِنَّا لِلّٰهِ وَاِنَّـآ اِلَيۡهِ رٰجِعُوۡنَؕ"},{"ar":"اُولٰٓٮِٕكَ عَلَيۡهِمۡ صَلَوٰتٌ مِّنۡ رَّبِّهِمۡ وَرَحۡمَةٌ​ وَاُولٰٓٮِٕكَ هُمُ الۡمُهۡتَدُوۡنَ"},{"ar":"اِنَّ الصَّفَا وَالۡمَرۡوَةَ مِنۡ شَعَآٮِٕرِ اللّٰهِۚ فَمَنۡ حَجَّ الۡبَيۡتَ اَوِ اعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ اَنۡ يَّطَّوَّفَ بِهِمَا ؕ وَمَنۡ تَطَوَّعَ خَيۡرًا ۙ فَاِنَّ اللّٰهَ شَاكِرٌ عَلِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلۡنَا مِنَ الۡبَيِّنٰتِ وَالۡهُدٰى مِنۡۢ بَعۡدِ مَا بَيَّنّٰهُ لِلنَّاسِ فِى الۡكِتٰبِۙ اُولٰٓٮِٕكَ يَلۡعَنُهُمُ اللّٰهُ وَ يَلۡعَنُهُمُ اللّٰعِنُوۡنَۙ"},{"ar":"اِلَّا الَّذِيۡنَ تَابُوۡا وَاَصۡلَحُوۡا وَبَيَّـنُوۡا فَاُولٰٓٮِٕكَ اَ تُوۡبُ عَلَيۡهِمۡۚ وَاَنَا التَّوَّابُ الرَّحِيۡمُ"},{"ar":"اِنَّ الَّذِيۡنَ كَفَرُوۡا وَمَاتُوۡا وَهُمۡ كُفَّارٌ اُولٰٓٮِٕكَ عَلَيۡهِمۡ لَعۡنَةُ اللّٰهِ وَالۡمَلٰٓٮِٕكَةِ وَالنَّاسِ اَجۡمَعِيۡنَۙ"},{"ar":"خٰلِدِيۡنَ فِيۡهَا ۚ لَا يُخَفَّفُ عَنۡهُمُ الۡعَذَابُ وَلَا هُمۡ يُنۡظَرُوۡنَ"},{"ar":"وَاِلٰهُكُمۡ اِلٰهٌ وَّاحِدٌ  ۚ لَآ اِلٰهَ اِلَّا هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ"},{"ar":"اِنَّ فِىۡ خَلۡقِ السَّمٰوٰتِ وَالۡاَرۡضِ وَاخۡتِلَافِ الَّيۡلِ وَالنَّهَارِ وَالۡفُلۡكِ الَّتِىۡ تَجۡرِىۡ فِى الۡبَحۡرِ بِمَا يَنۡفَعُ النَّاسَ وَمَآ اَنۡزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنۡ مَّآءٍ فَاَحۡيَا بِهِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيۡهَا مِنۡ کُلِّ دَآ بَّةٍ وَّتَصۡرِيۡفِ الرِّيٰحِ وَالسَّحَابِ الۡمُسَخَّرِ بَيۡنَ السَّمَآءِ وَالۡاَرۡضِ لَاٰيٰتٍ لِّقَوۡمٍ يَّعۡقِلُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّتَّخِذُ مِنۡ دُوۡنِ اللّٰهِ اَنۡدَادًا يُّحِبُّوۡنَهُمۡ كَحُبِّ اللّٰهِؕ وَالَّذِيۡنَ اٰمَنُوۡٓا اَشَدُّ حُبًّا لِّلّٰهِ ؕ وَلَوۡ يَرَى الَّذِيۡنَ ظَلَمُوۡٓا اِذۡ يَرَوۡنَ الۡعَذَابَۙ اَنَّ الۡقُوَّةَ لِلّٰهِ جَمِيۡعًا ۙ وَّاَنَّ اللّٰهَ شَدِيۡدُ الۡعَذَابِ"},{"ar":"اِذۡ تَبَرَّاَ الَّذِيۡنَ اتُّبِعُوۡا مِنَ الَّذِيۡنَ اتَّبَعُوۡا وَرَاَوُا الۡعَذَابَ وَ تَقَطَّعَتۡ بِهِمُ الۡاَسۡبَابُ"},{"ar":"وَقَالَ الَّذِيۡنَ اتَّبَعُوۡا لَوۡ اَنَّ لَنَا كَرَّةً فَنَتَبَرَّاَ مِنۡهُمۡ كَمَا تَبَرَّءُوۡا مِنَّا ؕ كَذٰلِكَ يُرِيۡهِمُ اللّٰهُ اَعۡمَالَهُمۡ حَسَرٰتٍ عَلَيۡهِمۡؕ وَمَا هُمۡ بِخٰرِجِيۡنَ مِنَ النَّارِ"},{"ar":"يٰٓاَيُّهَا النَّاسُ كُلُوۡا مِمَّا فِى الۡاَرۡضِ حَلٰلًا طَيِّبًا  ۖ وَّلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِؕ اِنَّهٗ لَـكُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"اِنَّمَا يَاۡمُرُكُمۡ بِالسُّوۡٓءِ وَالۡفَحۡشَآءِ وَاَنۡ تَقُوۡلُوۡا عَلَى اللّٰهِ مَا لَا تَعۡلَمُوۡنَ"},{"ar":"وَاِذَا قِيۡلَ لَهُمُ اتَّبِعُوۡا مَآ اَنۡزَلَ اللّٰهُ قَالُوۡا بَلۡ نَـتَّبِعُ مَآ اَلۡفَيۡنَا عَلَيۡهِ اٰبَآءَنَا ؕ اَوَلَوۡ كَانَ اٰبَآؤُهُمۡ لَا يَعۡقِلُوۡنَ شَيۡـًٔـا وَّلَا يَهۡتَدُوۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ کَفَرُوۡا كَمَثَلِ الَّذِىۡ يَنۡعِقُ بِمَا لَا يَسۡمَعُ اِلَّا دُعَآءً وَّنِدَآءً ؕ صُمٌّۢ بُكۡمٌ عُمۡـىٌ فَهُمۡ لَا يَعۡقِلُوۡنَ"},{"ar":"يٰٓاَ يُّهَا الَّذِيۡنَ اٰمَنُوۡا کُلُوۡا مِنۡ طَيِّبٰتِ مَا رَزَقۡنٰكُمۡ وَاشۡكُرُوۡا لِلّٰهِ اِنۡ کُنۡتُمۡ اِيَّاهُ تَعۡبُدُوۡنَ"},{"ar":"اِنَّمَا حَرَّمَ عَلَيۡکُمُ الۡمَيۡتَةَ وَالدَّمَ وَلَحۡمَ الۡخِنۡزِيۡرِ وَمَآ اُهِلَّ بِهٖ لِغَيۡرِ اللّٰهِ​ۚ فَمَنِ اضۡطُرَّ غَيۡرَ بَاغٍ وَّلَا عَادٍ فَلَاۤ اِثۡمَ عَلَيۡهِ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"اِنَّ الَّذِيۡنَ يَكۡتُمُوۡنَ مَآ اَنۡزَلَ اللّٰهُ مِنَ الۡکِتٰبِ وَ يَشۡتَرُوۡنَ بِهٖ ثَمَنًا قَلِيۡلًا ۙ اُولٰٓٮِٕكَ مَا يَاۡكُلُوۡنَ فِىۡ بُطُوۡنِهِمۡ اِلَّا النَّارَ وَلَا يُکَلِّمُهُمُ اللّٰهُ يَوۡمَ الۡقِيٰمَةِ وَلَا يُزَکِّيۡهِمۡ ۖۚ وَلَهُمۡ عَذَابٌ اَ لِيۡمٌ"},{"ar":"اُولٰٓٮِٕكَ الَّذِيۡنَ اشۡتَرَوُا الضَّلٰلَةَ بِالۡهُدٰى وَالۡعَذَابَ بِالۡمَغۡفِرَةِ​ ۚ فَمَآ اَصۡبَرَهُمۡ عَلَى النَّارِ"},{"ar":"ذٰلِكَ بِاَنَّ اللّٰهَ نَزَّلَ الۡکِتٰبَ بِالۡحَـقِّؕ وَاِنَّ الَّذِيۡنَ اخۡتَلَفُوۡا فِى الۡكِتٰبِ لَفِىۡ شِقَاقٍۢ بَعِيۡدٍ"},{"ar":"لَيۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡهَكُمۡ قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَلٰـكِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَالۡمَلٰٓٮِٕکَةِ وَالۡكِتٰبِ وَالنَّبِيّٖنَ​ۚ وَاٰتَى الۡمَالَ عَلٰى حُبِّهٖ ذَوِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنَ وَابۡنَ السَّبِيۡلِۙ وَالسَّآٮِٕلِيۡنَ وَفِى الرِّقَابِ​ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّکٰوةَ ​ ۚ وَالۡمُوۡفُوۡنَ بِعَهۡدِهِمۡ اِذَا عٰهَدُوۡا ۚ وَالصّٰبِرِيۡنَ فِى الۡبَاۡسَآءِ وَالضَّرَّآءِ وَحِيۡنَ الۡبَاۡسِؕ اُولٰٓٮِٕكَ الَّذِيۡنَ صَدَقُوۡا ؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُتَّقُوۡنَ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡكُمُ الۡقِصَاصُ فِى الۡقَتۡلٰى  ؕ الۡحُرُّ بِالۡحُـرِّ وَالۡعَبۡدُ بِالۡعَبۡدِ وَالۡاُنۡثَىٰ بِالۡاُنۡثٰىؕ فَمَنۡ عُفِىَ لَهٗ مِنۡ اَخِيۡهِ شَىۡءٌ فَاتِّبَاعٌۢ بِالۡمَعۡرُوۡفِ وَاَدَآءٌ اِلَيۡهِ بِاِحۡسَانٍؕ ذٰلِكَ تَخۡفِيۡفٌ مِّنۡ رَّبِّكُمۡ وَرَحۡمَةٌ  ؕ فَمَنِ اعۡتَدٰى بَعۡدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيۡمٌۚ"},{"ar":"وَ لَـكُمۡ فِى الۡقِصَاصِ حَيٰوةٌ يّٰٓـاُولِىۡ الۡاَلۡبَابِ لَعَلَّکُمۡ تَتَّقُوۡنَ"},{"ar":"كُتِبَ عَلَيۡكُمۡ اِذَا حَضَرَ اَحَدَكُمُ الۡمَوۡتُ اِنۡ تَرَكَ خَيۡرَا  ۖۚ اۨلۡوَصِيَّةُ لِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ بِالۡمَعۡرُوۡفِۚ حَقًّا عَلَى الۡمُتَّقِيۡنَؕ"},{"ar":"فَمَنۡۢ بَدَّلَهٗ بَعۡدَمَا سَمِعَهٗ فَاِنَّمَآ اِثۡمُهٗ عَلَى الَّذِيۡنَ يُبَدِّلُوۡنَهٗؕ اِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌؕ"},{"ar":"فَمَنۡ خَافَ مِنۡ مُّوۡصٍ جَنَفًا اَوۡ اِثۡمًا فَاَصۡلَحَ بَيۡنَهُمۡ فَلَاۤ اِثۡمَ عَلَيۡهِؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يٰٓـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُتِبَ عَلَيۡکُمُ الصِّيَامُ کَمَا كُتِبَ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّكُمۡ تَتَّقُوۡنَۙ"},{"ar":"اَيَّامًا مَّعۡدُوۡدٰتٍؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَ​ؕ وَعَلَى الَّذِيۡنَ يُطِيۡقُوۡنَهٗ فِدۡيَةٌ طَعَامُ مِسۡكِيۡنٍؕ فَمَنۡ تَطَوَّعَ خَيۡرًا فَهُوَ خَيۡرٌ لَّهٗ ؕ وَاَنۡ تَصُوۡمُوۡا خَيۡرٌ لَّـکُمۡ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"شَهۡرُ رَمَضَانَ الَّذِىۡٓ اُنۡزِلَ فِيۡهِ الۡقُرۡاٰنُ هُدًى لِّلنَّاسِ وَ بَيِّنٰتٍ مِّنَ الۡهُدٰى وَالۡفُرۡقَانِۚ فَمَنۡ شَهِدَ مِنۡكُمُ الشَّهۡرَ فَلۡيَـصُمۡهُ ؕ وَمَنۡ کَانَ مَرِيۡضًا اَوۡ عَلٰى سَفَرٍ فَعِدَّةٌ مِّنۡ اَيَّامٍ اُخَرَؕ يُرِيۡدُ اللّٰهُ بِکُمُ الۡيُسۡرَ وَلَا يُرِيۡدُ بِکُمُ الۡعُسۡرَ وَلِتُکۡمِلُوا الۡعِدَّةَ وَلِتُکَبِّرُوا اللّٰهَ عَلٰى مَا هَدٰٮكُمۡ وَلَعَلَّکُمۡ تَشۡكُرُوۡنَ"},{"ar":"وَاِذَا سَاَلَـكَ عِبَادِىۡ عَنِّىۡ فَاِنِّىۡ قَرِيۡبٌؕ اُجِيۡبُ دَعۡوَةَ الدَّاعِ اِذَا دَعَانِ فَلۡيَسۡتَجِيۡبُوۡا لِىۡ وَلۡيُؤۡمِنُوۡا بِىۡ لَعَلَّهُمۡ يَرۡشُدُوۡنَ"},{"ar":"اُحِلَّ لَـکُمۡ لَيۡلَةَ الصِّيَامِ الرَّفَثُ اِلٰى نِسَآٮِٕكُمۡ​ؕ هُنَّ لِبَاسٌ لَّـكُمۡ وَاَنۡـتُمۡ لِبَاسٌ لَّهُنَّ ؕ عَلِمَ اللّٰهُ اَنَّکُمۡ كُنۡتُمۡ تَخۡتَانُوۡنَ اَنۡفُسَکُمۡ فَتَابَ عَلَيۡكُمۡ وَعَفَا عَنۡكُمۡۚ فَالۡـــٰٔنَ بَاشِرُوۡهُنَّ وَابۡتَغُوۡا مَا کَتَبَ اللّٰهُ لَـكُمۡ وَكُلُوۡا وَاشۡرَبُوۡا حَتّٰى يَتَبَيَّنَ لَـكُمُ الۡخَـيۡطُ الۡاَبۡيَضُ مِنَ الۡخَـيۡطِ الۡاَسۡوَدِ مِنَ الۡفَجۡرِ​ؕ ثُمَّ اَتِمُّوا الصِّيَامَ اِلَى الَّيۡلِ​ۚ وَلَا تُبَاشِرُوۡهُنَّ وَاَنۡـتُمۡ عٰكِفُوۡنَ فِى الۡمَسٰجِدِؕ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَقۡرَبُوۡهَا ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَّقُوۡنَ"},{"ar":"وَلَا تَاۡكُلُوۡٓا اَمۡوَالَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ وَتُدۡلُوۡا بِهَآ اِلَى الۡحُـکَّامِ لِتَاۡکُلُوۡا فَرِيۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَاَنۡـتُمۡ تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡاَهِلَّةِ ​ؕ قُلۡ هِىَ مَوَاقِيۡتُ لِلنَّاسِ وَالۡحَجِّ ؕ وَلَيۡسَ الۡبِرُّ بِاَنۡ تَاۡتُوا الۡبُيُوۡتَ مِنۡ ظُهُوۡرِهَا وَلٰـكِنَّ الۡبِرَّ مَنِ اتَّقٰى​ۚ وَاۡتُوا الۡبُيُوۡتَ مِنۡ اَبۡوَابِهَا وَاتَّقُوا اللّٰهَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ الَّذِيۡنَ يُقَاتِلُوۡنَكُمۡ وَلَا تَعۡتَدُوۡا ؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُعۡتَدِيۡنَ"},{"ar":"وَاقۡتُلُوۡهُمۡ حَيۡثُ ثَقِفۡتُمُوۡهُمۡ وَاَخۡرِجُوۡهُمۡ مِّنۡ حَيۡثُ اَخۡرَجُوۡكُمۡ​ وَالۡفِتۡنَةُ اَشَدُّ مِنَ الۡقَتۡلِۚ وَلَا تُقٰتِلُوۡهُمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَـرَامِ حَتّٰى يُقٰتِلُوۡكُمۡ فِيۡهِ​ۚ فَاِنۡ قٰتَلُوۡكُمۡ فَاقۡتُلُوۡهُمۡؕ كَذٰلِكَ جَزَآءُ الۡكٰفِرِيۡنَ"},{"ar":"فَاِنِ انۡـتَهَوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَقٰتِلُوۡهُمۡ حَتّٰى لَا تَكُوۡنَ فِتۡنَةٌ وَّيَكُوۡنَ الدِّيۡنُ لِلّٰهِ​ؕ فَاِنِ انتَهَوۡا فَلَا عُدۡوَانَ اِلَّا عَلَى الظّٰلِمِيۡنَ"},{"ar":"اَلشَّهۡرُ الۡحَـرَامُ بِالشَّهۡرِ الۡحَـرَامِ وَالۡحُرُمٰتُ قِصَاصٌ​ؕ فَمَنِ اعۡتَدٰى عَلَيۡكُمۡ فَاعۡتَدُوۡا عَلَيۡهِ بِمِثۡلِ مَا اعۡتَدٰى عَلَيۡكُمۡ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ مَعَ الۡمُتَّقِيۡنَ"},{"ar":"وَاَنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلَا تُلۡقُوۡا بِاَيۡدِيۡكُمۡ اِلَى التَّهۡلُكَةِ ۖ  ۛۚ وَاَحۡسِنُوۡا  ۛۚ اِنَّ اللّٰهَ يُحِبُّ الۡمُحۡسِنِيۡنَ"},{"ar":"وَاَتِمُّوا الۡحَجَّ وَالۡعُمۡرَةَ لِلّٰهِؕ فَاِنۡ اُحۡصِرۡتُمۡ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ وَلَا تَحۡلِقُوۡا رُءُوۡسَكُمۡ حَتّٰى يَبۡلُغَ الۡهَدۡىُ مَحِلَّهٗ ؕ فَمَنۡ كَانَ مِنۡكُمۡ مَّرِيۡضًا اَوۡ بِهٖۤ اَذًى مِّنۡ رَّاۡسِهٖ فَفِدۡيَةٌ مِّنۡ صِيَامٍ اَوۡ صَدَقَةٍ اَوۡ نُسُكٍۚ فَاِذَآ اَمِنۡتُمۡ فَمَنۡ تَمَتَّعَ بِالۡعُمۡرَةِ اِلَى الۡحَجِّ فَمَا اسۡتَيۡسَرَ مِنَ الۡهَدۡىِ​ۚ فَمَنۡ لَّمۡ يَجِدۡ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ فِى الۡحَجِّ وَسَبۡعَةٍ اِذَا رَجَعۡتُمۡؕ تِلۡكَ عَشَرَةٌ كَامِلَةٌ  ؕ ذٰ لِكَ لِمَنۡ لَّمۡ يَكُنۡ اَهۡلُهٗ حَاضِرِىۡ الۡمَسۡجِدِ الۡحَـرَامِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"اَلۡحَجُّ اَشۡهُرٌ مَّعۡلُوۡمٰتٌ ​ۚ فَمَنۡ فَرَضَ فِيۡهِنَّ الۡحَجَّ فَلَا رَفَثَ وَلَا فُسُوۡقَۙ وَلَا جِدَالَ فِى الۡحَجِّ ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ يَّعۡلَمۡهُ اللّٰهُ ​ؕ وَتَزَوَّدُوۡا فَاِنَّ خَيۡرَ الزَّادِ التَّقۡوٰى وَاتَّقُوۡنِ يٰٓاُولِى الۡاَلۡبَابِ"},{"ar":"​لَيۡسَ عَلَيۡکُمۡ جُنَاحٌ اَنۡ تَبۡتَغُوۡا فَضۡلًا مِّنۡ رَّبِّکُمۡؕ فَاِذَآ اَفَضۡتُمۡ مِّنۡ عَرَفٰتٍ فَاذۡکُرُوا اللّٰهَ عِنۡدَ الۡمَشۡعَرِ الۡحَـرَامِ وَاذۡکُرُوۡهُ کَمَا هَدٰٮکُمۡ​ۚ وَاِنۡ کُنۡتُمۡ مِّنۡ قَبۡلِهٖ لَمِنَ الضَّآ لِّيۡنَ"},{"ar":"ثُمَّ اَفِيۡضُوۡا مِنۡ حَيۡثُ اَفَاضَ النَّاسُ وَاسۡتَغۡفِرُوا اللّٰهَ​ؕ اِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"فَاِذَا قَضَيۡتُمۡ مَّنَاسِكَکُمۡ فَاذۡکُرُوا اللّٰهَ كَذِكۡرِكُمۡ اٰبَآءَکُمۡ اَوۡ اَشَدَّ ذِکۡرًا ؕ فَمِنَ النَّاسِ مَنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا وَمَا لَهٗ فِى الۡاٰخِرَةِ مِنۡ خَلَاقٍ"},{"ar":"وَمِنۡهُمۡ مَّنۡ يَّقُوۡلُ رَبَّنَآ اٰتِنَا فِى الدُّنۡيَا حَسَنَةً وَّفِى الۡاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ"},{"ar":"اُولٰٓٮِٕكَ لَهُمۡ نَصِيۡبٌ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ سَرِيۡعُ الۡحِسَابِ"},{"ar":"وَاذۡكُرُوا اللّٰهَ فِىۡٓ اَيَّامٍ مَّعۡدُوۡدٰتٍ​ؕ فَمَنۡ تَعَجَّلَ فِىۡ يَوۡمَيۡنِ فَلَاۤ اِثۡمَ عَلَيۡهِ ۚ وَمَنۡ تَاَخَّرَ فَلَاۤ اِثۡمَ عَلَيۡه​ِ ۙ لِمَنِ اتَّقٰى ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ اِلَيۡهِ تُحۡشَرُوۡنَ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يُّعۡجِبُكَ قَوۡلُهٗ فِى الۡحَيٰوةِ الدُّنۡيَا وَيُشۡهِدُ اللّٰهَ عَلٰى مَا فِىۡ قَلۡبِهٖۙ وَهُوَ اَلَدُّ الۡخِصَامِ"},{"ar":"وَاِذَا تَوَلّٰى سَعٰى فِى الۡاَرۡضِ لِيُفۡسِدَ فِيۡهَا وَيُهۡلِكَ الۡحَـرۡثَ وَالنَّسۡلَ​ؕ وَاللّٰهُ لَا يُحِبُّ الۡفَسَادَ"},{"ar":"وَاِذَا قِيۡلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتۡهُ الۡعِزَّةُ بِالۡاِثۡمِ​ فَحَسۡبُهٗ جَهَنَّمُ​ؕ وَلَبِئۡسَ الۡمِهَادُ"},{"ar":"وَمِنَ النَّاسِ مَنۡ يَّشۡرِىۡ نَفۡسَهُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ​ؕ وَ اللّٰهُ رَءُوۡفٌ ۢ بِالۡعِبَادِ"},{"ar":"يٰٓاَيُّهَا الَّذِيۡنَ اٰمَنُوا ادۡخُلُوۡا فِى السِّلۡمِ کَآفَّةً  وَلَا تَتَّبِعُوۡا خُطُوٰتِ الشَّيۡطٰنِ​ؕ اِنَّهٗ لَـکُمۡ عَدُوٌّ مُّبِيۡنٌ"},{"ar":"فَاِنۡ زَلَـلۡتُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡکُمُ الۡبَيِّنٰتُ فَاعۡلَمُوۡٓا اَنَّ اللّٰهَ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"هَلۡ يَنۡظُرُوۡنَ اِلَّاۤ اَنۡ يَّاۡتِيَهُمُ اللّٰهُ فِىۡ ظُلَلٍ مِّنَ الۡغَمَامِ وَالۡمَلٰٓٮِٕکَةُ وَقُضِىَ الۡاَمۡرُ​ؕ وَاِلَى اللّٰهِ تُرۡجَعُ الۡاُمُوۡرُ"},{"ar":"سَلۡ بَنِىۡٓ اِسۡرَآءِيۡلَ كَمۡ اٰتَيۡنٰهُمۡ مِّنۡ اٰيَةٍۢ بَيِّنَةٍ ​ؕ وَمَنۡ يُّبَدِّلۡ نِعۡمَةَ اللّٰهِ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُ فَاِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ"},{"ar":"زُيِّنَ لِلَّذِيۡنَ كَفَرُوا الۡحَيٰوةُ الدُّنۡيَا وَيَسۡخَرُوۡنَ مِنَ الَّذِيۡنَ اٰمَنُوۡا ​ ۘ وَالَّذِيۡنَ اتَّقَوۡا فَوۡقَهُمۡ يَوۡمَ الۡقِيٰمَةِ ؕ وَاللّٰهُ يَرۡزُقُ مَنۡ يَّشَآءُ بِغَيۡرِ حِسَابٍ"},{"ar":"كَانَ النَّاسُ اُمَّةً وَّاحِدَةً  فَبَعَثَ اللّٰهُ النَّبِيّٖنَ مُبَشِّرِيۡنَ وَمُنۡذِرِيۡنَ وَاَنۡزَلَ مَعَهُمُ الۡكِتٰبَ بِالۡحَـقِّ لِيَحۡكُمَ بَيۡنَ النَّاسِ فِيۡمَا اخۡتَلَفُوۡا فِيۡهِ ​ؕ وَمَا اخۡتَلَفَ فِيۡهِ اِلَّا الَّذِيۡنَ اُوۡتُوۡهُ مِنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ بَغۡيًا ۢ بَيۡنَهُمۡ​ۚ فَهَدَى اللّٰهُ الَّذِيۡنَ اٰمَنُوۡا لِمَا اخۡتَلَفُوۡا فِيۡهِ مِنَ الۡحَـقِّ بِاِذۡنِهٖ​ ؕ وَاللّٰهُ يَهۡدِىۡ مَنۡ يَّشَآءُ اِلٰى صِرَاطٍ مُّسۡتَقِيۡمٍ"},{"ar":"اَمۡ حَسِبۡتُمۡ اَنۡ تَدۡخُلُوا الۡجَـنَّةَ وَ لَمَّا يَاۡتِكُمۡ مَّثَلُ الَّذِيۡنَ خَلَوۡا مِنۡ قَبۡلِكُمۡؕ مَسَّتۡهُمُ الۡبَاۡسَآءُ وَالضَّرَّآءُ وَزُلۡزِلُوۡا حَتّٰى يَقُوۡلَ الرَّسُوۡلُ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ مَتٰى نَصۡرُ اللّٰهِؕ اَلَاۤ اِنَّ نَصۡرَ اللّٰهِ قَرِيۡبٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَ ؕ قُلۡ مَآ اَنۡفَقۡتُمۡ مِّنۡ خَيۡرٍ فَلِلۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنِ وَابۡنِ السَّبِيۡلِ​ؕ وَمَا تَفۡعَلُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"كُتِبَ عَلَيۡکُمُ الۡقِتَالُ وَهُوَ كُرۡهٌ لَّـكُمۡ​ۚ وَعَسٰۤى اَنۡ تَكۡرَهُوۡا شَيۡـــًٔا وَّهُوَ خَيۡرٌ لَّـکُمۡ​ۚ وَعَسٰۤى اَنۡ تُحِبُّوۡا شَيۡـــًٔا وَّهُوَ شَرٌّ لَّـكُمۡؕ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الشَّهۡرِ الۡحَـرَامِ قِتَالٍ فِيۡهِ​ؕ قُلۡ قِتَالٌ فِيۡهِ كَبِيۡرٌ ​ؕ وَصَدٌّ عَنۡ سَبِيۡلِ اللّٰهِ وَ کُفۡرٌ ۢ بِهٖ وَالۡمَسۡجِدِ الۡحَـرَامِ وَاِخۡرَاجُ اَهۡلِهٖ مِنۡهُ اَكۡبَرُ عِنۡدَ اللّٰهِ ​​ۚ وَالۡفِتۡنَةُ اَکۡبَرُ مِنَ الۡقَتۡلِ​ؕ وَلَا يَزَالُوۡنَ يُقَاتِلُوۡنَكُمۡ حَتّٰى يَرُدُّوۡكُمۡ عَنۡ دِيۡـنِکُمۡ اِنِ اسۡتَطَاعُوۡا ​ؕ وَمَنۡ يَّرۡتَدِدۡ مِنۡكُمۡ عَنۡ دِيۡـنِهٖ فَيَمُتۡ وَهُوَ کَافِرٌ فَاُولٰٓٮِٕكَ حَبِطَتۡ اَعۡمَالُهُمۡ فِى الدُّنۡيَا وَالۡاٰخِرَةِ ​​ۚ وَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَالَّذِيۡنَ هَاجَرُوۡا وَجَاهَدُوۡا فِىۡ سَبِيۡلِ اللّٰهِۙ اُولٰٓٮِٕكَ يَرۡجُوۡنَ رَحۡمَتَ اللّٰهِؕ وَاللّٰهُ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"يَسۡـــَٔلُوۡنَكَ عَنِ الۡخَمۡرِ وَالۡمَيۡسِرِ​ؕ قُلۡ فِيۡهِمَآ اِثۡمٌ کَبِيۡرٌ وَّمَنَافِعُ لِلنَّاسِ وَاِثۡمُهُمَآ اَکۡبَرُ مِنۡ نَّفۡعِهِمَا ؕ وَيَسۡـــَٔلُوۡنَكَ مَاذَا يُنۡفِقُوۡنَؕ  قُلِ الۡعَفۡوَ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّکُمۡ تَتَفَكَّرُوۡنَۙ"},{"ar":"فِى الدُّنۡيَا وَالۡاٰخِرَةِؕ وَيَسۡـــَٔلُوۡنَكَ عَنِ الۡيَتٰمٰىؕ قُلۡ اِصۡلَاحٌ لَّهُمۡ خَيۡرٌ ؕ وَاِنۡ تُخَالِطُوۡهُمۡ فَاِخۡوَانُكُمۡ​ؕ وَاللّٰهُ يَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ​ؕ وَلَوۡ شَآءَ اللّٰهُ لَاَعۡنَتَكُمۡؕ اِنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"وَلَا تَنۡكِحُوا الۡمُشۡرِكٰتِ حَتّٰى يُؤۡمِنَّ​ؕ وَلَاَمَةٌ مُّؤۡمِنَةٌ خَيۡرٌ مِّنۡ مُّشۡرِكَةٍ وَّلَوۡ اَعۡجَبَتۡكُمۡ​ۚ وَلَا تُنۡكِحُوا الۡمُشۡرِكِيۡنَ حَتّٰى يُؤۡمِنُوۡا ​ؕ وَلَعَبۡدٌ مُّؤۡمِنٌ خَيۡرٌ مِّنۡ مُّشۡرِكٍ وَّلَوۡ اَعۡجَبَكُمۡؕ اُولٰٓٮِٕكَ يَدۡعُوۡنَ اِلَى النَّارِ  ۖۚ وَاللّٰهُ يَدۡعُوۡٓا اِلَى الۡجَـنَّةِ وَالۡمَغۡفِرَةِ بِاِذۡنِهٖ​ۚ وَيُبَيِّنُ اٰيٰتِهٖ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُوۡنَ "},{"ar":"وَ يَسۡـــَٔلُوۡنَكَ عَنِ الۡمَحِيۡضِ​ۙ قُلۡ هُوَ اَذًى فَاعۡتَزِلُوۡا النِّسَآءَ فِى الۡمَحِيۡضِ​ۙ وَلَا تَقۡرَبُوۡهُنَّ حَتّٰى يَطۡهُرۡنَ​​ۚ فَاِذَا تَطَهَّرۡنَ فَاۡتُوۡهُنَّ مِنۡ حَيۡثُ اَمَرَكُمُ اللّٰهُ​ؕ اِنَّ اللّٰهَ يُحِبُّ التَّوَّابِيۡنَ وَيُحِبُّ الۡمُتَطَهِّرِيۡنَ"},{"ar":"نِسَآؤُكُمۡ حَرۡثٌ لَّـكُمۡ فَاۡتُوۡا حَرۡثَكُمۡ اَنّٰى شِئۡتُمۡ​  وَقَدِّمُوۡا لِاَنۡفُسِكُمۡ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّکُمۡ مُّلٰقُوۡهُ ​ؕ وَ بَشِّرِ الۡمُؤۡمِنِيۡنَ"},{"ar":"وَلَا تَجۡعَلُوا اللّٰهَ عُرۡضَةً لِّاَيۡمَانِکُمۡ اَنۡ تَبَرُّوۡا وَتَتَّقُوۡا وَتُصۡلِحُوۡا بَيۡنَ النَّاسِ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغۡوِ فِىۡٓ اَيۡمَانِكُمۡ وَلٰـكِنۡ يُّؤَاخِذُكُمۡ بِمَا كَسَبَتۡ قُلُوۡبُكُمۡ​ؕ وَاللّٰهُ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لِّـلَّذِيۡنَ يُؤۡلُوۡنَ مِنۡ نِّسَآٮِٕهِمۡ تَرَبُّصُ اَرۡبَعَةِ اَشۡهُرٍ​​ۚ فَاِنۡ فَآءُوۡ فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ"},{"ar":"وَاِنۡ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"وَالۡمُطَلَّقٰتُ يَتَرَ بَّصۡنَ بِاَنۡفُسِهِنَّ ثَلٰثَةَ قُرُوۡٓءٍ ​ؕ وَلَا يَحِلُّ لَهُنَّ اَنۡ يَّكۡتُمۡنَ مَا خَلَقَ اللّٰهُ فِىۡٓ اَرۡحَامِهِنَّ اِنۡ كُنَّ يُؤۡمِنَّ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ وَبُعُوۡلَتُهُنَّ اَحَقُّ بِرَدِّهِنَّ فِىۡ ذٰ لِكَ اِنۡ اَرَادُوۡٓا اِصۡلَاحًا ​ؕ وَلَهُنَّ مِثۡلُ الَّذِىۡ عَلَيۡهِنَّ بِالۡمَعۡرُوۡفِ​ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٌ ​ ؕ وَاللّٰهُ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"اَلطَّلَاقُ مَرَّتٰنِ​ فَاِمۡسَاكٌ ۢ بِمَعۡرُوۡفٍ اَوۡ تَسۡرِيۡحٌ ۢ بِاِحۡسَانٍ​ ؕوَلَا يَحِلُّ لَـکُمۡ اَنۡ تَاۡخُذُوۡا مِمَّآ اٰتَيۡتُمُوۡهُنَّ شَيۡـــًٔا اِلَّاۤ اَنۡ يَّخَافَآ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ فَاِنۡ خِفۡتُمۡ اَ لَّا يُقِيۡمَا حُدُوۡدَ اللّٰهِۙ فَلَا جُنَاحَ عَلَيۡهِمَا فِيۡمَا افۡتَدَتۡ بِهٖؕ​ تِلۡكَ حُدُوۡدُ اللّٰهِ فَلَا تَعۡتَدُوۡهَا ​ۚ​ وَمَنۡ يَّتَعَدَّ حُدُوۡدَ اللّٰهِ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"فَاِنۡ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنۡۢ بَعۡدُ حَتّٰى تَنۡكِحَ زَوۡجًا غَيۡرَهٗ ​ؕ فَاِنۡ طَلَّقَهَا فَلَا جُنَاحَ عَلَيۡهِمَآ اَنۡ يَّتَرَاجَعَآ اِنۡ ظَنَّآ اَنۡ يُّقِيۡمَا حُدُوۡدَ اللّٰهِ​ؕ وَتِلۡكَ حُدُوۡدُ اللّٰهِ يُبَيِّنُهَا لِقَوۡمٍ يَّعۡلَمُوۡنَ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَاَمۡسِكُوۡهُنَّ بِمَعۡرُوۡفٍ اَوۡ سَرِّحُوۡهُنَّ بِمَعۡرُوۡفٍ​ وَلَا تُمۡسِكُوۡهُنَّ ضِرَارًا لِّتَعۡتَدُوۡا​ ۚ وَمَنۡ يَّفۡعَلۡ ذٰ لِكَ فَقَدۡ ظَلَمَ نَفۡسَهٗ ​ؕ وَلَا تَتَّخِذُوۡٓا اٰيٰتِ اللّٰهِ هُزُوًا​ وَّاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ وَمَآ اَنۡزَلَ عَلَيۡكُمۡ مِّنَ الۡكِتٰبِ وَالۡحِكۡمَةِ يَعِظُكُمۡ بِهٖ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَهُنَّ فَلَا تَعۡضُلُوۡهُنَّ اَنۡ يَّنۡكِحۡنَ اَزۡوَاجَهُنَّ اِذَا تَرَاضَوۡا بَيۡنَهُمۡ بِالۡمَعۡرُوۡفِ​ؕ ذٰ لِكَ يُوۡعَظُ بِهٖ مَنۡ كَانَ مِنۡكُمۡ يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِؕ ذٰ لِكُمۡ اَزۡکٰى لَـكُمۡ وَاَطۡهَرُؕ​ وَاللّٰهُ يَعۡلَمُ وَاَنۡـتُمۡ لَا تَعۡلَمُوۡنَ"},{"ar":"وَالۡوَالِدٰتُ يُرۡضِعۡنَ اَوۡلَادَهُنَّ حَوۡلَيۡنِ كَامِلَيۡنِ​ لِمَنۡ اَرَادَ اَنۡ يُّتِمَّ الرَّضَاعَةَ ​ ؕ وَعَلَى الۡمَوۡلُوۡدِ لَهٗ رِزۡقُهُنَّ وَكِسۡوَتُهُنَّ بِالۡمَعۡرُوۡفِ​ؕ لَا تُكَلَّفُ نَفۡسٌ اِلَّا وُسۡعَهَا ۚ لَا تُضَآرَّ وَالِدَةٌ ۢ بِوَلَدِهَا وَلَا مَوۡلُوۡدٌ لَّهٗ بِوَلَدِهٖ وَعَلَى الۡوَارِثِ مِثۡلُ ذٰ لِكَ ۚ فَاِنۡ اَرَادَا فِصَالًا عَنۡ تَرَاضٍ مِّنۡهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيۡهِمَا ​ؕ وَاِنۡ اَرَدْتُّمۡ اَنۡ تَسۡتَرۡضِعُوۡٓا اَوۡلَادَكُمۡ فَلَا جُنَاحَ عَلَيۡكُمۡ اِذَا سَلَّمۡتُمۡ مَّآ اٰتَيۡتُمۡ بِالۡمَعۡرُوۡفِ​ؕ وَاتَّقُوا اللّٰهَ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡكُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا يَّتَرَبَّصۡنَ بِاَنۡفُسِهِنَّ اَرۡبَعَةَ اَشۡهُرٍ وَّعَشۡرًا ​​ۚ فَاِذَا بَلَغۡنَ اَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ بِالۡمَعۡرُوۡفِؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"وَلَا جُنَاحَ عَلَيۡكُمۡ فِيۡمَا عَرَّضۡتُمۡ بِهٖ مِنۡ خِطۡبَةِ النِّسَآءِ اَوۡ اَکۡنَنۡتُمۡ فِىۡٓ اَنۡفُسِكُمۡ​ؕ عَلِمَ اللّٰهُ اَنَّكُمۡ سَتَذۡكُرُوۡنَهُنَّ وَلٰـكِنۡ لَّا تُوَاعِدُوۡهُنَّ سِرًّا اِلَّاۤ اَنۡ تَقُوۡلُوۡا قَوۡلًا مَّعۡرُوۡفًا ​ؕ وَلَا تَعۡزِمُوۡا عُقۡدَةَ النِّکَاحِ حَتّٰى يَبۡلُغَ الۡكِتٰبُ اَجَلَهٗ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ يَعۡلَمُ مَا فِىۡٓ اَنۡفُسِكُمۡ فَاحۡذَرُوۡهُ ​ؕ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ غَفُوۡرٌ حَلِيۡمٌ"},{"ar":"لَا جُنَاحَ عَلَيۡكُمۡ اِنۡ طَلَّقۡتُمُ النِّسَآءَ مَا لَمۡ تَمَسُّوۡهُنَّ اَوۡ تَفۡرِضُوۡا لَهُنَّ فَرِيۡضَةً  ۖۚ وَّمَتِّعُوۡهُنَّ ​ۚ عَلَى الۡمُوۡسِعِ قَدَرُهٗ وَ عَلَى الۡمُقۡتِرِ قَدَرُهٗ ​ۚ مَتَاعًا ۢ بِالۡمَعۡرُوۡفِ​​ۚ حَقًّا عَلَى الۡمُحۡسِنِيۡنَ"},{"ar":"وَاِنۡ طَلَّقۡتُمُوۡهُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيۡضَةً فَنِصۡفُ مَا فَرَضۡتُمۡ اِلَّاۤ اَنۡ يَّعۡفُوۡنَ اَوۡ يَعۡفُوَا الَّذِىۡ بِيَدِهٖ عُقۡدَةُ النِّكَاحِ ​ؕ وَاَنۡ تَعۡفُوۡٓا اَقۡرَبُ لِلتَّقۡوٰى​ؕ وَ لَا تَنۡسَوُا الۡفَضۡلَ بَيۡنَكُمۡ​ؕ اِنَّ اللّٰهَ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"حَافِظُوۡا عَلَى الصَّلَوٰتِ وَالصَّلٰوةِ الۡوُسۡطٰى وَقُوۡمُوۡا لِلّٰهِ قٰنِتِيۡنَ"},{"ar":"فَاِنۡ خِفۡتُمۡ فَرِجَالًا اَوۡ رُكۡبَانًا ​​ ۚ فَاِذَآ اَمِنۡتُمۡ فَاذۡکُرُوا اللّٰهَ کَمَا عَلَّمَکُمۡ مَّا لَمۡ تَكُوۡنُوۡا تَعۡلَمُوۡنَ"},{"ar":"وَالَّذِيۡنَ يُتَوَفَّوۡنَ مِنۡکُمۡ وَيَذَرُوۡنَ اَزۡوَاجًا  ۖۚ وَّصِيَّةً لِّاَزۡوَاجِهِمۡ مَّتَاعًا اِلَى الۡحَـوۡلِ غَيۡرَ اِخۡرَاجٍ​​ ۚ فَاِنۡ خَرَجۡنَ فَلَا جُنَاحَ عَلَيۡکُمۡ فِىۡ مَا فَعَلۡنَ فِىۡٓ اَنۡفُسِهِنَّ مِنۡ مَّعۡرُوۡفٍؕ وَاللّٰهُ عَزِيۡزٌ حَکِيۡمٌ"},{"ar":"وَلِلۡمُطَلَّقٰتِ مَتَاعٌ ۢ بِالۡمَعۡرُوۡفِ ​ؕ حَقًّا عَلَى الۡمُتَّقِيۡنَ"},{"ar":"كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـکُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَعۡقِلُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِيۡنَ خَرَجُوۡا مِنۡ دِيَارِهِمۡ وَهُمۡ اُلُوۡفٌ حَذَرَ الۡمَوۡتِ فَقَالَ لَهُمُ اللّٰهُ مُوۡتُوۡا ثُمَّ اَحۡيَاھُمۡ​ؕ اِنَّ اللّٰهَ لَذُوۡ فَضۡلٍ عَلَى النَّاسِ وَلٰـكِنَّ اَکۡثَرَ النَّاسِ لَا يَشۡکُرُوۡنَ"},{"ar":"وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَاعۡلَمُوۡٓا اَنَّ اللّٰهَ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗۤ اَضۡعَافًا کَثِيۡرَةً  ​ؕ وَاللّٰهُ يَقۡبِضُ وَيَبۡصُۜطُ وَ اِلَيۡهِ تُرۡجَعُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الۡمَلَاِ مِنۡۢ بَنِىۡٓ اِسۡرَآءِيۡلَ مِنۡۢ بَعۡدِ مُوۡسٰى​ۘ اِذۡ قَالُوۡا لِنَبِىٍّ لَّهُمُ ابۡعَثۡ لَنَا مَلِکًا نُّقَاتِلۡ فِىۡ سَبِيۡلِ اللّٰهِ​ؕ قَالَ هَلۡ عَسَيۡتُمۡ اِنۡ کُتِبَ عَلَيۡکُمُ الۡقِتَالُ اَلَّا تُقَاتِلُوۡا ؕ قَالُوۡا وَمَا لَنَآ اَلَّا نُقَاتِلَ فِىۡ سَبِيۡلِ اللّٰهِ وَقَدۡ اُخۡرِجۡنَا مِنۡ دِيَارِنَا وَاَبۡنَآٮِٕنَا ​ؕ فَلَمَّا کُتِبَ عَلَيۡهِمُ الۡقِتَالُ تَوَلَّوۡا اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ وَاللّٰهُ عَلِيۡمٌۢ بِالظّٰلِمِيۡنَ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اللّٰهَ قَدۡ بَعَثَ لَـکُمۡ طَالُوۡتَ مَلِكًا ​ؕ قَالُوۡٓا اَنّٰى يَكُوۡنُ لَهُ الۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ اَحَقُّ بِالۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةً مِّنَ الۡمَالِ​ؕ قَالَ اِنَّ اللّٰهَ اصۡطَفٰٮهُ عَلَيۡکُمۡ وَزَادَهٗ بَسۡطَةً فِى الۡعِلۡمِ وَ الۡجِسۡمِ​ؕ وَاللّٰهُ يُؤۡتِىۡ مُلۡکَهٗ مَنۡ يَّشَآءُ ​ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اٰيَةَ مُلۡکِهٖۤ اَنۡ يَّاۡتِيَکُمُ التَّابُوۡتُ فِيۡهِ سَکِيۡنَةٌ مِّنۡ رَّبِّکُمۡ وَبَقِيَّةٌ مِّمَّا تَرَكَ اٰلُ مُوۡسٰى وَاٰلُ هٰرُوۡنَ تَحۡمِلُهُ الۡمَلٰٓٮِٕكَةُ​ ؕ اِنَّ فِىۡ ذٰلِكَ لَاٰيَةً لَّـکُمۡ اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَلَمَّا فَصَلَ طَالُوۡتُ بِالۡجُـنُوۡدِۙ قَالَ اِنَّ اللّٰهَ مُبۡتَلِيۡکُمۡ بِنَهَرٍ​ۚ فَمَنۡ شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّىۡ​ۚ وَمَنۡ لَّمۡ يَطۡعَمۡهُ فَاِنَّهٗ مِنِّىۡٓ اِلَّا مَنِ اغۡتَرَفَ غُرۡفَةً ۢ بِيَدِهٖ​​ۚ فَشَرِبُوۡا مِنۡهُ اِلَّا قَلِيۡلًا مِّنۡهُمۡ​ؕ فَلَمَّا جَاوَزَهٗ هُوَ وَالَّذِيۡنَ اٰمَنُوۡا مَعَهٗ ۙ قَالُوۡا لَا طَاقَةَ لَنَا الۡيَوۡمَ بِجَالُوۡتَ وَجُنُوۡدِهٖ​ؕ قَالَ الَّذِيۡنَ يَظُنُّوۡنَ اَنَّهُمۡ مُّلٰقُوا اللّٰهِۙ کَمۡ مِّنۡ فِئَةٍ قَلِيۡلَةٍ غَلَبَتۡ فِئَةً کَثِيۡرَةً ۢ بِاِذۡنِ اللّٰهِ​ؕ وَاللّٰهُ مَعَ الصّٰبِرِيۡنَ"},{"ar":"وَلَمَّا بَرَزُوۡا لِجَـالُوۡتَ وَجُنُوۡدِهٖ قَالُوۡا رَبَّنَآ اَفۡرِغۡ عَلَيۡنَا صَبۡرًا وَّثَبِّتۡ اَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡکٰفِرِيۡنَؕ"},{"ar":"فَهَزَمُوۡهُمۡ بِاِذۡنِ اللّٰهِ ۙ وَقَتَلَ دَاوٗدُ جَالُوۡتَ وَاٰتٰٮهُ اللّٰهُ الۡمُلۡكَ وَالۡحِکۡمَةَ وَعَلَّمَهٗ مِمَّا يَشَآءُ ​ؕ وَلَوۡلَا دَفۡعُ اللّٰهِ النَّاسَ بَعۡضَهُمۡ بِبَعۡضٍ لَّفَسَدَتِ الۡاَرۡضُ وَلٰـکِنَّ اللّٰهَ ذُوۡ فَضۡلٍ عَلَى الۡعٰلَمِيۡنَ"},{"ar":"تِلۡكَ اٰيٰتُ اللّٰهِ نَـتۡلُوۡهَا عَلَيۡكَ بِالۡحَـقِّ​ؕ وَاِنَّكَ لَمِنَ الۡمُرۡسَلِيۡنَ"},{"ar":"تِلۡكَ الرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلٰى بَعۡضٍ​ۘ مِنۡهُمۡ مَّنۡ كَلَّمَ اللّٰهُ​ وَرَفَعَ بَعۡضَهُمۡ دَرَجٰتٍ​ؕ وَاٰتَيۡنَا عِيۡسَى ابۡنَ مَرۡيَمَ الۡبَيِّنٰتِ وَاَيَّدۡنٰهُ بِرُوۡحِ الۡقُدُسِ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلَ الَّذِيۡنَ مِنۡۢ بَعۡدِهِمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡهُمُ الۡبَيِّنٰتُ وَلٰـكِنِ اخۡتَلَفُوۡا فَمِنۡهُمۡ مَّنۡ اٰمَنَ وَمِنۡهُمۡ مَّنۡ كَفَرَ​ؕ وَلَوۡ شَآءَ اللّٰهُ مَا اقۡتَتَلُوۡا وَلٰـكِنَّ اللّٰهَ يَفۡعَلُ مَا يُرِيۡدُ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِمَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ يَوۡمٌ لَّا بَيۡعٌ فِيۡهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ ​ ؕ وَالۡكٰفِرُوۡنَ هُمُ الظّٰلِمُوۡنَ"},{"ar":"اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَـىُّ الۡقَيُّوۡمُۚ  لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ​ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ​ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ​ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ​​ۚ وَلَا يَـــُٔوۡدُهٗ حِفۡظُهُمَا ​ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ"},{"ar":"لَاۤ اِكۡرَاهَ فِى الدِّيۡنِ​ۙ  قَد تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَىِّ​ۚ فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡۢ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقٰى لَا انْفِصَامَ لَهَا​​ ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ"},{"ar":"اَللّٰهُ وَلِىُّ الَّذِيۡنَ اٰمَنُوۡا يُخۡرِجُهُمۡ مِّنَ الظُّلُمٰتِ اِلَى النُّوۡرِ​ؕ  وَالَّذِيۡنَ كَفَرُوۡۤا اَوۡلِيٰٓـــُٔهُمُ الطَّاغُوۡتُۙ يُخۡرِجُوۡنَهُمۡ مِّنَ النُّوۡرِ اِلَى الظُّلُمٰتِ​ؕ اُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"اَلَمۡ تَرَ اِلَى الَّذِىۡ حَآجَّ اِبۡرٰهٖمَ فِىۡ رَبِّهٖۤ اَنۡ اٰتٰٮهُ اللّٰهُ الۡمُلۡكَ​ۘ اِذۡ قَالَ اِبۡرٰهٖمُ رَبِّىَ الَّذِىۡ يُحۡىٖ وَيُمِيۡتُۙ قَالَ اَنَا اُحۡىٖ وَاُمِيۡتُ​ؕ قَالَ اِبۡرٰهٖمُ فَاِنَّ اللّٰهَ يَاۡتِىۡ بِالشَّمۡسِ مِنَ الۡمَشۡرِقِ فَاۡتِ بِهَا مِنَ الۡمَغۡرِبِ فَبُهِتَ الَّذِىۡ كَفَرَ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الظّٰلِمِيۡنَ​ۚ"},{"ar":"اَوۡ كَالَّذِىۡ مَرَّ عَلٰى قَرۡيَةٍ وَّ هِىَ خَاوِيَةٌ عَلٰى عُرُوۡشِهَا ​ۚ قَالَ اَنّٰى يُحۡىٖ هٰذِهِ اللّٰهُ بَعۡدَ مَوۡتِهَا ​ۚ فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ ​ؕ قَالَ كَمۡ لَبِثۡتَ​ؕ قَالَ لَبِثۡتُ يَوۡمًا اَوۡ بَعۡضَ يَوۡمٍ​ؕ قَالَ بَلۡ لَّبِثۡتَ مِائَةَ عَامٍ فَانۡظُرۡ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡ​ۚ وَانْظُرۡ اِلٰى حِمَارِكَ وَلِنَجۡعَلَكَ اٰيَةً لِّلنَّاسِ​ وَانْظُرۡ اِلَى الۡعِظَامِ كَيۡفَ نُـنۡشِزُهَا ثُمَّ نَكۡسُوۡهَا لَحۡمًا ​ؕ فَلَمَّا تَبَيَّنَ لَهٗ ۙ قَالَ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"وَاِذۡ قَالَ اِبۡرٰهٖمُ رَبِّ اَرِنِىۡ كَيۡفَ تُحۡىِ الۡمَوۡتٰى ؕ قَالَ اَوَلَمۡ تُؤۡمِنۡ​ؕ قَالَ بَلٰى وَلٰـكِنۡ لِّيَطۡمَٮِٕنَّ قَلۡبِىۡ​ؕ قَالَ فَخُذۡ اَرۡبَعَةً مِّنَ الطَّيۡرِ فَصُرۡهُنَّ اِلَيۡكَ ثُمَّ اجۡعَلۡ عَلٰى كُلِّ جَبَلٍ مِّنۡهُنَّ جُزۡءًا ثُمَّ ادۡعُهُنَّ يَاۡتِيۡنَكَ سَعۡيًا ​ؕ وَاعۡلَمۡ اَنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ"},{"ar":"مَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِىۡ كُلِّ سُنۡۢبُلَةٍ مِّائَةُ حَبَّةٍ​ؕ وَاللّٰهُ يُضٰعِفُ لِمَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ ثُمَّ لَا يُتۡبِعُوۡنَ مَاۤ اَنۡفَقُوۡا مَنًّا وَّلَاۤ اَذًى​ۙ لَّهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"قَوۡلٌ مَّعۡرُوۡفٌ وَّمَغۡفِرَةٌ خَيۡرٌ مِّنۡ صَدَقَةٍ يَّتۡبَعُهَاۤ اَذًى​ؕ وَاللّٰهُ غَنِىٌّ حَلِيۡمٌ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِكُمۡ بِالۡمَنِّ وَالۡاَذٰىۙ كَالَّذِىۡ يُنۡفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ فَمَثَلُهٗ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلۡدًا ​ؕ لَا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الۡـكٰفِرِيۡنَ"},{"ar":"وَمَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ وَ تَثۡبِيۡتًا مِّنۡ اَنۡفُسِهِمۡ كَمَثَلِ جَنَّةٍۢ بِرَبۡوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتۡ اُكُلَهَا ضِعۡفَيۡنِ​ۚ فَاِنۡ لَّمۡ يُصِبۡهَا وَابِلٌ فَطَلٌّ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ"},{"ar":"اَيَوَدُّ اَحَدُكُمۡ اَنۡ تَكُوۡنَ لَهٗ جَنَّةٌ مِّنۡ نَّخِيۡلٍ وَّاَعۡنَابٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُۙ لَهٗ فِيۡهَا مِنۡ كُلِّ الثَّمَرٰتِۙ وَاَصَابَهُ الۡكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَآءُ ۖۚ فَاَصَابَهَاۤ اِعۡصَارٌ فِيۡهِ نَارٌ فَاحۡتَرَقَتۡ​ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمُ الۡاٰيٰتِ لَعَلَّكُمۡ تَتَفَكَّرُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِنۡ طَيِّبٰتِ مَا كَسَبۡتُمۡ وَمِمَّاۤ اَخۡرَجۡنَا لَـكُمۡ مِّنَ الۡاَرۡضِ وَلَا تَيَمَّمُوا الۡخَبِيۡثَ مِنۡهُ تُنۡفِقُوۡنَ وَلَسۡتُمۡ بِاٰخِذِيۡهِ اِلَّاۤ اَنۡ تُغۡمِضُوۡا فِيۡهِ​ؕ وَاعۡلَمُوۡۤا اَنَّ اللّٰهَ غَنِىٌّ حَمِيۡدٌ"},{"ar":"اَلشَّيۡطٰنُ يَعِدُكُمُ الۡـفَقۡرَ وَيَاۡمُرُكُمۡ بِالۡفَحۡشَآءِ​ ۚ وَاللّٰهُ يَعِدُكُمۡ مَّغۡفِرَةً مِّنۡهُ وَفَضۡلًا ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌۚ  ۙۖ"},{"ar":"يُؤۡتِى الۡحِكۡمَةَ مَنۡ يَّشَآءُ​​ ۚ وَمَنۡ يُّؤۡتَ الۡحِكۡمَةَ فَقَدۡ اُوۡتِىَ خَيۡرًا كَثِيۡرًا​ ؕ وَمَا يَذَّكَّرُ اِلَّاۤ اُولُوا الۡاَلۡبَابِ"},{"ar":"وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَةٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰهَ يَعۡلَمُهٗ ؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ"},{"ar":"اِنۡ تُبۡدُوا الصَّدَقٰتِ فَنِعِمَّا هِىَ​ۚ وَاِنۡ تُخۡفُوۡهَا وَ تُؤۡتُوۡهَا الۡفُقَرَآءَ فَهُوَ خَيۡرٌ لَّكُمۡ​ؕ وَيُكَفِّرُ عَنۡكُمۡ مِّنۡ سَيِّاٰتِكُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ"},{"ar":"لَيۡسَ عَلَيۡكَ هُدٰٮهُمۡ وَلٰـكِنَّ اللّٰهَ يَهۡدِىۡ مَنۡ يَّشَآءُ​ ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَلِاَنۡفُسِكُمۡ​ؕ وَمَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡهِ اللّٰهِ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ يُّوَفَّ اِلَيۡكُمۡ وَاَنۡـتُمۡ لَا تُظۡلَمُوۡنَ"},{"ar":"لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِى الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ​ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ​ۚ لَا يَسۡـــَٔلُوۡنَ النَّاسَ اِلۡحَــافًا ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ"},{"ar":"اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ بِالَّيۡلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"اَلَّذِيۡنَ يَاۡكُلُوۡنَ الرِّبٰوا لَا يَقُوۡمُوۡنَ اِلَّا كَمَا يَقُوۡمُ الَّذِىۡ يَتَخَبَّطُهُ الشَّيۡطٰنُ مِنَ الۡمَسِّ​ؕ ذٰ لِكَ بِاَنَّهُمۡ قَالُوۡۤا اِنَّمَا الۡبَيۡعُ مِثۡلُ الرِّبٰوا​ ۘ​ وَاَحَلَّ اللّٰهُ الۡبَيۡعَ وَحَرَّمَ الرِّبٰوا​ ؕ فَمَنۡ جَآءَهٗ مَوۡعِظَةٌ مِّنۡ رَّبِّهٖ فَانۡتَهٰى فَلَهٗ مَا سَلَفَؕ وَاَمۡرُهٗۤ اِلَى اللّٰهِ​ؕ وَمَنۡ عَادَ فَاُولٰٓٮِٕكَ اَصۡحٰبُ النَّارِ​ۚ هُمۡ فِيۡهَا خٰلِدُوۡنَ"},{"ar":"يَمۡحَقُ اللّٰهُ الرِّبٰوا وَيُرۡبِى الصَّدَقٰتِ​ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيۡمٍ"},{"ar":"اِنَّ الَّذِيۡنَ اٰمَنُوۡا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوۡا مَا بَقِىَ مِنَ الرِّبٰٓوا اِنۡ كُنۡتُمۡ مُّؤۡمِنِيۡنَ"},{"ar":"فَاِنۡ لَّمۡ تَفۡعَلُوۡا فَاۡذَنُوۡا بِحَرۡبٍ مِّنَ اللّٰهِ وَرَسُوۡلِهٖ​ۚ وَاِنۡ تُبۡتُمۡ فَلَـكُمۡ رُءُوۡسُ اَمۡوَالِكُمۡ​ۚ لَا تَظۡلِمُوۡنَ وَلَا تُظۡلَمُوۡنَ"},{"ar":"وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ ​ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ​ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ"},{"ar":"وَاتَّقُوۡا يَوۡمًا تُرۡجَعُوۡنَ فِيۡهِ اِلَى اللّٰهِ ثُمَّ تُوَفّٰى كُلُّ نَفۡسٍ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُوۡنَ"},{"ar":"يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا تَدَايَنۡتُمۡ بِدَيۡنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكۡتُبُوۡهُ ​ؕ وَلۡيَكۡتُب بَّيۡنَكُمۡ كَاتِبٌۢ بِالۡعَدۡلِ​ وَلَا يَاۡبَ كَاتِبٌ اَنۡ يَّكۡتُبَ كَمَا عَلَّمَهُ اللّٰهُ​ فَلۡيَكۡتُبۡ ​ۚوَلۡيُمۡلِلِ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبۡخَسۡ مِنۡهُ شَيۡـــًٔا ​ؕ فَاِنۡ كَانَ الَّذِىۡ عَلَيۡهِ الۡحَـقُّ سَفِيۡهًا اَوۡ ضَعِيۡفًا اَوۡ لَا يَسۡتَطِيۡعُ اَنۡ يُّمِلَّ هُوَ فَلۡيُمۡلِلۡ وَلِيُّهٗ بِالۡعَدۡلِ​ؕ وَاسۡتَشۡهِدُوۡا شَهِيۡدَيۡنِ مِنۡ رِّجَالِكُمۡ​ۚ فَاِنۡ لَّمۡ يَكُوۡنَا رَجُلَيۡنِ فَرَجُلٌ وَّامۡرَاَتٰنِ مِمَّنۡ تَرۡضَوۡنَ مِنَ الشُّهَدَآءِ اَنۡ تَضِلَّ اِحۡدٰٮهُمَا فَتُذَكِّرَ اِحۡدٰٮهُمَا الۡاُخۡرٰى​ؕ وَ لَا يَاۡبَ الشُّهَدَآءُ اِذَا مَا دُعُوۡا ​ؕ وَلَا تَسۡـــَٔمُوۡۤا اَنۡ تَكۡتُبُوۡهُ صَغِيۡرًا اَوۡ كَبِيۡرًا اِلٰٓى اَجَلِهٖ​ؕ ذٰ لِكُمۡ اَقۡسَطُ عِنۡدَ اللّٰهِ وَاَقۡوَمُ لِلشَّهَادَةِ وَاَدۡنٰۤى اَلَّا تَرۡتَابُوۡٓا اِلَّاۤ اَنۡ تَكُوۡنَ تِجَارَةً حَاضِرَةً تُدِيۡرُوۡنَهَا بَيۡنَكُمۡ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ اَلَّا تَكۡتُبُوۡهَا ​ؕ وَاَشۡهِدُوۡۤا اِذَا تَبَايَعۡتُمۡ وَلَا يُضَآرَّ كَاتِبٌ وَّلَا شَهِيۡدٌ  ؕ وَاِنۡ تَفۡعَلُوۡا فَاِنَّهٗ فُسُوۡقٌ ۢ بِكُمۡ ؕ وَ اتَّقُوا اللّٰهَ​ ؕ وَيُعَلِّمُكُمُ اللّٰهُ​ ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ"},{"ar":"وَاِنۡ كُنۡتُمۡ عَلٰى سَفَرٍ وَّلَمۡ تَجِدُوۡا كَاتِبًا فَرِهٰنٌ مَّقۡبُوۡضَةٌ ​ ؕ فَاِنۡ اَمِنَ بَعۡضُكُمۡ بَعۡضًا فَلۡيُؤَدِّ الَّذِى اؤۡتُمِنَ اَمَانَـتَهٗ وَلۡيَتَّقِ اللّٰهَ رَبَّهٗ​ؕ وَلَا تَكۡتُمُوا الشَّهَادَةَ ​ ؕ وَمَنۡ يَّكۡتُمۡهَا فَاِنَّهٗۤ اٰثِمٌ قَلۡبُهٗ​ؕ وَ اللّٰهُ بِمَا تَعۡمَلُوۡنَ عَلِيۡمٌ"},{"ar":"لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ​ؕ وَاِنۡ تُبۡدُوۡا مَا فِىۡۤ اَنۡفُسِكُمۡ اَوۡ تُخۡفُوۡهُ يُحَاسِبۡكُمۡ بِهِ اللّٰهُ​ؕ فَيَـغۡفِرُ لِمَنۡ يَّشَآءُ وَيُعَذِّبُ مَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ"},{"ar":"اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ​ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓٮِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ​ وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا​ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ"},{"ar":"لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ​ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ​ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ​ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ​​ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ​ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ"}]}};
const DEFAULT_QURAN = DEFAULT_QURAN_INDOPAK;

const STORAGE_DATA = "quran_data_v32";
const STORAGE_GAME = "quran_game_v32";
const STORAGE_META = "quran_meta_v31";
const SURAH_META = [{"n":1,"ar":"سُورَةُ ٱلْفَاتِحَةِ","en":"Al-Faatiha","a":7},{"n":2,"ar":"سُورَةُ البَقَرَةِ","en":"Al-Baqara","a":286},{"n":3,"ar":"سُورَةُ آلِ عِمۡرَانَ","en":"Aal-i-Imraan","a":200},{"n":4,"ar":"سُورَةُ النِّسَاءِ","en":"An-Nisaa","a":176},{"n":5,"ar":"سُورَةُ المَائـِدَةِ","en":"Al-Maaida","a":120},{"n":6,"ar":"سُورَةُ الأَنۡعَامِ","en":"Al-An'aam","a":165},{"n":7,"ar":"سُورَةُ الأَعۡرَافِ","en":"Al-A'raaf","a":206},{"n":8,"ar":"سُورَةُ الأَنفَالِ","en":"Al-Anfaal","a":75},{"n":9,"ar":"سُورَةُ التَّوۡبَةِ","en":"At-Tawba","a":129},{"n":10,"ar":"سُورَةُ يُونُسَ","en":"Yunus","a":109},{"n":11,"ar":"سُورَةُ هُودٍ","en":"Hud","a":123},{"n":12,"ar":"سُورَةُ يُوسُفَ","en":"Yusuf","a":111},{"n":13,"ar":"سُورَةُ الرَّعۡدِ","en":"Ar-Ra'd","a":43},{"n":14,"ar":"سُورَةُ إِبۡرَاهِيمَ","en":"Ibrahim","a":52},{"n":15,"ar":"سُورَةُ الحِجۡرِ","en":"Al-Hijr","a":99},{"n":16,"ar":"سُورَةُ النَّحۡلِ","en":"An-Nahl","a":128},{"n":17,"ar":"سُورَةُ الإِسۡرَاءِ","en":"Al-Israa","a":111},{"n":18,"ar":"سُورَةُ الكَهۡفِ","en":"Al-Kahf","a":110},{"n":19,"ar":"سُورَةُ مَرۡيَمَ","en":"Maryam","a":98},{"n":20,"ar":"سُورَةُ طه","en":"Taa-Haa","a":135},{"n":21,"ar":"سُورَةُ الأَنبِيَاءِ","en":"Al-Anbiyaa","a":112},{"n":22,"ar":"سُورَةُ الحَجِّ","en":"Al-Hajj","a":78},{"n":23,"ar":"سُورَةُ المُؤۡمِنُونَ","en":"Al-Muminoon","a":118},{"n":24,"ar":"سُورَةُ النُّورِ","en":"An-Noor","a":64},{"n":25,"ar":"سُورَةُ الفُرۡقَانِ","en":"Al-Furqaan","a":77},{"n":26,"ar":"سُورَةُ الشُّعَرَاءِ","en":"Ash-Shu'araa","a":227},{"n":27,"ar":"سُورَةُ النَّمۡلِ","en":"An-Naml","a":93},{"n":28,"ar":"سُورَةُ القَصَصِ","en":"Al-Qasas","a":88},{"n":29,"ar":"سُورَةُ العَنكَبُوتِ","en":"Al-Ankaboot","a":69},{"n":30,"ar":"سُورَةُ الرُّومِ","en":"Ar-Room","a":60},{"n":31,"ar":"سُورَةُ لُقۡمَانَ","en":"Luqman","a":34},{"n":32,"ar":"سُورَةُ السَّجۡدَةِ","en":"As-Sajda","a":30},{"n":33,"ar":"سُورَةُ الأَحۡزَابِ","en":"Al-Ahzaab","a":73},{"n":34,"ar":"سُورَةُ سَبَإٍ","en":"Saba","a":54},{"n":35,"ar":"سُورَةُ فَاطِرٍ","en":"Faatir","a":45},{"n":36,"ar":"سُورَةُ يسٓ","en":"Yaseen","a":83},{"n":37,"ar":"سُورَةُ الصَّافَّاتِ","en":"As-Saaffaat","a":182},{"n":38,"ar":"سُورَةُ صٓ","en":"Saad","a":88},{"n":39,"ar":"سُورَةُ الزُّمَرِ","en":"Az-Zumar","a":75},{"n":40,"ar":"سُورَةُ غَافِرٍ","en":"Ghafir","a":85},{"n":41,"ar":"سُورَةُ فُصِّلَتۡ","en":"Fussilat","a":54},{"n":42,"ar":"سُورَةُ الشُّورَىٰ","en":"Ash-Shura","a":53},{"n":43,"ar":"سُورَةُ الزُّخۡرُفِ","en":"Az-Zukhruf","a":89},{"n":44,"ar":"سُورَةُ الدُّخَانِ","en":"Ad-Dukhaan","a":59},{"n":45,"ar":"سُورَةُ الجَاثِيَةِ","en":"Al-Jaathiya","a":37},{"n":46,"ar":"سُورَةُ الأَحۡقَافِ","en":"Al-Ahqaf","a":35},{"n":47,"ar":"سُورَةُ مُحَمَّدٍ","en":"Muhammad","a":38},{"n":48,"ar":"سُورَةُ الفَتۡحِ","en":"Al-Fath","a":29},{"n":49,"ar":"سُورَةُ الحُجُرَاتِ","en":"Al-Hujuraat","a":18},{"n":50,"ar":"سُورَةُ قٓ","en":"Qaaf","a":45},{"n":51,"ar":"سُورَةُ الذَّارِيَاتِ","en":"Adh-Dhaariyat","a":60},{"n":52,"ar":"سُورَةُ الطُّورِ","en":"At-Tur","a":49},{"n":53,"ar":"سُورَةُ النَّجۡمِ","en":"An-Najm","a":62},{"n":54,"ar":"سُورَةُ القَمَرِ","en":"Al-Qamar","a":55},{"n":55,"ar":"سُورَةُ الرَّحۡمَٰن","en":"Ar-Rahmaan","a":78},{"n":56,"ar":"سُورَةُ الوَاقِعَةِ","en":"Al-Waaqia","a":96},{"n":57,"ar":"سُورَةُ الحَدِيدِ","en":"Al-Hadid","a":29},{"n":58,"ar":"سُورَةُ المُجَادلَةِ","en":"Al-Mujaadila","a":22},{"n":59,"ar":"سُورَةُ الحَشۡرِ","en":"Al-Hashr","a":24},{"n":60,"ar":"سُورَةُ المُمۡتَحنَةِ","en":"Al-Mumtahana","a":13},{"n":61,"ar":"سُورَةُ الصَّفِّ","en":"As-Saff","a":14},{"n":62,"ar":"سُورَةُ الجُمُعَةِ","en":"Al-Jumu'a","a":11},{"n":63,"ar":"سُورَةُ المُنَافِقُونَ","en":"Al-Munaafiqoon","a":11},{"n":64,"ar":"سُورَةُ التَّغَابُنِ","en":"At-Taghaabun","a":18},{"n":65,"ar":"سُورَةُ الطَّلَاقِ","en":"At-Talaaq","a":12},{"n":66,"ar":"سُورَةُ التَّحۡرِيمِ","en":"At-Tahrim","a":12},{"n":67,"ar":"سُورَةُ المُلۡكِ","en":"Al-Mulk","a":30},{"n":68,"ar":"سُورَةُ القَلَمِ","en":"Al-Qalam","a":52},{"n":69,"ar":"سُورَةُ الحَاقَّةِ","en":"Al-Haaqqa","a":52},{"n":70,"ar":"سُورَةُ المَعَارِجِ","en":"Al-Ma'aarij","a":44},{"n":71,"ar":"سُورَةُ نُوحٍ","en":"Nooh","a":28},{"n":72,"ar":"سُورَةُ الجِنِّ","en":"Al-Jinn","a":28},{"n":73,"ar":"سُورَةُ المُزَّمِّلِ","en":"Al-Muzzammil","a":20},{"n":74,"ar":"سُورَةُ المُدَّثِّرِ","en":"Al-Muddaththir","a":56},{"n":75,"ar":"سُورَةُ القِيَامَةِ","en":"Al-Qiyaama","a":40},{"n":76,"ar":"سُورَةُ الإِنسَانِ","en":"Al-Insaan","a":31},{"n":77,"ar":"سُورَةُ المُرۡسَلَاتِ","en":"Al-Mursalaat","a":50},{"n":78,"ar":"سُورَةُ النَّبَإِ","en":"An-Naba","a":40},{"n":79,"ar":"سُورَةُ النَّازِعَاتِ","en":"An-Naazi'aat","a":46},{"n":80,"ar":"سُورَةُ عَبَسَ","en":"Abasa","a":42},{"n":81,"ar":"سُورَةُ التَّكۡوِيرِ","en":"At-Takwir","a":29},{"n":82,"ar":"سُورَةُ الانفِطَارِ","en":"Al-Infitaar","a":19},{"n":83,"ar":"سُورَةُ المُطَفِّفِينَ","en":"Al-Mutaffifin","a":36},{"n":84,"ar":"سُورَةُ الانشِقَاقِ","en":"Al-Inshiqaaq","a":25},{"n":85,"ar":"سُورَةُ البُرُوجِ","en":"Al-Burooj","a":22},{"n":86,"ar":"سُورَةُ الطَّارِقِ","en":"At-Taariq","a":17},{"n":87,"ar":"سُورَةُ الأَعۡلَىٰ","en":"Al-A'laa","a":19},{"n":88,"ar":"سُورَةُ الغَاشِيَةِ","en":"Al-Ghaashiya","a":26},{"n":89,"ar":"سُورَةُ الفَجۡرِ","en":"Al-Fajr","a":30},{"n":90,"ar":"سُورَةُ البَلَدِ","en":"Al-Balad","a":20},{"n":91,"ar":"سُورَةُ الشَّمۡسِ","en":"Ash-Shams","a":15},{"n":92,"ar":"سُورَةُ اللَّيۡلِ","en":"Al-Lail","a":21},{"n":93,"ar":"سُورَةُ الضُّحَىٰ","en":"Ad-Dhuhaa","a":11},{"n":94,"ar":"سُورَةُ الشَّرۡحِ","en":"Ash-Sharh","a":8},{"n":95,"ar":"سُورَةُ التِّينِ","en":"At-Tin","a":8},{"n":96,"ar":"سُورَةُ العَلَقِ","en":"Al-Alaq","a":19},{"n":97,"ar":"سُورَةُ القَدۡرِ","en":"Al-Qadr","a":5},{"n":98,"ar":"سُورَةُ البَيِّنَةِ","en":"Al-Bayyina","a":8},{"n":99,"ar":"سُورَةُ الزَّلۡزَلَةِ","en":"Az-Zalzala","a":8},{"n":100,"ar":"سُورَةُ العَادِيَاتِ","en":"Al-Aadiyaat","a":11},{"n":101,"ar":"سُورَةُ القَارِعَةِ","en":"Al-Qaari'a","a":11},{"n":102,"ar":"سُورَةُ التَّكَاثُرِ","en":"At-Takaathur","a":8},{"n":103,"ar":"سُورَةُ العَصۡرِ","en":"Al-Asr","a":3},{"n":104,"ar":"سُورَةُ الهُمَزَةِ","en":"Al-Humaza","a":9},{"n":105,"ar":"سُورَةُ الفِيلِ","en":"Al-Fil","a":5},{"n":106,"ar":"سُورَةُ قُرَيۡشٍ","en":"Quraish","a":4},{"n":107,"ar":"سُورَةُ المَاعُونِ","en":"Al-Maa'un","a":7},{"n":108,"ar":"سُورَةُ الكَوۡثَرِ","en":"Al-Kawthar","a":3},{"n":109,"ar":"سُورَةُ الكَافِرُونَ","en":"Al-Kaafiroon","a":6},{"n":110,"ar":"سُورَةُ النَّصۡرِ","en":"An-Nasr","a":3},{"n":111,"ar":"سُورَةُ المَسَدِ","en":"Al-Masad","a":5},{"n":112,"ar":"سُورَةُ الإِخۡلَاصِ","en":"Al-Ikhlaas","a":4},{"n":113,"ar":"سُورَةُ الفَلَقِ","en":"Al-Falaq","a":5},{"n":114,"ar":"سُورَةُ النَّاسِ","en":"An-Naas","a":6}];

let QURAN_DATA, state, meta, currentSurah = null, quizMode = "next", currentAudio = null, showMeaning = true;

const AudioFX = {
  ctx:null, enabled:true,
  init(){ if(!this.ctx) this.ctx = new (window.AudioContext||window.webkitAudioContext)(); },
  playCorrect(){
    if(!this.enabled) return; this.init();
    const n=this.ctx.currentTime, o=this.ctx.createOscillator(), g=this.ctx.createGain();
    o.type='sine'; o.frequency.setValueAtTime(523,n); o.frequency.exponentialRampToValueAtTime(880,n+.25);
    g.gain.setValueAtTime(.15,n); g.gain.exponentialRampToValueAtTime(.01,n+.3);
    o.connect(g); g.connect(this.ctx.destination); o.start(n); o.stop(n+.3);
  },
  playWrong(){
    if(!this.enabled) return; this.init();
    const n=this.ctx.currentTime, o=this.ctx.createOscillator(), g=this.ctx.createGain();
    o.type='sawtooth'; o.frequency.setValueAtTime(150,n);
    g.gain.setValueAtTime(.12,n); g.gain.exponentialRampToValueAtTime(.01,n+.2);
    o.connect(g); g.connect(this.ctx.destination); o.start(n); o.stop(n+.2);
  }
};

function loadAll(){
  try { QURAN_DATA = JSON.parse(localStorage.getItem(STORAGE_DATA)) || structuredClone(DEFAULT_QURAN); }
  catch(e){ QURAN_DATA = structuredClone(DEFAULT_QURAN); }
  // Always sync Arabic text + ayah count from embedded defaults (fixes old/wrong cache)
  try {
    const src = (typeof currentScript !== 'undefined' && currentScript === 'uthmani')
      ? DEFAULT_QURAN_UTHMANI : DEFAULT_QURAN_INDOPAK;
    Object.keys(src).forEach(function(id){
      const def = src[id];
      if(!def || !def.ayat) return;
      if(!QURAN_DATA[id]) {
        QURAN_DATA[id] = structuredClone(def);
      } else {
        // preserve progress length; refresh text
        QURAN_DATA[id].nameAr = def.nameAr || QURAN_DATA[id].nameAr;
        QURAN_DATA[id].nameTa = def.nameTa || QURAN_DATA[id].nameTa;
        QURAN_DATA[id].surahNum = def.surahNum;
        QURAN_DATA[id].ayat = def.ayat.map(function(a){ return { ar: a.ar }; });
      }
    });
  } catch(e){}
  try {
    state = JSON.parse(localStorage.getItem(STORAGE_GAME)) || {coins:0, gardens:{}};
  } catch(e){ state = {coins:0, gardens:{}}; }
  Object.keys(QURAN_DATA).forEach(id=>{
    const need = QURAN_DATA[id].ayat.length;
    if(!state.gardens[id]) state.gardens[id] = {planted: Array(need).fill(false)};
    else if(state.gardens[id].planted.length !== need){
      const old = state.gardens[id].planted;
      state.gardens[id].planted = Array.from({length:need}, (_,i)=>!!old[i]);
    }
  });
  try { meta = JSON.parse(localStorage.getItem(STORAGE_META)) || {streak:0,lastPlay:null,dailyCount:0,dailyDate:null,badges:{},sound:true}; }
  catch(e){ meta = {streak:0,lastPlay:null,dailyCount:0,dailyDate:null,badges:{},sound:true}; }
  AudioFX.enabled = meta.sound !== false;
}
function saveData(){ localStorage.setItem(STORAGE_DATA, JSON.stringify(QURAN_DATA)); }
function saveGame(){ localStorage.setItem(STORAGE_GAME, JSON.stringify(state)); }
function saveMeta(){ localStorage.setItem(STORAGE_META, JSON.stringify(meta)); }

function todayStr(){ return new Date().toISOString().slice(0,10); }
function updateStreak(){
  const t = todayStr();
  if(meta.lastPlay === t) return;
  const y = new Date(); y.setDate(y.getDate()-1);
  if(meta.lastPlay === y.toISOString().slice(0,10)) meta.streak = (meta.streak||0)+1;
  else meta.streak = 1;
  meta.lastPlay = t;
  saveMeta();
}
function addDaily(){
  const t = todayStr();
  if(meta.dailyDate !== t){ meta.dailyCount=0; meta.dailyDate=t; }
  meta.dailyCount = (meta.dailyCount||0)+1;
  if(meta.dailyCount === 5){ state.coins += 25; saveGame(); alert("🎯 இன்றைய இலக்கு! +25 coins"); }
  saveMeta();
  updateDailyUI();
}
function updateDailyUI(){
  const c = meta.dailyCount||0;
  document.getElementById('dailyLabel').textContent = c + ' / 5';
  document.getElementById('dailyFill').style.width = Math.min(100, c/5*100) + '%';
}
function updateHeader(){
  document.getElementById('coinCount').textContent = state.coins;
  document.getElementById('streakCount').textContent = meta.streak||0;
  document.getElementById('soundBtn').textContent = meta.sound !== false ? '🔊' : '🔇';
}

function shuffle(a){ const x=a.slice(); for(let i=x.length-1;i>0;i--){const j=Math.floor(Math.random()*(i+1));[x[i],x[j]]=[x[j],x[i]];} return x; }

function switchScreen(id){
  if(id !== 'screenGarden'){ /* keep quiz only on garden if needed */ }
  document.querySelectorAll('.screen').forEach(s=>s.classList.remove('active'));
  const scr = document.getElementById(id);
  if(scr) scr.classList.add('active');
  if(id==='screenBadges') renderBadges();
  if(id==='screenDhikr') initDhikr();
  if(id==='screenDua') initDua();
  if(id==='screenNabiDua') initNabiDua();
  if(id==='screenFinder') initFinder();
  if(id==='screenJuzPlayer') renderJuzList();
  if(id==='screenProfile'){
    renderThemeGrid();
    document.getElementById('pCoins').textContent = state.coins;
    document.getElementById('pStreak').textContent = (meta.streak||0)+' 🔥';
    let done=0;
    Object.keys(QURAN_DATA).forEach(id=>{
      const g=state.gardens[id]; if(g && g.planted.length && g.planted.every(Boolean)) done++;
    });
    document.getElementById('pDone').textContent = done;
  }
}

function surahIdForNum(n){
  if(n===1){
    if(QURAN_DATA.fatiha) return 'fatiha';
  }
  const key = 's'+n;
  if(QURAN_DATA[key]) return key;
  // find by surahNum
  for(const id of Object.keys(QURAN_DATA)){
    if(QURAN_DATA[id].surahNum===n) return id;
  }
  return key;
}


/* ===== Juz filter (Settings + Home) ===== */
const JUZ_FILTER_KEY = 'quran_juz_filter_v1';
let selectedJuz = 0; // 0 = all

// First surah number of each juz (1-indexed array via index j-1)
const JUZ_FIRST_SURAH = [1,2,2,3,4,4,5,6,7,8,9,11,12,15,17,18,21,23,25,27,29,33,36,39,41,46,51,58,67,78];

function getSurahNumsForJuz(j){
  if(!j || j < 1 || j > 30) return null;
  const a = JUZ_FIRST_SURAH[j - 1];
  const b = (j === 30) ? 115 : JUZ_FIRST_SURAH[j];
  const out = [];
  if(a === b || (j < 30 && JUZ_FIRST_SURAH[j] === a)){
    out.push(a);
    // also include following surahs until next juz start differs
    if(j < 30){
      let next = j;
      while(next < 30 && JUZ_FIRST_SURAH[next] === a) next++;
      const end = (next >= 30) ? 115 : JUZ_FIRST_SURAH[next];
      for(let n = a + 1; n < end; n++) out.push(n);
    } else {
      for(let n = a + 1; n <= 114; n++) out.push(n);
    }
  } else {
    for(let n = a; n < b; n++) out.push(n);
  }
  return out;
}

function loadJuzFilter(){
  try {
    const v = parseInt(localStorage.getItem(JUZ_FILTER_KEY) || '0', 10);
    selectedJuz = (v >= 0 && v <= 30) ? v : 0;
  } catch(e){ selectedJuz = 0; }
}

function saveJuzFilter(){
  try { localStorage.setItem(JUZ_FILTER_KEY, String(selectedJuz)); } catch(e){}
}

function juzFilterLabelText(){
  if(!selectedJuz) return 'எல்லா ஜுஸ்வு · 114 சூரா';
  const nums = getSurahNumsForJuz(selectedJuz) || [];
  return 'ஜுஸ்வு ' + selectedJuz + ' · ' + nums.length + ' சூரா (' + (nums[0]||'') + '–' + (nums[nums.length-1]||'') + ')';
}

function setJuzFilter(j){
  selectedJuz = j;
  saveJuzFilter();
  document.querySelectorAll('.juz-chip').forEach(function(c){
    const v = parseInt(c.getAttribute('data-juz') || '0', 10);
    c.classList.toggle('active', v === selectedJuz);
  });
  const lab = document.getElementById('juzFilterLabel');
  if(lab) lab.textContent = juzFilterLabelText();
  if(typeof renderPlotsGrid === 'function') renderPlotsGrid();
}

function buildJuzChips(container, compact){
  if(!container) return;
  container.innerHTML = '';
  const all = document.createElement('button');
  all.type = 'button';
  all.className = 'juz-chip juz-chip-all' + (selectedJuz === 0 ? ' active' : '');
  all.setAttribute('data-juz', '0');
  all.textContent = compact ? 'எல்லாம்' : 'எல்லா ஜுஸ்வு';
  all.onclick = function(){ setJuzFilter(0); };
  container.appendChild(all);
  const max = compact ? 30 : 30;
  for(let j = 1; j <= max; j++){
    const b = document.createElement('button');
    b.type = 'button';
    b.className = 'juz-chip' + (selectedJuz === j ? ' active' : '');
    b.setAttribute('data-juz', String(j));
    b.textContent = compact ? String(j) : ('ஜுஸ் ' + j);
    if(j === 30) b.title = 'Juz Amma';
    b.onclick = function(){ setJuzFilter(j); };
    container.appendChild(b);
  }
}

function initJuzFilterUI(){
  loadJuzFilter();
  buildJuzChips(document.getElementById('juzFilterGrid'), false);
  buildJuzChips(document.getElementById('homeJuzBar'), true);
  const lab = document.getElementById('juzFilterLabel');
  if(lab) lab.textContent = juzFilterLabelText();
}


function renderPlotsGrid(){
  const grid = document.getElementById('plotsGrid');
  const q = (document.getElementById('surahSearchInput').value||'').trim().toLowerCase();
  const juzNums = getSurahNumsForJuz(selectedJuz);
  let list = SURAH_META.filter(m=>{
    if(juzNums && juzNums.indexOf(m.n) === -1) return false;
    if(!q) return true;
    return (m.en||'').toLowerCase().includes(q) || (m.ar||'').includes(q) || String(m.n).includes(q);
  });
  let currentId = null;
  for(const m of list){
    const id = surahIdForNum(m.n);
    const s = QURAN_DATA[id];
    if(!s || !s.ayat || !s.ayat.length){ if(!currentId) currentId = id; continue; }
    const g = state.gardens[id]||{planted:[]};
    const total = s.ayat.length;
    if(g.planted.filter(Boolean).length < total){ currentId = id; break; }
  }
  let totalStars=0, maxStars=list.length*3;
  let h = '<div class="level-map-title">🌳 குர்ஆன் தோட்டம் · '+(selectedJuz?('ஜுஸ்வு '+selectedJuz):'114 சூரா')+'</div><div class="level-grid">';
  list.forEach(m=>{
    const id = surahIdForNum(m.n);
    const surah = QURAN_DATA[id];
    const hasData = !!(surah && surah.ayat && surah.ayat.length);
    const g = state.gardens[id]||{planted:[]};
    const total = hasData ? surah.ayat.length : (m.a||0);
    const P = hasData ? g.planted.filter(Boolean).length : 0;
    const done = hasData && total>0 && P>=total;
    const started = P>0;
    const isCurrent = id===currentId;
    let stars = done ? 3 : (P>0 ? Math.max(1, Math.round(P/total*3)) : 0);
    totalStars += stars;
    let cls = 'level-tile';
    if(done) cls += ' done';
    else if(isCurrent) cls += ' current';
    else if(started) cls += ' progress';
    else if(!hasData) cls += ' locked';
    else cls += ' locked';
    const num = m.n;
    const shortName = (m.en||'').slice(0,10);
    let starsHtml = '';
    for(let s=1;s<=3;s++) starsHtml += s<=stars ? '⭐' : '☆';
    const badge = (isCurrent && !started) ? '<span class="level-new-badge">NEW!</span>' : '';
    const inner = (!hasData) ? '<span class="level-num">'+num+'</span>' : ((!started && !isCurrent) ? '<span class="level-lock">🔒</span>' : '<span class="level-num">'+num+'</span>');
    h += '<div class="'+cls+'" onclick="openGardenByNum('+m.n+')">'+badge+inner+'<div class="level-stars">'+starsHtml+'</div><div class="level-name">'+shortName+'</div></div>';
  });
  h += '</div><div class="level-progress-bar">⭐ '+totalStars+'/'+maxStars+'</div>';
  grid.innerHTML = h;
  updateHeader();
}

function stripBismillah(text, surahNum){
  if(!text) return '';
  var t = String(text).replace(/^\uFEFF/,'').trim();
  if(surahNum === 1 || surahNum === 9) return t;
  // Multiple Bismillah orthographies (Uthmani + IndoPak)
  t = t.replace(/^بِّ?سۡ?مِ[\s\u00A0]*ٱ?للَّ?هِ[\s\u00A0]*ٱ?لرَّحۡ?مَ[ـ\u0650]*ٰ?نِ[\s\u00A0]*ٱ?لرَّحِ[يىی]مِ[\s\u00A0]*/u, '');
  t = t.replace(/^بِسْمِ[\s\u00A0]+اللَّهِ[\s\u00A0]+الرَّحْمَٰنِ[\s\u00A0]+الرَّحِيمِ[\s\u00A0]*/u, '');
  t = t.replace(/^بسم الله الرحمن الرحيم[\s\u00A0]*/u, '');
  return t.trim();
}

async function ensureSurahLoaded(n){
  const id = surahIdForNum(n);
  if(QURAN_DATA[id] && QURAN_DATA[id].ayat && QURAN_DATA[id].ayat.length) return id;
  const meta = SURAH_META.find(m=>m.n===n);
  const endpoint = currentScript === 'uthmani'
    ? 'https://api.quran.com/api/v4/quran/verses/uthmani?chapter_number='+n
    : 'https://api.quran.com/api/v4/quran/verses/indopak?chapter_number='+n;
  const field = currentScript === 'uthmani' ? 'text_uthmani' : 'text_indopak';
  try {
    const [arRes, taRes] = await Promise.all([
      fetch(endpoint),
      fetch('https://api.alquran.cloud/v1/surah/'+n+'/ar.muyassar').catch(function(){return null}).then(function(){return {json:function(){return Promise.resolve({code:200,data:{ayahs:[]}})}}})
    ]);
    if(!arRes.ok) throw new Error('fail');
    const arData = await arRes.json();
    const verses = arData.verses || [];
    if(!verses.length) throw new Error('empty');
    let taList = [];
    if(taRes.ok){
      const taData = await taRes.json();
      taList = (taData.data && taData.data.ayahs || []).map(a=>a.text);
    }
    const ayat = verses.map((v,i)=>({
      ar: String(v[field]||'').replace(/^\uFEFF/,'').trim(),
      ta: taList[i]||''
    }));
    const newId = (n===1 && !QURAN_DATA.fatiha) ? 'fatiha' : 's'+n;
    QURAN_DATA[newId] = {
      nameAr: (meta&&meta.ar) || '',
      nameTa: n+'. '+((meta&&meta.en)||''),
      surahNum: n,
      ayat
    };
    if(!state.gardens[newId] || state.gardens[newId].planted.length !== ayat.length){
      state.gardens[newId] = {planted: Array(ayat.length).fill(false)};
    }
    saveData(); saveGame();
    return newId;
  } catch(e){
    alert('சூரா ஏற்ற முடியவில்லை. Internet தேவை.');
    return null;
  }
}

async function openGardenByNum(n){
  const loading = document.createElement('div');
  loading.id = 'surahLoadToast';
  loading.style.cssText = 'position:fixed;bottom:20px;left:50%;transform:translateX(-50%);background:#1a2340;border:1px solid var(--glass-border);padding:10px 18px;border-radius:12px;z-index:999;font-size:13px;font-weight:700';
  loading.textContent = '⏳ சூரா '+n+' ஏற்றுகிறது...';
  document.body.appendChild(loading);
  const id = await ensureSurahLoaded(n);
  loading.remove();
  if(!id) return;
  openGarden(id);
}


function closeAllOverlays(){
  try{
    document.querySelectorAll('.overlay.active').forEach(function(el){ el.classList.remove('active'); });
    const mo = document.getElementById('menuOverlay');
    const sm = document.getElementById('sideMenu');
    if(mo) mo.classList.remove('open');
    if(sm) sm.classList.remove('open');
    if(currentAudio){ try{ currentAudio.pause(); }catch(e){} currentAudio=null; }
  }catch(e){}
}

function openGarden(id){
  closeAllOverlays();
  currentSurah = id;
  const s = QURAN_DATA[id];
  if(!s) return;
  window.__dotsPage = 0;
  document.getElementById('gardenNameAr').textContent = s.nameAr;
  document.getElementById('gardenNameTa').textContent = s.nameTa;
  renderTree(); renderDots(); updateDailyUI();
  switchScreen('screenGarden');
  try{ window.scrollTo(0,0); document.getElementById('screenGarden').scrollTop = 0; }catch(e){}
}

function renderTree(){
  const surah = QURAN_DATA[currentSurah], g = state.gardens[currentSurah];
  const N = surah.ayat.length, P = g.planted.filter(Boolean).length;
  const pct = N > 0 ? Math.round(P / N * 100) : 0;
  const circumference = 2 * Math.PI * 50; // r=50
  const offset = circumference - (pct / 100) * circumference;
  const ring = document.getElementById('spRingFg');
  if(ring){
    ring.style.strokeDasharray = circumference;
    ring.style.strokeDashoffset = offset;
    ring.classList.toggle('done', P >= N && N > 0);
  }
  const pctEl = document.getElementById('spPct');
  if(pctEl) pctEl.textContent = pct + '%';
  let stars = 0;
  if(P >= N && N > 0) stars = 3;
  else if(P > 0) stars = Math.max(1, Math.round(P / N * 3));
  const starsEl = document.getElementById('spStars');
  if(starsEl){
    let h = '';
    for(let i = 1; i <= 3; i++) h += i <= stars ? '⭐' : '☆';
    starsEl.textContent = h;
  }
  const countEl = document.getElementById('spCount');
  if(countEl) countEl.textContent = P + ' / ' + N + ' ஆயத்துகள்';
  const progressLabel = document.getElementById('progressLabel');
  if(progressLabel) progressLabel.textContent = P + ' / ' + N + ' ஆயத்துகள்';
  document.getElementById('completeBanner').classList.toggle('show', P >= N && N > 0);
}
function renderDots(){
  const surah = QURAN_DATA[currentSurah], g = state.gardens[currentSurah];
  const wrap = document.getElementById('ayahDots');
  if(!wrap || !surah || !g) return;
  wrap.innerHTML = '';
  const total = surah.ayat.length;
  const PAGE = 40;
  let page = window.__dotsPage || 0;
  const maxPage = Math.max(0, Math.ceil(total / PAGE) - 1);
  if(page > maxPage) page = maxPage;
  window.__dotsPage = page;
  const start = page * PAGE;
  const end = Math.min(total, start + PAGE);

  // nav for large surahs
  if(total > PAGE){
    const nav = document.createElement('div');
    nav.style.cssText = 'width:100%;display:flex;justify-content:center;align-items:center;gap:10px;margin:6px 0 10px;flex-wrap:wrap';
    const prev = document.createElement('button');
    prev.type = 'button';
    prev.className = 'mode-btn';
    prev.textContent = '◀ முன்';
    prev.disabled = page <= 0;
    prev.onclick = function(){ window.__dotsPage = page - 1; renderDots(); try{wrap.scrollIntoView({behavior:'smooth',block:'start'});}catch(e){} };
    const info = document.createElement('span');
    info.style.cssText = 'font-size:12px;font-weight:700;color:var(--text-dim)';
    info.textContent = (start+1) + '–' + end + ' / ' + total;
    const next = document.createElement('button');
    next.type = 'button';
    next.className = 'mode-btn';
    next.textContent = 'பின் ▶';
    next.disabled = page >= maxPage;
    next.onclick = function(){ window.__dotsPage = page + 1; renderDots(); try{wrap.scrollIntoView({behavior:'smooth',block:'start'});}catch(e){} };
    nav.appendChild(prev); nav.appendChild(info); nav.appendChild(next);
    wrap.appendChild(nav);
  }

  for(let i = start; i < end; i++){
    const d = document.createElement('button');
    d.type = 'button';
    d.className = 'ayah-dot' + (g.planted[i] ? ' done' : '');
    d.textContent = g.planted[i] ? '✓' : String(i+1);
    d.setAttribute('aria-label', 'Ayah '+(i+1));
    (function(idx){
      d.onclick = function(){ if(!g.planted[idx]) openQuiz(idx); };
    })(i);
    wrap.appendChild(d);
  }
}

function openQuiz(index){
  stopContinuous();
  window.__qi = index;
  const surah = QURAN_DATA[currentSurah];
  const correct = surah.ayat[index];
  const label = document.getElementById('quizLabel');
  const ctx = document.getElementById('contextAyah');
  const opts = document.getElementById('optionsWrap');
  const audioWrap = document.getElementById('audioWrap');
  opts.innerHTML = ''; audioWrap.innerHTML = '';

  if(surah.surahNum){
    const ab = document.createElement('button');
    ab.className = 'audio-btn';
    ab.textContent = '🔊 ஆயத்து கேளுங்கள்';
    ab.onclick = function(){ playAudio(surah.surahNum, index+1, ab); };
    audioWrap.appendChild(ab);
  }

  if(quizMode === 'next'){
    label.textContent = 'அடுத்த ஆயத்தைத் தேர்ந்தெடுக்கவும் · ஆயத்து '+(index+1);
    if(index === 0){
      // First ayah of surah — show surah name + ask for ayah 1
      setContextText(ctx, (surah.nameAr||'') + ' — ஆயத்து ১ ؟', null, surah.surahNum, 1);
    } else {
      // Context = previous ayah (1-based number = index)
      setContextText(ctx, surah.ayat[index-1].ar, surah.ayat[index-1].ta || null, surah.surahNum, index);
    }
    buildOptions(correct, opts, function(){ onCorrect(index); });
  } else if(quizMode === 'blank'){
    label.textContent = 'காலியிடத்தை நிரப்புங்கள்';
    const words = correct.ar.split(/\s+/).filter(Boolean);
    if(words.length < 2){
      setContextText(ctx, correct.ar, null, surah.surahNum, index+1);
      buildOptions(correct, opts, function(){ onCorrect(index); });
    } else {
      const hi = Math.floor(Math.random() * words.length);
      const blank = words[hi];
      setContextText(ctx, words.map(function(w,i){ return i===hi ? '______' : w; }).join(' '), null);
      let pool = [];
      Object.values(QURAN_DATA).forEach(s=> s.ayat.forEach(a=> a.ar.split(/\s+/).forEach(w=>{ if(w && w!==blank) pool.push(w); })));
      pool = shuffle(pool).slice(0,3);
      const choices = shuffle([blank].concat(pool));
      choices.forEach(ch=>{
        const b = document.createElement('button');
        b.className = 'opt-btn';
        b.textContent = ch;
        b.onclick = function(){
          if(ch === blank){ b.classList.add('correct'); AudioFX.playCorrect(); setTimeout(function(){ onCorrect(index); }, 350); }
          else { b.classList.add('wrong'); AudioFX.playWrong(); }
        };
        opts.appendChild(b);
      });
    }
  } else {
    label.textContent = 'பொருளுக்கு ஏற்ற ஆயத்தைத் தேர்ந்தெடுக்கவும்';
    ctx.textContent = '';
    const t = document.createElement('div');
    t.style.cssText = 'font-family:var(--font-ui);font-size:15px;direction:ltr;text-align:left;color:#fff';
    t.textContent = correct.ta || '(பொருள் இல்லை)';
    ctx.appendChild(t);
    buildOptions(correct, opts, function(){ onCorrect(index); });
  }
  document.getElementById('quizOverlay').classList.add('active');
}

function buildOptions(correct, wrap, onOk){
  let samePool = [], otherPool = [];
  const cur = QURAN_DATA[currentSurah];
  if(cur) cur.ayat.forEach(a=>{ if(a.ar !== correct.ar) samePool.push(a); });
  Object.keys(QURAN_DATA).forEach(id=>{
    if(id === currentSurah) return;
    QURAN_DATA[id].ayat.forEach(a=>{ if(a.ar !== correct.ar) otherPool.push(a); });
  });
  samePool = shuffle(samePool);
  otherPool = shuffle(otherPool);
  let pool = samePool.slice(0,3);
  if(pool.length < 3) pool = pool.concat(otherPool.slice(0, 3-pool.length));
  const options = shuffle([correct].concat(pool.slice(0,3)));
  wrap.innerHTML = '';
  options.forEach(opt=>{
    const b = document.createElement('button');
    b.className = 'opt-btn';
    // Options always plain Unicode (no spans) for correct joining + no QCF codes
    b.textContent = opt.ar;
    if(showMeaning && opt.ta){
      const m = document.createElement('div');
      m.className = 'ta-meaning';
      m.textContent = opt.ta;
      b.appendChild(m);
    }
    b.onclick = function(){
      if(opt.ar === correct.ar){ b.classList.add('correct'); AudioFX.playCorrect(); setTimeout(onOk, 350); }
      else { b.classList.add('wrong'); AudioFX.playWrong(); }
    };
    wrap.appendChild(b);
  });
}

function onCorrect(index){
  state.gardens[currentSurah].planted[index] = true;
  state.coins += 10;
  updateStreak(); addDaily(); saveGame();
  document.getElementById('quizOverlay').classList.remove('active');
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
  renderTree(); renderDots(); updateHeader();
}

function playAudio(surahNum, ayahNum, btn){
  stopContinuous();
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
  const s = String(surahNum).padStart(3,'0');
  const a = String(ayahNum).padStart(3,'0');
  const url = 'https://everyayah.com/data/Alafasy_128kbps/'+s+a+'.mp3';
  const audio = new Audio(url);
  currentAudio = audio;
  btn.textContent = '⏸ நிறுத்து';
  audio.play().catch(function(){ alert('Audio load ஆகலை (Internet தேவை)'); btn.textContent='🔊 ஆயத்து கேளுங்கள்'; });
  audio.onended = function(){ btn.textContent='🔊 ஆயத்து கேளுங்கள்'; currentAudio=null; };
  btn.onclick = function(){
    if(currentAudio){ currentAudio.pause(); currentAudio=null; btn.textContent='🔊 ஆயத்து கேளுங்கள்';
      btn.onclick = function(){ playAudio(surahNum, ayahNum, btn); };
    }
  };
}

/* ===== Continuous / Juz-wise Audio Player (all 30 Juz) ===== */
let contQueue = [];
let contIndex = 0;
let contPlaying = false;
let contPaused = false;
let contActiveSurahId = null;
let contActiveAyat = null; // [{ar,ta,ayahNum}] for current playing surah
let currentJuzView = null; // null = juz list, number = surah list of that juz
let JUZ_CACHE = {}; // juzNum -> {surahs: [{id, surahNum, nameAr, nameEn, nameTa, ayat:[{ar,ta}]}]}

function buildSurahQueueFromObj(s){
  if(!s || !s.surahNum) return [];
  return s.ayat.map((a,i)=>({id:s.id||('s'+s.surahNum), surahNum:s.surahNum, ayahNum:i+1, nameTa:s.nameTa||s.nameEn||'', nameAr:s.nameAr||'', ar:a.ar, ta:a.ta||''}));
}

function buildSurahQueue(surahId){
  const s = QURAN_DATA[surahId];
  if(!s || !s.surahNum) return [];
  return s.ayat.map((a,i)=>({id:surahId, surahNum:s.surahNum, ayahNum:i+1, nameTa:s.nameTa, nameAr:s.nameAr, ar:a.ar, ta:a.ta||''}));
}

function stopContinuous(){
  contPlaying = false;
  contPaused = false;
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
  const playBtn = document.getElementById('juzPlayBtn');
  if(playBtn) playBtn.textContent = '▶ இயக்கு';
  const surahBtn = document.getElementById('playSurahAllBtn');
  if(surahBtn) surahBtn.textContent = '🔊 சூரா முழுவதும் கேளுங்கள்';
  document.querySelectorAll('.juz-surah-card').forEach(el=>el.classList.remove('playing'));
}

function renderAyahPanel(){
  const panel = document.getElementById('juzAyahPanel');
  if(!panel) return;
  if(!contQueue.length || !contActiveAyat){
    panel.classList.remove('show');
    panel.innerHTML = '';
    panel.dataset.sid = '';
    return;
  }
  panel.classList.add('show');
  const sid = contActiveSurahId || '';
  if(panel.dataset.sid !== sid){
    panel.dataset.sid = sid;
    panel.innerHTML = '';
    contActiveAyat.forEach((a,i)=>{
      const row = document.createElement('div');
      row.className = 'juz-ayah-row';
      const arHtml = tajweedOn ? tajweedify(a.ar||'') : (a.ar||'');
      row.innerHTML =
        '<div class="juz-ayah-num">ஆயத்து '+(i+1)+'</div>'+
        '<div class="juz-ayah-ar">'+arHtml+'</div>'+
        (a.ta ? '<div class="juz-ayah-ta">'+a.ta+'</div>' : '');
      row.onclick = function(){ playContinuousAt(i); };
      panel.appendChild(row);
    });
  }
  panel.querySelectorAll('.juz-ayah-row').forEach((row,i)=>{
    row.classList.toggle('active', i === contIndex);
  });
  const active = panel.querySelector('.juz-ayah-row.active');
  if(active) active.scrollIntoView({block:'nearest', behavior:'smooth'});
}

function updateJuzUI(){
  const now = document.getElementById('juzNowPlaying');
  const fill = document.getElementById('juzProgressFill');
  const info = document.getElementById('juzTrackInfo');
  const bar = document.getElementById('juzPlayerBar');
  if(contQueue.length && bar) bar.style.display = '';
  if(!contQueue.length){
    if(now) now.textContent = 'சூராவைத் தொட்டுக் கேளுங்கள்';
    if(fill) fill.style.width = '0%';
    if(info) info.textContent = '—';
    renderAyahPanel();
    return;
  }
  const cur = contQueue[contIndex] || contQueue[0];
  if(now) now.textContent = (cur.nameTa||cur.nameAr||'') + ' · ஆயத்து ' + cur.ayahNum;
  if(fill) fill.style.width = ((contIndex+1)/contQueue.length*100) + '%';
  if(info) info.textContent = 'ஆயத்து ' + (contIndex+1) + ' / ' + contQueue.length;
  document.querySelectorAll('.juz-surah-card').forEach(el=>{
    el.classList.toggle('playing', el.dataset.sid === contActiveSurahId && contPlaying);
  });
  renderAyahPanel();
}

function playContinuousAt(idx){
  if(!contQueue.length) return;
  contIndex = Math.max(0, Math.min(idx, contQueue.length-1));
  contPlaying = true;
  contPaused = false;
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
  const item = contQueue[contIndex];
  contActiveSurahId = item.id;
  const s = String(item.surahNum).padStart(3,'0');
  const a = String(item.ayahNum).padStart(3,'0');
  const url = 'https://everyayah.com/data/Alafasy_128kbps/'+s+a+'.mp3';
  const audio = new Audio(url);
  currentAudio = audio;
  updateJuzUI();
  const playBtn = document.getElementById('juzPlayBtn');
  if(playBtn) playBtn.textContent = '⏸ இடைநிறுத்து';
  const surahBtn = document.getElementById('playSurahAllBtn');
  if(surahBtn && currentSurah && contQueue[0] && contQueue[0].id===currentSurah){
    surahBtn.textContent = '⏸ நிறுத்து';
  }
  audio.play().catch(function(){
    alert('Audio load ஆகலை (Internet தேவை)');
    stopContinuous();
    updateJuzUI();
  });
  audio.onended = function(){
    if(!contPlaying) return;
    if(contIndex < contQueue.length-1){
      playContinuousAt(contIndex+1);
    } else {
      stopContinuous();
      updateJuzUI();
      if(document.getElementById('juzNowPlaying')) document.getElementById('juzNowPlaying').textContent = '✅ '+(item.nameTa||'')+' முடிந்தது';
    }
  };
}

function toggleContinuousPlay(){
  if(!contQueue.length) return;
  if(contPlaying && !contPaused){
    if(currentAudio) currentAudio.pause();
    contPaused = true;
    contPlaying = false;
    const playBtn = document.getElementById('juzPlayBtn');
    if(playBtn) playBtn.textContent = '▶ தொடர்';
    document.querySelectorAll('.juz-surah-card').forEach(el=>el.classList.remove('playing'));
  } else if(contPaused && currentAudio){
    currentAudio.play();
    contPaused = false;
    contPlaying = true;
    const playBtn = document.getElementById('juzPlayBtn');
    if(playBtn) playBtn.textContent = '⏸ இடைநிறுத்து';
    updateJuzUI();
  } else {
    playContinuousAt(contIndex);
  }
}

function playSurahFromJuzObj(s){
  stopContinuous();
  contQueue = buildSurahQueueFromObj(s);
  contIndex = 0;
  contActiveSurahId = s.id || ('s'+s.surahNum);
  contActiveAyat = s.ayat.map((a,i)=>({ar:a.ar, ta:a.ta||'', ayahNum:i+1}));
  if(!contQueue.length){ alert('Audio இல்லை'); return; }
  const bar = document.getElementById('juzPlayerBar');
  if(bar) bar.style.display = '';
  playContinuousAt(0);
}

function playSurahFromJuz(surahId){
  const s = QURAN_DATA[surahId];
  if(!s) return;
  playSurahFromJuzObj({id:surahId, surahNum:s.surahNum, nameAr:s.nameAr, nameTa:s.nameTa, ayat:s.ayat});
}

async function fetchJuzData(juzNum){
  var cacheKey = juzNum + '_' + (typeof currentScript !== 'undefined' ? currentScript : 'indopak');
  if(JUZ_CACHE[cacheKey]) return JUZ_CACHE[cacheKey];

  // Prefer local QURAN_DATA for any juz when we already have those surahs loaded
  var localSurahs = [];
  try {
    var nums = (typeof getSurahNumsForJuz === 'function') ? getSurahNumsForJuz(juzNum) : null;
    if(nums && nums.length && typeof SURAH_META !== 'undefined'){
      var allLocal = true;
      var built = [];
      for(var i=0;i<nums.length;i++){
        var n = nums[i];
        var id = (typeof surahIdForNum === 'function') ? surahIdForNum(n) : ('s'+n);
        var s = QURAN_DATA[id];
        if(!s || !s.ayat || !s.ayat.length){ allLocal = false; break; }
        built.push({
          id: id,
          surahNum: s.surahNum || n,
          nameAr: s.nameAr || '',
          nameEn: '',
          nameTa: s.nameTa || (n+''),
          ayat: s.ayat.map(function(a){ return {ar: a.ar||'', ta: a.ta||''}; })
        });
      }
      if(allLocal && built.length){
        JUZ_CACHE[cacheKey] = {surahs: built};
        return JUZ_CACHE[cacheKey];
      }
    }
  } catch(e){}

  // Fetch correct script from Quran.com API (by juz)
  var isUth = (typeof currentScript !== 'undefined' && currentScript === 'uthmani');
  var edition = isUth ? 'uthmani' : 'indopak';
  var field = isUth ? 'text_uthmani' : 'text_indopak';
  var url = 'https://api.quran.com/api/v4/quran/verses/' + edition + '?juz_number=' + juzNum;

  try {
    var arRes = await fetch(url);
    if(!arRes.ok) throw new Error('API ' + arRes.status);
    var arData = await arRes.json();
    var verses = arData.verses || [];
    if(!verses.length) throw new Error('empty juz');

    // verse_key like "78:1"
    var bySurah = {};
    verses.forEach(function(v){
      var key = String(v.verse_key || '');
      var parts = key.split(':');
      var sn = parseInt(parts[0], 10);
      var an = parseInt(parts[1], 10);
      if(!sn) return;
      if(!bySurah[sn]){
        var meta = (typeof SURAH_META !== 'undefined') ? SURAH_META.find(function(m){ return m.n === sn; }) : null;
        bySurah[sn] = {
          id: (sn === 1 ? 'fatiha' : 's'+sn),
          surahNum: sn,
          nameAr: (meta && meta.ar) || '',
          nameEn: (meta && meta.en) || '',
          nameTa: sn + '. ' + ((meta && meta.en) || ''),
          ayat: []
        };
      }
      var raw = String(v[field] || v.text_uthmani || v.text_indopak || '').replace(/^\uFEFF/,'').trim();
      // First ayah of surah: strip bismillah except Fatiha & Tawbah
      if(an === 1){
        raw = stripBismillah(raw, sn);
      }
      bySurah[sn].ayat.push({ar: raw, ta: ''});
    });

    var surahs = Object.keys(bySurah).map(Number).sort(function(a,b){ return a-b; }).map(function(n){ return bySurah[n]; });
    // Note: Juz may contain PARTIAL surahs — do not overwrite full garden data with partial slices.
    // Only fill QURAN_DATA when we clearly have a complete surah (matches SURAH_META ayah count).
    surahs.forEach(function(s){
      var meta = (typeof SURAH_META !== 'undefined') ? SURAH_META.find(function(m){ return m.n === s.surahNum; }) : null;
      var expected = meta && meta.a ? meta.a : 0;
      var complete = expected > 0 && s.ayat.length === expected;
      if(complete){
        if(!QURAN_DATA[s.id] || !QURAN_DATA[s.id].ayat || QURAN_DATA[s.id].ayat.length !== expected){
          QURAN_DATA[s.id] = {
            nameAr: s.nameAr,
            nameTa: s.nameTa,
            surahNum: s.surahNum,
            ayat: s.ayat.slice()
          };
          if(!state.gardens[s.id] || state.gardens[s.id].planted.length !== expected){
            state.gardens[s.id] = {planted: Array(expected).fill(false)};
          }
        } else {
          for(var i=0;i<s.ayat.length;i++){
            QURAN_DATA[s.id].ayat[i].ar = s.ayat[i].ar;
          }
        }
        try{ saveData(); saveGame(); }catch(e){}
      }
    });

    JUZ_CACHE[cacheKey] = {surahs: surahs};
    return JUZ_CACHE[cacheKey];
  } catch(err){
    console.warn('Juz fetch failed, trying chapter-by-chapter', err);
    // Fallback: load each surah via ensureSurahLoaded
    var nums2 = (typeof getSurahNumsForJuz === 'function') ? getSurahNumsForJuz(juzNum) : null;
    if(!nums2 || !nums2.length) throw err;
    var built2 = [];
    for(var j=0;j<nums2.length;j++){
      var nn = nums2[j];
      var id2 = null;
      if(typeof ensureSurahLoaded === 'function'){
        id2 = await ensureSurahLoaded(nn);
      }
      if(!id2) id2 = (typeof surahIdForNum === 'function') ? surahIdForNum(nn) : ('s'+nn);
      var ss = QURAN_DATA[id2];
      if(ss && ss.ayat && ss.ayat.length){
        built2.push({
          id: id2,
          surahNum: ss.surahNum || nn,
          nameAr: ss.nameAr || '',
          nameEn: '',
          nameTa: ss.nameTa || '',
          ayat: ss.ayat.map(function(a){ return {ar: a.ar||'', ta: a.ta||''}; })
        });
      }
    }
    if(!built2.length) throw err;
    JUZ_CACHE[cacheKey] = {surahs: built2};
    return JUZ_CACHE[cacheKey];
  }
}

function showJuzNumberGrid(){
  currentJuzView = null;
  stopContinuous();
  contQueue = [];
  contActiveAyat = null;
  contActiveSurahId = null;
  document.getElementById('juzScreenTitle').textContent = '🎧 30 ஜுஸ்வு · ஆடியோ';
  document.getElementById('juzSurahListTitle').textContent = 'ஜுஸைத் தேர்ந்தெடுக்கவும் (1-30)';
  document.getElementById('juzPlayerBar').style.display = 'none';
  document.getElementById('juzAyahPanel').classList.remove('show');
  document.getElementById('juzAyahPanel').innerHTML = '';
  document.getElementById('juzSurahGrid').style.display = 'none';
  document.getElementById('juzSurahGrid').innerHTML = '';
  document.getElementById('juzLoading').style.display = 'none';
  const grid = document.getElementById('juzNumGrid');
  grid.style.display = 'grid';
  grid.innerHTML = '';
  for(let j=1;j<=30;j++){
    const card = document.createElement('div');
    card.className = 'juz-num-card' + (j===30?' local':'');
    card.innerHTML = '<div class="jn">'+j+'</div><div class="jl">'+(j===30?'ஜுஸ்வு அம்மா · உள்ளூர்':'ஜுஸ்வு '+j)+'</div>';
    card.onclick = function(){ openJuzSurahs(j); };
    grid.appendChild(card);
  }
}

async function openJuzSurahs(juzNum){
  currentJuzView = juzNum;
  stopContinuous();
  contQueue = [];
  contActiveAyat = null;
  document.getElementById('juzBackBtn').textContent = '⬅ ஜுஸ்வு லிஸ்ட்';
  document.getElementById('juzNumGrid').style.display = 'none';
  document.getElementById('juzSurahGrid').style.display = 'grid';
  document.getElementById('juzSurahGrid').innerHTML = '';
  document.getElementById('juzPlayerBar').style.display = 'none';
  document.getElementById('juzAyahPanel').classList.remove('show');
  document.getElementById('juzScreenTitle').textContent = '🎧 ஜுஸ்வு '+juzNum;
  document.getElementById('juzSurahListTitle').textContent = 'ஜுஸ்வு '+juzNum+' · சூராக்கள்';
  document.getElementById('juzLoading').style.display = 'block';
  try {
    const data = await fetchJuzData(juzNum);
    document.getElementById('juzLoading').style.display = 'none';
    const grid = document.getElementById('juzSurahGrid');
    data.surahs.forEach(s=>{
      const card = document.createElement('div');
      card.className = 'juz-surah-card';
      card.dataset.sid = s.id;
      card.innerHTML =
        '<div class="juz-surah-num">'+s.surahNum+'</div>'+
        '<div class="juz-surah-info">'+
          '<div class="juz-surah-name-ar">'+(s.nameAr||'')+'</div>'+
          '<div class="juz-surah-name-ta">'+(s.nameTa||s.nameEn||'')+' · '+s.ayat.length+' ஆயத்து</div>'+
        '</div>'+
        '<div class="juz-surah-play-icon">▶</div>';
      card.onclick = function(){
        if(contActiveSurahId === s.id && contPlaying){
          stopContinuous();
          updateJuzUI();
        } else {
          playSurahFromJuzObj(s);
        }
      };
      grid.appendChild(card);
    });
  } catch(e){
    document.getElementById('juzLoading').style.display = 'none';
    alert('ஜுஸ்வு ஏற்ற முடியவில்லை. Internet இணைப்பைச் சரிபார்க்கவும்.');
    showJuzNumberGrid();
  }
}

function renderJuzList(){
  showJuzNumberGrid();
}

const BADGES = [
  {id:'first', name:'முதல் விதை', icon:'🌱', check:s=>Object.values(s.gardens).some(g=>g.planted.some(Boolean))},
  {id:'tree', name:'முதல் மரம்', icon:'🌳', check:s=>Object.keys(QURAN_DATA).some(id=>{const g=s.gardens[id]; return g&&g.planted.length&&g.planted.every(Boolean);})},
  {id:'c50', name:'50 Coins', icon:'🪙', check:s=>s.coins>=50},
  {id:'c200', name:'200 Coins', icon:'💰', check:s=>s.coins>=200},
  {id:'st3', name:'3 Day Streak', icon:'🔥', check:()=>(meta.streak||0)>=3},
  {id:'st7', name:'7 Day Streak', icon:'⚡', check:()=>(meta.streak||0)>=7},
];
function renderBadges(){
  const grid = document.getElementById('badgeGrid');
  grid.innerHTML = '';
  BADGES.forEach(b=>{
    const ok = b.check(state);
    if(ok && !meta.badges[b.id]){ meta.badges[b.id]=true; saveMeta(); }
    const el = document.createElement('div');
    el.className = 'badge-card' + (ok?'':' locked');
    el.innerHTML = '<div class="badge-icon">'+b.icon+'</div><div class="badge-name">'+b.name+'</div>';
    grid.appendChild(el);
  });
}

function openSideMenu(){
  document.getElementById('sideMenu').classList.add('open');
  document.getElementById('menuOverlay').classList.add('open');
  document.getElementById('sideCoins').textContent = state.coins;
  document.getElementById('sideStreak').textContent = meta.streak||0;
  document.body.style.overflow = 'hidden';
}
function closeSideMenu(){
  document.getElementById('sideMenu').classList.remove('open');
  document.getElementById('menuOverlay').classList.remove('open');
  document.body.style.overflow = '';
}

// Events
document.getElementById('openMenuBtn').onclick = openSideMenu;
document.getElementById('closeMenuBtn').onclick = closeSideMenu;
document.getElementById('menuOverlay').onclick = closeSideMenu;
/* ===== திக்ர் ===== */

/* ===== Dhikr sound effects ===== */
const DhikrSFX = {
  enabled: true,
  _ctx: null,
  init: function(){
    if(!this._ctx){
      try{ this._ctx = new (window.AudioContext||window.webkitAudioContext)(); }catch(e){}
    }
    if(this._ctx && this._ctx.state === 'suspended') this._ctx.resume();
  },
  _tone: function(freq, dur, type, vol, slide){
    if(!this.enabled) return;
    if(typeof AudioFX !== 'undefined' && AudioFX.enabled === false) return;
    try{
      this.init();
      if(!this._ctx) return;
      const t = this._ctx.currentTime;
      const o = this._ctx.createOscillator();
      const g = this._ctx.createGain();
      o.type = type || 'sine';
      o.frequency.setValueAtTime(freq, t);
      if(slide) o.frequency.exponentialRampToValueAtTime(Math.max(80, slide), t + dur);
      g.gain.setValueAtTime(vol || 0.08, t);
      g.gain.exponentialRampToValueAtTime(0.001, t + dur);
      o.connect(g); g.connect(this._ctx.destination);
      o.start(t); o.stop(t + dur + 0.02);
    }catch(e){}
  },
  click: function(){
    // soft bead-like tick
    this._tone(920, 0.06, 'sine', 0.07);
    this._tone(620, 0.08, 'triangle', 0.04);
  },
  milestone: function(){
    // short pleasant chime (every 33 / target)
    this._tone(523, 0.12, 'sine', 0.09, 780);
    setTimeout(()=>{ this._tone(659, 0.14, 'sine', 0.08); }, 80);
  },
  complete: function(){
    this._tone(523, 0.15, 'sine', 0.1, 660);
    setTimeout(()=>{ this._tone(659, 0.15, 'sine', 0.09, 784); }, 100);
    setTimeout(()=>{ this._tone(784, 0.2, 'sine', 0.08); }, 220);
  }
};
function playClick(){ DhikrSFX.click(); }
function playSuccess(){ DhikrSFX.complete(); }


const DHIKR_LIST = [
  {ar:"سُبْحَانَ اللَّهِ", ta:"சுப்ஹானல்லாஹ்", mean:"அல்லாஹ் தூய்மையானவன்."},
  {ar:"الْحَمْدُ لِلَّهِ", ta:"அல்ஹம்துலில்லாஹ்", mean:"அனைத்துப் புகழும் அல்லாஹ்வுக்கே."},
  {ar:"اللَّهُ أَكْبَرُ", ta:"அல்லாஹு அக்பர்", mean:"அல்லாஹ் மிகப்பெரியவன்."},
  {ar:"لَا إِلَٰهَ إِلَّا اللَّهُ", ta:"லா இலாஹ இல்லல்லாஹ்", mean:"அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை."},
  {ar:"أَسْتَغْفِرُ اللَّهَ", ta:"அஸ்தஃபிருல்லாஹ்", mean:"நான் அல்லாஹ்விடம் மன்னிப்புக் கேட்கிறேன்."},
  {ar:"سُبْحَانَ اللَّهِ وَبِحَمْدِهِ", ta:"சுப்ஹானல்லாஹி வபிஹம்திஹி", mean:"அல்லாஹ் தூய்மையானவன்; அவனைப் புகழ்கிறேன்."},
  {ar:"سُبْحَانَ اللَّهِ الْعَظِيمِ", ta:"சுப்ஹானல்லாஹில் அழீம்", mean:"மகத்தான அல்லாஹ் தூய்மையானவன்."},
  {ar:"سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ", ta:"சுப்ஹானல்லாஹி வபிஹம்திஹி, சுப்ஹானல்லாஹில் அழீம்", mean:"இரட்டை தஸ்பீஹ் — மிகவும் சிறந்த திக்ர்."},
  {ar:"لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ", ta:"லா ஹவ்ல வலா குவ்வத்த இல்லா பில்லாஹ்", mean:"அல்லாஹ்வின் உதவியின்றி எந்த மாற்றமும் ஆற்றலும் இல்லை."},
  {ar:"حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ", ta:"ஹஸ்புனல்லாஹு வனிஃமல் வகீல்", mean:"அல்லாஹ்வே எங்களுக்குப் போதுமானவன்; சிறந்த பொறுப்பாளன்."},
  {ar:"اللَّهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ", ta:"அல்லாஹும்ம ஸல்லி அலா முஹம்மத்", mean:"இறைவா, முஹம்மத் (ஸல்) அவர்கள் மீது சல்வாத் பொழிவாயாக."},
  {ar:"رَبِّ اغْفِرْ لِي", ta:"ரப்பிஃக்பிர் லி", mean:"என் இறைவா, என்னை மன்னிப்பாயாக."},
  {ar:"يَا حَيُّ يَا قَيُّومُ", ta:"யா ஹய்யு யா கய்யூம்", mean:"வாழ்விப்பவரே! நிலைத்திருப்பவரே!"},
  {ar:"اللَّهُمَّ بَارِكْ", ta:"அல்லாஹும்ம பாரிக்", mean:"இறைவா, பரக்கத் வழங்குவாயாக."},
  {ar:"بِسْمِ اللَّهِ", ta:"பிஸ்மில்லாஹ்", mean:"அல்லாஹ்வின் பெயரால்."}
];


const SALAH_DHIKR_STEPS = [
  {ar:"سُبْحَانَ اللَّهِ", ta:"சுப்ஹானல்லாஹ்", target:33},
  {ar:"الْحَمْدُ لِلَّهِ", ta:"அல்ஹம்துலில்லாஹ்", target:33},
  {ar:"اللَّهُ أَكْبَرُ", ta:"அல்லாஹு அக்பர்", target:33},
  {ar:"لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
   ta:"லா இலாஹ இல்லல்லாஹு வஹ்தஹு லா ஷரீக்க லஹு...", target:1}
];

let dhikrMode = 'free'; // 'free' | 'salah'
let dhikrStep = 0;
let dhikrCount = 0;
let dhikrCurrent = DHIKR_LIST[0];
let dhikrTarget = 0; // 0 = unlimited

function renderDhikrList(){
  const box = document.getElementById('dhikrList');
  if(!box) return;
  box.className = 'dhikr-list';
  box.innerHTML = DHIKR_LIST.map((d,i)=>`
    <div class="dhikr-card${dhikrMode==='free' && dhikrCurrent && dhikrCurrent.ar===d.ar ? ' selected' : ''}" data-i="${i}">
      <div class="dhikr-num">${i+1}</div>
      <div class="dhikr-body">
        <div class="dhikr-ar">${d.ar}</div>
        <div class="dhikr-ta">${d.ta}</div>
        <div class="dhikr-mean">${d.mean}</div>
      </div>
      <span class="dhikr-check">✓</span>
    </div>`).join('');
  box.querySelectorAll('.dhikr-card').forEach(card=>{
    card.onclick = function(){
      const i = +card.dataset.i;
      dhikrMode = 'free';
      dhikrCurrent = DHIKR_LIST[i];
      dhikrCount = 0;
      dhikrTarget = 0;
      updateSalahDhikrUI();
      renderDhikrList();
      playDhikrAnim();
    };
  });
}

function updateSalahDhikrUI(){
  const elL = document.getElementById('dhikrStepLabel');
  const elA = document.getElementById('dhikrStepAr');
  const elTa = document.getElementById('dhikrStepTa');
  const elC = document.getElementById('dhikrCount');
  const elBead = document.getElementById('dhikrBead');
  const elT = document.getElementById('dhikrTarget');
  const elB = document.getElementById('dhikrBar');
  const elH = document.getElementById('dhikrModeHint');
  if(!elA) return;

  if(dhikrMode === 'salah'){
    const step = SALAH_DHIKR_STEPS[dhikrStep];
    elL.textContent = '🕌 தொழுகைக்குப் பின் · படி ' + (dhikrStep+1) + '/' + SALAH_DHIKR_STEPS.length;
    elA.textContent = step.ar;
    elA.style.fontSize = step.target===1 ? '16px' : '24px';
    if(elTa) elTa.textContent = step.ta;
    dhikrTarget = step.target;
  } else {
    elL.textContent = '📿 தஸ்பீஹ்';
    elA.textContent = dhikrCurrent.ar;
    elA.style.fontSize = dhikrCurrent.ar.length > 40 ? '16px' : '24px';
    if(elTa) elTa.textContent = dhikrCurrent.ta;
    dhikrTarget = 0;
  }

  if(elC) elC.textContent = dhikrCount;
  if(elBead) elBead.textContent = dhikrCount;
  if(elT) elT.textContent = dhikrTarget > 0 ? (dhikrCount + ' / ' + dhikrTarget) : (dhikrCount + ' / ∞');
  if(elB){
    if(dhikrTarget > 0) elB.style.width = Math.min(100, (dhikrCount/dhikrTarget)*100) + '%';
    else elB.style.width = Math.min(100, (dhikrCount % 33) / 33 * 100) + '%';
  }
  if(elH){
    elH.textContent = dhikrMode==='salah'
      ? 'வரிசை: 33 + 33 + 33 + தஹ்லீல் · பெட்டியைத் தொடுங்கள்'
      : 'திக்ர் கார்டைத் தேர்ந்தெடுங்கள் · பெட்டியைத் தொட்டு எண்ணுங்கள்';
  }
}

function playDhikrAnim(ev){
  const box = document.getElementById('dhikrTapArea');
  if(!box) return;
  box.classList.remove('tap-pulse');
  void box.offsetWidth;
  box.classList.add('tap-pulse');
  // ripple
  if(ev && ev.clientX){
    const rect = box.getBoundingClientRect();
    const r = document.createElement('span');
    r.className = 'dhikr-ripple';
    const size = 40;
    r.style.width = r.style.height = size + 'px';
    r.style.left = (ev.clientX - rect.left - size/2) + 'px';
    r.style.top = (ev.clientY - rect.top - size/2) + 'px';
    box.appendChild(r);
    setTimeout(()=> r.remove(), 500);
  }
  try{ if(typeof playClick==='function') playClick(); }catch(e){}
}

function dhikrInc(n, ev){
  if(n > 0){
    playDhikrAnim(ev);
    try{ DhikrSFX.click(); }catch(e){}
  }
  if(dhikrMode === 'salah'){
    const step = SALAH_DHIKR_STEPS[dhikrStep];
    if(!step) return;
    dhikrCount = Math.max(0, dhikrCount + n);
    if(n > 0 && dhikrCount >= step.target){
      if(dhikrStep < SALAH_DHIKR_STEPS.length-1){
        try{ DhikrSFX.milestone(); }catch(e){}
        dhikrStep++;
        dhikrCount = 0;
      } else {
        dhikrCount = step.target;
        try{ DhikrSFX.complete(); }catch(e){}
      }
    }
  } else {
    const prev = dhikrCount;
    dhikrCount = Math.max(0, dhikrCount + n);
    // milestone every 33 counts in free mode
    if(n > 0 && dhikrCount > 0 && dhikrCount % 33 === 0){
      try{ DhikrSFX.milestone(); }catch(e){}
    }
  }
  updateSalahDhikrUI();
}


/* ===== 40 Rabbana Duas (Quran) + Tamil ===== */
const RABBANA_DUAS = [
  {ar:"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ", ta:"எங்கள் இறைவா! எங்களிடமிருந்து ஏற்றுக்கொள்வாயாக; நிச்சயமாக நீயே செவியுறுபவன், அறிந்தவன்.", ref:"2:127"},
  {ar:"رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ", ta:"எங்கள் இறைவா! எங்களை உனக்குக் கீழ்ப்படிந்தவர்களாக்குவாயாக; எங்கள் சந்ததியிலிருந்தும் உனக்குக் கீழ்ப்படிந்த சமுதாயத்தை உருவாக்குவாயாக; எங்கள் வழிபாட்டு முறைகளைக் காட்டுவாயாக; எங்களை மன்னிப்பாயாக. நீயே மன்னிப்பவன், நிகரற்ற அன்புடையோன்.", ref:"2:128"},
  {ar:"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! இவ்வுலகில் நன்மையை அளிப்பாயாக; மறுமையிலும் நன்மையை அளிப்பாயாக; நரக வேதனையிலிருந்து எங்களைக் காப்பாயாக.", ref:"2:201"},
  {ar:"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! எங்கள் மீது பொறுமையைப் பொழிவாயாக; எங்கள் பாதங்களை உறுதிப்படுத்துவாயாக; இறைமறுப்பாளர்களுக்கு எதிராக எங்களுக்கு உதவுவாயாக.", ref:"2:250"},
  {ar:"رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا", ta:"எங்கள் இறைவா! நாங்கள் மறந்தாலோ, தவறிழைத்தாலோ எங்களைத் தண்டிக்காதே.", ref:"2:286"},
  {ar:"رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا", ta:"எங்கள் இறைவா! எங்களுக்கு முன் வாழ்ந்தோர் மீது சுமத்தியதைப் போல் எங்கள் மீது பாரத்தைச் சுமத்தாதே.", ref:"2:286"},
  {ar:"رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! எங்களால் தாங்க முடியாததை எங்கள் மீது சுமத்தாதே; எங்களை மன்னித்து, மன்னிப்பு அளித்து, கருணை காட்டுவாயாக. நீயே எங்கள் பாதுகாவலன்; இறைமறுப்பாளர்களுக்கு எதிராக உதவுவாயாக.", ref:"2:286"},
  {ar:"رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ", ta:"எங்கள் இறைவா! நீ நேர்வழி காட்டிய பின் எங்கள் உள்ளங்களை வழுவவிடாதே; உன்னிடமிருந்து கருணையை வழங்குவாயாக. நீயே வளமாக வழங்குபவன்.", ref:"3:8"},
  {ar:"رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ", ta:"எங்கள் இறைவா! சந்தேகமற்ற அந்நாளில் மக்களை ஒன்று சேர்ப்பவன் நீயே. அல்லாஹ் வாக்குறுதியை மாற்றுவதில்லை.", ref:"3:9"},
  {ar:"رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! நாங்கள் ஈமான் கொண்டோம்; எங்கள் பாவங்களை மன்னிப்பாயாக; நரக வேதனையிலிருந்து காப்பாயாக.", ref:"3:16"},
  {ar:"رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ", ta:"எங்கள் இறைவா! நீ இறக்கியதை நம்பினோம்; தூதரைப் பின்பற்றினோம்; எங்களை சாட்சியாளர்களுடன் எழுதுவாயாக.", ref:"3:53"},
  {ar:"رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! எங்கள் பாவங்களையும், எங்கள் காரியத்தில் எங்கள் வரம்பு மீறலையும் மன்னிப்பாயாக; பாதங்களை உறுதிப்படுத்தி, இறைமறுப்பாளர்களுக்கு எதிராக உதவுவாயாக.", ref:"3:147"},
  {ar:"رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! இதை வீணாகப் படைக்கவில்லை; நீ தூய்மையானவன்; நரக வேதனையிலிருந்து எங்களைக் காப்பாயாக.", ref:"3:191"},
  {ar:"رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ", ta:"எங்கள் இறைவா! நரகத்தில் யாரை நுழைவித்தாலும் அவரை இழிவுபடுத்தியவனாகிறாய்; அக்கிரமக்காரர்களுக்கு உதவியாளர்கள் இல்லை.", ref:"3:192"},
  {ar:"رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا", ta:"எங்கள் இறைவா! 'உங்கள் இறைவனை நம்புங்கள்' என்று ஈமானுக்காக அழைக்கும் அழைப்பாளரைக் கேட்டோம்; ஆகவே நம்பினோம்.", ref:"3:193"},
  {ar:"رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ", ta:"எங்கள் இறைவா! எங்கள் பாவங்களை மன்னிப்பாயாக; தீமைகளை நீக்குவாயாக; நல்லோருடன் எங்களை மரணிக்கச் செய்வாயாக.", ref:"3:193"},
  {ar:"رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ", ta:"எங்கள் இறைவா! உன் தூதர்கள் மூலம் வாக்களித்ததை அளிப்பாயாக; கியாமத் நாளில் எங்களை இழிவுபடுத்தாதே. நீ வாக்குறுதியை மாற்றுவதில்லை.", ref:"3:194"},
  {ar:"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ", ta:"எங்கள் இறைவா! நாங்கள் எங்களுக்குத் தாங்களே அநீதி இழைத்துக்கொண்டோம்; நீ மன்னிக்காவிட்டால், கருணை காட்டாவிட்டால் நாங்கள் நஷ்டமடைந்தோராவோம்.", ref:"7:23"},
  {ar:"رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ", ta:"எங்கள் இறைவா! அக்கிரமக்காரர்களுடன் எங்களை ஆக்காதே.", ref:"7:47"},
  {ar:"رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ", ta:"எங்கள் இறைவா! எங்களுக்கும் எங்கள் சமூகத்திற்கும் இடையே உண்மையுடன் தீர்ப்பளிப்பாயாக; நீயே சிறந்த தீர்ப்பளிப்பவன்.", ref:"7:89"},
  {ar:"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ", ta:"எங்கள் இறைவா! எங்கள் மீது பொறுமையைப் பொழிவாயாக; முஸ்லிம்களாக எங்களை மரணிக்கச் செய்வாயாக.", ref:"7:126"},
  {ar:"رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ", ta:"எங்கள் இறைவா! அக்கிரமக்காரர்களுக்கு சோதனையாக எங்களை ஆக்காதே; உன் கருணையால் இறைமறுப்பாளர்களிடமிருந்து காப்பாயாக.", ref:"10:85-86"},
  {ar:"رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ وَمَا يَخْفَىٰ عَلَى اللَّهِ مِن شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ", ta:"எங்கள் இறைவா! நாங்கள் மறைப்பதையும் வெளிப்படுத்துவதையும் நீ அறிவாய்; பூமியிலும் வானத்திலும் எதுவும் அல்லாஹ்வுக்கு மறைவாயில்லை.", ref:"14:38"},
  {ar:"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ", ta:"என் இறைவா! என்னைத் தொழுகையை நிலைநிறுத்துபவனாக்குவாயாக; என் சந்ததியிலிருந்தும். எங்கள் இறைவா! என் துஆவை ஏற்றுக்கொள்வாயாக.", ref:"14:40"},
  {ar:"رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ", ta:"எங்கள் இறைவா! கணக்கு நிறுத்தப்படும் நாளில் எனக்கும், என் பெற்றோருக்கும், இறைநம்பிக்கையாளர்களுக்கும் மன்னிப்பு அளிப்பாயாக.", ref:"14:41"},
  {ar:"رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا", ta:"எங்கள் இறைவா! உன்னிடமிருந்து கருணையை அளிப்பாயாக; எங்கள் காரியத்தில் நேர்வழியை அமைத்துத் தருவாயாக.", ref:"18:10"},
  {ar:"رَبَّنَا إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَا أَوْ أَن يَطْغَىٰ", ta:"எங்கள் இறைவா! அவர் எங்கள் மீது வரம்பு மீறவோ, அத்துமீறவோ செய்வாரோ என அஞ்சுகிறோம்.", ref:"20:45"},
  {ar:"رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي", ta:"என் இறைவா! என் மார்பை விரிவாக்குவாயாக; என் காரியத்தை எளிதாக்குவாயாக.", ref:"20:25-26"},
  {ar:"رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ", ta:"எங்கள் இறைவா! நாங்கள் நம்பினோம்; மன்னித்து கருணை காட்டுவாயாக; நீயே சிறந்த கருணையாளன்.", ref:"23:109"},
  {ar:"رَبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ", ta:"என் இறைவா! மன்னித்து கருணை காட்டுவாயாக; நீயே சிறந்த கருணையாளன்.", ref:"23:118"},
  {ar:"رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا", ta:"எங்கள் இறைவா! நரக வேதனையை எங்களிடமிருந்து விலக்குவாயாக; அதன் வேதனை நிலையானது.", ref:"25:65"},
  {ar:"رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا", ta:"எங்கள் இறைவா! எங்கள் மனைவிகள், சந்ததியினரிலிருந்து கண்களுக்குக் குளிர்ச்சியை அளிப்பாயாக; இறையச்சமுடையோருக்குத் தலைவர்களாக்குவாயாக.", ref:"25:74"},
  {ar:"رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ", ta:"என் இறைவா! எனக்கு ஞானத்தை அளிப்பாயாக; நல்லோருடன் என்னைச் சேர்ப்பாயாக.", ref:"26:83"},
  {ar:"رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ", ta:"எங்கள் இறைவா! நீ கருணையாலும் அறிவாலும் எல்லாவற்றையும் சூழ்ந்துள்ளாய்; மன்னிப்புக் கேட்டு உன் வழியைப் பின்பற்றியோரை மன்னிப்பாயாக; நரக வேதனையிலிருந்து அவர்களைக் காப்பாயாக.", ref:"40:7"},
  {ar:"رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", ta:"எங்கள் இறைவா! எங்கள் ஒளியை முழுமைப்படுத்துவாயாக; எங்களை மன்னிப்பாயாக. நீ எல்லாம் வல்லவன்.", ref:"66:8"},
  {ar:"رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا", ta:"எங்கள் இறைவா! எங்களையும், ஈமானில் எங்களுக்கு முந்திய சகோதரர்களையும் மன்னிப்பாயாக; இறைநம்பிக்கையாளர்களுக்கு எதிராக எங்கள் உள்ளங்களில் விரோதத்தை வைக்காதே.", ref:"59:10"},
  {ar:"رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ", ta:"எங்கள் இறைவா! உன் மீதே நம்பிக்கை வைத்தோம்; உன்னிடமே திரும்பினோம்; உன்னிடமே மீளுமிடம்.", ref:"60:4"},
  {ar:"رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ", ta:"எங்கள் இறைவா! இறைமறுப்பாளர்களுக்கு சோதனையாக எங்களை ஆக்காதே; எங்களை மன்னிப்பாயாக. நீயே மிகைத்தவன், ஞானமுள்ளவன்.", ref:"60:5"},
  {ar:"رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ", ta:"எங்கள் இறைவா! நாங்கள் நம்பினோம்; எங்களை சாட்சியாளர்களுடன் எழுதுவாயாக.", ref:"5:83"},
  {ar:"رَبِّ زِدْنِي عِلْمًا", ta:"என் இறைவா! என் அறிவை அதிகரிப்பாயாக.", ref:"20:114"}
];

function renderDuaList(filter){
  const box = document.getElementById('duaList');
  if(!box) return;
  const q = (filter || '').trim().toLowerCase();
  let list = RABBANA_DUAS;
  if(q){
    list = RABBANA_DUAS.filter(d =>
      (d.ta||'').toLowerCase().includes(q) ||
      (d.ar||'').includes(q) ||
      (d.ref||'').includes(q)
    );
  }
  box.innerHTML = list.map(function(d, i){
    const num = RABBANA_DUAS.indexOf(d) + 1;
    return '<div class="dua-card">'+
      '<span class="dua-num">'+num+' / 40</span>'+
      '<div class="dua-ar">'+d.ar+'</div>'+
      '<div class="dua-ta">'+d.ta+'</div>'+
      '<div class="dua-ref">📖 '+d.ref+'</div>'+
    '</div>';
  }).join('');
  if(!list.length) box.innerHTML = '<p style="text-align:center;color:var(--text-dim)">முடிவுகள் இல்லை</p>';
}


/* ===== Nabi (Masnoon) Duas + Tamil ===== */
const NABI_DUAS = [
  {cat:"காலை", ar:"أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ", ta:"நாங்கள் காலை புகுந்தோம்; ஆட்சியும் அல்லாஹ்வுக்கே. எல்லாப் புகழும் அல்லாஹ்வுக்கே. அவனைத் தவிர இறைவன் இல்லை; அவனுக்குப் பங்குதாரர் இல்லை.", note:"காலை திக்ர்"},
  {cat:"காலை", ar:"اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ", ta:"இறைவா! உன்னால் காலை புகுந்தோம்; உன்னால் மாலை புகுந்தோம்; உன்னால் வாழ்கிறோம்; உன்னால் மரணிக்கிறோம்; உன்னிடமே எழுப்பப்படுதல்.", note:""},
  {cat:"மாலை", ar:"أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ", ta:"நாங்கள் மாலை புகுந்தோம்; ஆட்சியும் அல்லாஹ்வுக்கே. எல்லாப் புகழும் அல்லாஹ்வுக்கே.", note:"மாலை திக்ர்"},
  {cat:"மாலை", ar:"اللَّهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ", ta:"இறைவா! உன்னால் மாலை புகுந்தோம்; உன்னால் காலை புகுந்தோம்; உன்னால் வாழ்கிறோம்; உன்னால் மரணிக்கிறோம்; உன்னிடமே மீளுமிடம்.", note:""},
  {cat:"தூக்கம்", ar:"بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا", ta:"இறைவா! உன் பெயரால் மரணிக்கிறேன்; உன் பெயரால் வாழ்கிறேன்.", note:"படுக்கும்போது"},
  {cat:"தூக்கம்", ar:"اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ", ta:"இறைவா! நீ உன் அடியார்களை எழுப்பும் நாளில் உன் வேதனையிலிருந்து என்னைக் காப்பாயாக.", note:""},
  {cat:"எழுந்ததும்", ar:"الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ", ta:"எங்களை மரணிக்கச் செய்த பின் உயிர்ப்பித்த அல்லாஹ்வுக்கே புகழ்; அவனிடமே எழுப்பப்படுதல்.", note:"தூக்கத்திலிருந்து"},
  {cat:"வீடு", ar:"بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا", ta:"அல்லாஹ்வின் பெயரால் நுழைந்தோம்; அல்லாஹ்வின் பெயரால் வெளியேறினோம்; எங்கள் இறைவனாகிய அல்லாஹ்வின் மீதே நம்பிக்கை.", note:"வீட்டில் நுழையும்போது"},
  {cat:"வீடு", ar:"اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلِجِ وَخَيْرَ الْمَخْرَجِ", ta:"இறைவா! நுழைவின் நன்மையையும் வெளியேற்றத்தின் நன்மையையும் உன்னிடம் கேட்கிறேன்.", note:""},
  {cat:"மஸ்ஜித்", ar:"اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ", ta:"இறைவா! உன் கருணையின் கதவுகளை எனக்குத் திறப்பாயாக.", note:"மஸ்ஜித்தில் நுழைவு"},
  {cat:"மஸ்ஜித்", ar:"اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ", ta:"இறைவா! உன் அருளை உன்னிடம் கேட்கிறேன்.", note:"மஸ்ஜிதிலிருந்து வெளியேறும்போது"},
  {cat:"உணவு", ar:"بِسْمِ اللَّهِ", ta:"அல்லாஹ்வின் பெயரால்.", note:"உண்ணத் தொடங்கும்போது"},
  {cat:"உணவு", ar:"الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَٰذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ", ta:"இதை எனக்கு உணவளித்து, என் ஆற்றல் இல்லாமல் ரிஸ்க் அளித்த அல்லாஹ்வுக்கே புகழ்.", note:"உணவுக்குப் பின்"},
  {cat:"பயணம்", ar:"سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ", ta:"இதை எங்களுக்கு வசப்படுத்தினவன் தூய்மையானவன்; நாங்கள் இதற்கு சக்தியற்றவர்கள்; எங்கள் இறைவனிடமே திரும்புவோம்.", note:"வாகனம் ஏறும்போது"},
  {cat:"பயணம்", ar:"اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَٰذَا وَاطْوِ عَنَّا بُعْدَهُ", ta:"இறைவா! இந்தப் பயணத்தை எங்களுக்கு எளிதாக்குவாயாக; அதன் தூரத்தைச் சுருக்குவாயாக.", note:""},
  {cat:"கழிப்பறை", ar:"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ", ta:"இறைவா! அசுத்தமான ஆண்கள், பெண்கள் (ஷைத்தான்கள்) இடமிருந்து உன்னிடம் பாதுகாப்புத் தேடுகிறேன்.", note:"நுழைவு"},
  {cat:"கழிப்பறை", ar:"غُفْرَانَكَ", ta:"உன் மன்னிப்பை வேண்டுகிறேன்.", note:"வெளியேறும்போது"},
  {cat:"உடை", ar:"الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَٰذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ", ta:"இந்த ஆடையை அணிவித்து ரிஸ்க் அளித்த அல்லாஹ்வுக்கே புகழ்.", note:"புதிய ஆடை"},
  {cat:"கண்ணாடி", ar:"اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي", ta:"இறைவா! என் உருவை அழகாக்கியது போல் என் ஒழுக்கத்தையும் அழகாக்குவாயாக.", note:""},
  {cat:"கேள்வி/தேவை", ar:"اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى", ta:"இறைவா! நேர்வழி, இறையச்சம், தூய்மை, தேவையற்ற செல்வம் ஆகியவற்றைக் கேட்கிறேன்.", note:""},
  {cat:"மன்னிப்பு", ar:"اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ", ta:"இறைவா! நீயே என் இறைவன்; உன்னைத் தவிர இறைவன் இல்லை. என்னைப் படைத்தாய்; நான் உன் அடியான். உன் உடன்படிக்கையின் மீது என் சக்திக்கு ஏற்ப இருக்கிறேன். நான் செய்த தீமையிலிருந்து பாதுகாப்புத் தேடுகிறேன். உன் அருளை ஒப்புக்கொள்கிறேன்; என் பாவத்தை ஒப்புக்கொள்கிறேன். மன்னிப்பாயாக — உன்னைத் தவிர பாவங்களை மன்னிப்பவர் இல்லை.", note:"செய்ய்டுல் இஸ்திஃபார்"},
  {cat:"மன்னிப்பு", ar:"رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ", ta:"என் இறைவா! என்னை மன்னித்து, மன்னிப்புத் திருப்புவாயாக. நீயே மன்னிப்பவன், நிகரற்ற அன்புடையோன்.", note:""},
  {cat:"கவலை", ar:"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ", ta:"இறைவா! கவலை, துக்கம், இயலாமை, சோம்பல், பயம், உலோபித்தனம், கடன் அதிகம், மனிதர்களின் அடக்குமுறை ஆகியவற்றிலிருந்து பாதுகாப்புத் தேடுகிறேன்.", note:""},
  {cat:"கவலை", ar:"حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ", ta:"அல்லாஹ்வே எனக்குப் போதுமானவன்; அவனைத் தவிர இறைவன் இல்லை; அவன் மீதே நம்பிக்கை; அவனே மகத்தான அர்ஷின் இறைவன்.", note:"7 முறை"},
  {cat:"நோய்", ar:"اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَأْسَ، اشْفِ أَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا", ta:"இறைவா! மனிதர்களின் இறைவா! துன்பத்தை நீக்குவாயாக; குணப்படுத்துவாயாக — நீயே குணப்படுத்துபவன். உன் குணப்படுத்துதலையன்றி குணமில்லை; நோயை விடாத குணம்.", note:"ருக்யா"},
  {cat:"நோய்", ar:"أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ", ta:"மகத்தான அல்லாஹ்விடம் — மகத்தான அர்ஷின் இறைவனிடம் — உன்னைக் குணப்படுத்தும்படி கேட்கிறேன்.", note:"7 முறை"},
  {cat:"குடும்பம்", ar:"رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ", ta:"என் இறைவா! நீ எனக்கு இறக்கும் நன்மையை நான் தேவைப்படுபவன்.", note:"மூசா (அலை)"},
  {cat:"குடும்பம்", ar:"رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ", ta:"எங்கள் இறைவா! மனைவிகள், சந்ததியினரிலிருந்து கண்களுக்குக் குளிர்ச்சியை அளிப்பாயாக.", note:""},
  {cat:"இஸ்திகாரா", ar:"اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ", ta:"இறைவா! உன் அறிவால் நன்மையைத் தேடுகிறேன்; உன் ஆற்றலால் சக்தி கேட்கிறேன்; உன் மகத்தான அருளைக் கேட்கிறேன்.", note:"இஸ்திகாரா (சுருக்கம்)"},
  {cat:"தொழுகை", ar:"سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَىٰ جَدُّكَ وَلَا إِلَٰهَ غَيْرُكَ", ta:"இறைவா! நீ தூய்மையானவன்; உன்னைப் புகழ்கிறேன்; உன் பெயர் பாக்கியமுள்ளது; உன் மகத்துவம் உயர்ந்தது; உன்னைத் தவிர இறைவன் இல்லை.", note:"ஸனா"},
  {cat:"தொழுகை", ar:"اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ", ta:"இறைவா! கிழக்கு மேற்கு இடையே விலக்கியது போல் எனக்கும் என் பாவங்களுக்கும் இடையே விலக்குவாயாக.", note:"இஃதிதாஹ்"},
  {cat:"தொழுகை", ar:"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ", ta:"எங்கள் இறைவா! இவ்வுலகிலும் மறுமையிலும் நன்மை அளித்து நரகத்திலிருந்து காப்பாயாக.", note:"ருகூஉ / துஆ"},
  {cat:"பாதுகாப்பு", ar:"بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ", ta:"அல்லாஹ்வின் பெயரால் — அவன் பெயருடன் பூமியிலும் வானத்திலும் எதுவும் தீங்கு செய்யாது. அவன் செவியுறுபவன், அறிந்தவன்.", note:"காலை மாலை 3 முறை"},
  {cat:"பாதுகாப்பு", ar:"أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ", ta:"அல்லாஹ் படைத்தவற்றின் தீமையிலிருந்து அவனது முழுமையான வார்த்தைகளால் பாதுகாப்புத் தேடுகிறேன்.", note:""},
  {cat:"பாதுகாப்பு", ar:"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ", ta:"விடியலின் இறைவனிடம் பாதுகாப்புத் தேடுகிறேன். (அல்-ஃபலக்)", note:"முஅவ்விதத்"},
  {cat:"பாதுகாப்பு", ar:"قُلْ أَعُوذُ بِرَبِّ النَّاسِ", ta:"மனிதர்களின் இறைவனிடம் பாதுகாப்புத் தேடுகிறேன். (அன்-நாஸ்)", note:"முஅவ்விதத்"}
];

let nabiDuaCat = 'எல்லாம்';

function renderNabiDuaList(){
  const box = document.getElementById('nabiDuaList');
  if(!box) return;
  const q = ((document.getElementById('nabiDuaSearch')||{}).value || '').trim().toLowerCase();
  let list = NABI_DUAS.filter(function(d){
    if(nabiDuaCat !== 'எல்லாம்' && d.cat !== nabiDuaCat) return false;
    if(!q) return true;
    return (d.ta||'').toLowerCase().includes(q) || (d.ar||'').includes(q) || (d.cat||'').includes(q) || (d.note||'').toLowerCase().includes(q);
  });
  box.innerHTML = list.map(function(d, i){
    return '<div class="dua-card">'+
      '<span class="dua-num">'+d.cat+(d.note ? ' · '+d.note : '')+'</span>'+
      '<div class="dua-ar">'+d.ar+'</div>'+
      '<div class="dua-ta">'+d.ta+'</div>'+
    '</div>';
  }).join('') || '<p style="text-align:center;color:var(--text-dim)">முடிவுகள் இல்லை</p>';
}





/* ===== Ayah Finder v4 — Follow-along mode ===== */
const AyahFinder = {
  rec: null,
  listening: false,
  mode: 'follow', // follow | search
  lastMatch: null,
  _pool: null,
  _flat: null, // ordered list for follow
  _idx: -1,    // current index in _flat
  _finalChunks: [],
  _stopTimer: null,
  _lastSpeechAt: 0,

  normalizeAr: function(s){
    if(!s) return '';
    var t = String(s);
    t = t.replace(/[\u0640\u064B-\u065F\u0670\u06D6-\u06ED\u06DF-\u06E8\u06EA-\u06ED]/g, '');
    t = t.replace(/[آأإٱٲٳ]/g, 'ا');
    t = t.replace(/[ىئ]/g, 'ي');
    t = t.replace(/ة/g, 'ه');
    t = t.replace(/ؤ/g, 'و');
    t = t.replace(/[^\u0600-\u06FF\s]/g, ' ');
    return t.replace(/\s+/g, ' ').trim();
  },

  orderedCoverage: function(qw, aw){
    if(!qw.length || !aw.length) return 0;
    var qi = 0, hits = 0;
    for(var ai=0; ai<aw.length && qi<qw.length; ai++){
      if(aw[ai] === qw[qi]){ hits++; qi++; }
    }
    return hits / qw.length;
  },

  scorePair: function(queryNorm, ayahNorm){
    if(!queryNorm || !ayahNorm) return 0;
    if(queryNorm === ayahNorm) return 1;
    var qw = queryNorm.split(' ').filter(function(w){ return w.length>=2; });
    var aw = ayahNorm.split(' ').filter(function(w){ return w.length>=2; });
    if(qw.length < 1) return 0;
    if(ayahNorm.indexOf(queryNorm) !== -1) return 0.9;
    if(queryNorm.indexOf(ayahNorm) !== -1 && ayahNorm.length > 8) return 0.75;
    var ord = this.orderedCoverage(qw, aw);
    // opening words
    var open = 0, n = Math.min(3, qw.length, aw.length);
    for(var i=0;i<n;i++){ if(qw[i]===aw[i]) open++; else break; }
    open = n ? open/n : 0;
    var s = ord * 0.65 + open * 0.35;
    if(ord < 0.35 && open < 0.6) return 0;
    return Math.min(1, s);
  },

  buildFlat: function(){
    var list = [];
    var ids = Object.keys(QURAN_DATA||{});
    // sort by surah number
    ids.sort(function(a,b){
      return (QURAN_DATA[a].surahNum||0) - (QURAN_DATA[b].surahNum||0);
    });
    // juz filter
    var allow = null;
    if(typeof selectedJuz==='number' && selectedJuz>0 && typeof getSurahNumsForJuz==='function'){
      var nums = getSurahNumsForJuz(selectedJuz)||[];
      allow = {};
      nums.forEach(function(n){ allow[n]=1; });
    }
    ids.forEach(function(id){
      var s = QURAN_DATA[id];
      if(!s||!s.ayat) return;
      if(allow && !allow[s.surahNum]) return;
      s.ayat.forEach(function(a,i){
        if(!a||!a.ar) return;
        var norm = AyahFinder.normalizeAr(a.ar);
        if(norm.length<4) return;
        list.push({
          id:id, surahNum:s.surahNum||0, nameTa:s.nameTa||'', nameAr:s.nameAr||'',
          ayahNum:i+1, ar:a.ar, ta:a.ta||'', norm:norm,
          words: norm.split(' ').filter(function(w){ return w.length>=2; })
        });
      });
    });
    this._flat = list;
    return list;
  },

  collectAyat: function(){ return this.buildFlat(); },

  findMatches: function(queries){
    if(typeof queries==='string') queries=[queries];
    var norms=[];
    (queries||[]).forEach(function(q){
      var n=AyahFinder.normalizeAr(q);
      if(n.length>=4 && norms.indexOf(n)===-1) norms.push(n);
    });
    if(!norms.length) return [];
    var pool = this.buildFlat();
    var best={};
    pool.forEach(function(item){
      var maxSc=0;
      norms.forEach(function(n){
        var sc=AyahFinder.scorePair(n, item.norm);
        if(sc>maxSc) maxSc=sc;
      });
      if(maxSc>=0.5){
        var k=item.id+':'+item.ayahNum;
        if(!best[k]||best[k].score<maxSc) best[k]={item:item,score:maxSc};
      }
    });
    return Object.keys(best).map(function(k){return best[k];})
      .sort(function(a,b){return b.score-a.score;}).slice(0,5);
  },

  showResult: function(matches, source){
    var box=document.getElementById('finderResult');
    if(!box) return;
    if(!matches||!matches.length){
      box.classList.remove('show');
      this.lastMatch=null;
      return;
    }
    var top=matches[0];
    this.lastMatch=top.item;
    box.classList.add('show');
    document.getElementById('finderResTitle').textContent='✅ '+Math.round(top.score*100)+'%';
    document.getElementById('finderResMeta').textContent=
      (top.item.nameTa||'')+' · ஆயத்து '+top.item.ayahNum+' · சூரா '+(top.item.surahNum||'');
    document.getElementById('finderResAr').textContent=top.item.ar;
    var alts=document.getElementById('finderAlts');
    if(alts){
      alts.innerHTML='';
      matches.slice(1).forEach(function(m){
        var d=document.createElement('div');
        d.className='finder-alt-item';
        d.textContent=(m.item.nameTa||'')+' · ஆயத்து '+m.item.ayahNum+' ('+Math.round(m.score*100)+'%)';
        d.onclick=function(){
          AyahFinder.lastMatch=m.item;
          document.getElementById('finderResMeta').textContent=
            (m.item.nameTa||'')+' · ஆயத்து '+m.item.ayahNum;
          document.getElementById('finderResAr').textContent=m.item.ar;
        };
        alts.appendChild(d);
      });
    }
  },

  searchText: function(){
    var el=document.getElementById('finderTextInput');
    var text=(el&&el.value)||'';
    if(!text.trim()) return;
    this.showResult(this.findMatches([text]), 'text');
    document.getElementById('finderStatus').textContent = this.lastMatch ? 'கண்டுபிடிக்கப்பட்டது' : 'பொருத்தம் இல்லை';
  },

  showLive: function(item, idx){
    var card=document.getElementById('finderLiveCard');
    if(!card||!item) return;
    card.style.display='block';
    document.getElementById('finderLiveMeta').textContent =
      (item.nameTa||item.nameAr||'') + ' · ஆயத்து ' + item.ayahNum +
      (item.surahNum ? ' · சூரா ' + item.surahNum : '');
    document.getElementById('finderLiveAr').textContent = item.ar;
    var total = (this._flat||[]).length;
    document.getElementById('finderLiveProgress').textContent =
      'முன்னேற்றம்: ' + (idx+1) + ' / ' + total + (this.listening ? ' · 🔴 கேட்கிறது…' : '');
    this.lastMatch = item;
  },

  // Core: given recent speech, advance follow position
  trackSpeech: function(rawText){
    var flat = this._flat || this.buildFlat();
    if(!flat.length) return;
    var norm = this.normalizeAr(rawText);
    if(norm.length < 3) return;

    // Window: current, next few, and nearby previous
    var start = Math.max(0, this._idx < 0 ? 0 : this._idx);
    // On first lock, search broader
    var windowItems = [];
    if(this._idx < 0){
      // search first 80 or all if small — then whole if needed
      windowItems = flat.slice(0, Math.min(flat.length, 120));
      if(flat.length > 120) windowItems = flat; // full search once
    } else {
      for(var i = Math.max(0, this._idx - 1); i < Math.min(flat.length, this._idx + 5); i++){
        windowItems.push({item: flat[i], idx: i});
      }
    }

    var bestSc = 0, bestIdx = -1, bestItem = null;
    var list = this._idx < 0 ? windowItems.map(function(it,i){ return {item:it, idx: flat.indexOf(it)}; }) : windowItems;

    // fix list format when _idx < 0
    if(this._idx < 0){
      list = windowItems.map(function(it){
        return {item: it, idx: flat.indexOf(it)};
      });
    }

    for(var j=0;j<list.length;j++){
      var it = list[j].item;
      var idx = list[j].idx;
      if(idx < 0) continue;
      var sc = this.scorePair(norm, it.norm);
      // bias toward next ayah when following
      if(this._idx >= 0 && idx === this._idx + 1) sc *= 1.15;
      if(this._idx >= 0 && idx === this._idx) sc *= 1.1;
      if(sc > bestSc){ bestSc = sc; bestIdx = idx; bestItem = it; }
    }

    // First lock needs higher confidence
    var need = this._idx < 0 ? 0.52 : 0.42;
    if(bestItem && bestSc >= need){
      // Advance only same or forward (allow 1 back for correction)
      if(this._idx < 0 || bestIdx >= this._idx - 1){
        this._idx = bestIdx;
        this.showLive(bestItem, bestIdx);
        document.getElementById('finderStatus').textContent =
          '📖 ஆயத்து ' + bestItem.ayahNum + ' · தொடர்ந்து ஓதுங்கள்…';
      }
    }
  },

  stop: function(){
    this.listening = false;
    if(this._stopTimer){ clearTimeout(this._stopTimer); this._stopTimer=null; }
    try{ if(this.rec) this.rec.stop(); }catch(e){}
    var btn = document.getElementById('finderMicBtn');
    if(btn){ btn.classList.remove('listening'); btn.textContent = '🎤'; }
    var prog = document.getElementById('finderLiveProgress');
    if(prog && this._idx >= 0){
      prog.textContent = (prog.textContent||'').replace(/ · 🔴.*/,'') + ' · ⏹ நின்றது';
    }
  },

  start: function(){
    var SR = window.SpeechRecognition || window.webkitSpeechRecognition;
    if(!SR){
      document.getElementById('finderStatus').textContent = 'Chrome தேவை · அல்லது தேடல் Mode பயன்படுத்துங்கள்';
      return;
    }
    if(this.listening){ this.stop(); document.getElementById('finderStatus').textContent='நிறுத்தப்பட்டது'; return; }

    this.buildFlat();
    if(!this._flat.length){
      document.getElementById('finderStatus').textContent = 'சூரா data இல்லை — முதலில் ஒரு சூரா load செய்யுங்கள்';
      return;
    }

    // optional start surah
    var sel = document.getElementById('finderStartSurah');
    this._idx = -1;
    if(sel && sel.value){
      var sn = parseInt(sel.value, 10);
      for(var i=0;i<this._flat.length;i++){
        if(this._flat[i].surahNum === sn){ this._idx = i; break; }
      }
      if(this._idx >= 0) this.showLive(this._flat[this._idx], this._idx);
    }

    var self = this;
    this.rec = new SR();
    this.rec.lang = 'ar-SA';
    this.rec.continuous = true;
    this.rec.interimResults = true;
    this.rec.maxAlternatives = 3;

    this.listening = true;
    this._finalChunks = [];
    this._lastSpeechAt = Date.now();

    var btn = document.getElementById('finderMicBtn');
    if(btn){ btn.classList.add('listening'); btn.textContent = '⏹'; }
    document.getElementById('finderStatus').textContent = '🔴 கேட்கிறது — ஓதுங்கள்… நின்றால் நிற்கும்';
    document.getElementById('finderHeard').textContent = '';

    function armSilenceStop(){
      if(self._stopTimer) clearTimeout(self._stopTimer);
      self._stopTimer = setTimeout(function(){
        if(!self.listening) return;
        // 2.8s silence → stop (like the app you used)
        if(Date.now() - self._lastSpeechAt >= 2700){
          self.stop();
          document.getElementById('finderStatus').textContent =
            '⏹ நின்றது (அமைதி) · மீண்டும் 🎤 அழுத்தித் தொடரலாம்';
        }
      }, 2800);
    }

    this.rec.onresult = function(ev){
      self._lastSpeechAt = Date.now();
      armSilenceStop();
      var interim = '', finals = [];
      for(var i=0;i<ev.results.length;i++){
        var r = ev.results[i];
        if(r.isFinal){
          finals.push(r[0].transcript);
          for(var a=1;a<Math.min(r.length,3);a++) finals.push(r[a].transcript);
        } else if(r[0]) interim += r[0].transcript;
      }
      var recent = (finals.slice(-3).join(' ') + ' ' + interim).trim();
      document.getElementById('finderHeard').textContent = recent;
      // Live track on interim + final
      if(recent.length >= 4) self.trackSpeech(recent);
      if(finals.length){
        var joined = finals.slice(-2).join(' ');
        if(joined.length >= 4) self.trackSpeech(joined);
      }
    };

    this.rec.onerror = function(ev){
      if(ev.error==='no-speech'){ armSilenceStop(); return; }
      if(ev.error==='aborted') return;
      self.stop();
      var msg = 'பிழை — மீண்டும் முயலுங்கள்';
      if(ev.error==='not-allowed') msg='Mic அனுமதி தேவை';
      if(ev.error==='network') msg='Internet தேவை';
      document.getElementById('finderStatus').textContent = msg;
    };

    this.rec.onend = function(){
      // Auto-restart while user still listening (Chrome drops continuous often)
      if(self.listening){
        try { self.rec.start(); } catch(e){
          self.stop();
          document.getElementById('finderStatus').textContent = '⏹ இணைப்பு முடிந்தது';
        }
      }
    };

    try { this.rec.start(); armSilenceStop(); }
    catch(e){
      this.stop();
      document.getElementById('finderStatus').textContent = 'தொடங்கவில்லை';
    }
  }
};

function initFinder(){
  // Mode toggle
  var fBtn = document.getElementById('finderModeFollow');
  var sBtn = document.getElementById('finderModeSearch');
  function setMode(m){
    AyahFinder.mode = m;
    if(fBtn) fBtn.classList.toggle('active', m==='follow');
    if(sBtn) sBtn.classList.toggle('active', m==='search');
    var fb = document.getElementById('finderFollowBox');
    var sb = document.getElementById('finderSearchBox');
    if(fb) fb.style.display = m==='follow' ? 'block' : 'none';
    if(sb) sb.style.display = m==='search' ? 'block' : 'none';
    if(AyahFinder.listening) AyahFinder.stop();
  }
  if(fBtn && !fBtn._bound){ fBtn._bound=true; fBtn.onclick=function(){ setMode('follow'); }; }
  if(sBtn && !sBtn._bound){ sBtn._bound=true; sBtn.onclick=function(){ setMode('search'); }; }

  // Surah dropdown
  var sel = document.getElementById('finderStartSurah');
  if(sel){
    var opts = '<option value="">— தானே கண்டுபிடி (எல்லாம்) —</option>';
    var seen = {};
    Object.keys(QURAN_DATA||{}).forEach(function(id){
      var s = QURAN_DATA[id];
      if(!s||!s.surahNum||seen[s.surahNum]) return;
      seen[s.surahNum]=1;
    });
    Object.keys(seen).map(Number).sort(function(a,b){return a-b;}).forEach(function(n){
      var id = (typeof surahIdForNum==='function') ? surahIdForNum(n) : ('s'+n);
      var s = QURAN_DATA[id];
      var label = (s && s.nameTa) ? s.nameTa : ('சூரா '+n);
      opts += '<option value="'+n+'">'+label+'</option>';
    });
    sel.innerHTML = opts;
  }

  var btn = document.getElementById('finderMicBtn');
  if(btn && !btn._bound){
    btn._bound = true;
    btn.onclick = function(){ AyahFinder.start(); };
  }
  var openBtn = document.getElementById('finderOpenBtn');
  if(openBtn && !openBtn._bound){
    openBtn._bound = true;
    openBtn.onclick = function(){
      var m = AyahFinder.lastMatch;
      if(!m) return;
      if(typeof openGarden==='function') openGarden(m.id);
      else if(typeof openGardenByNum==='function' && m.surahNum) openGardenByNum(m.surahNum);
    };
  }
  var tBtn = document.getElementById('finderTextSearchBtn');
  if(tBtn && !tBtn._bound){
    tBtn._bound = true;
    tBtn.onclick = function(){ AyahFinder.searchText(); };
  }

  setMode('follow');
  document.getElementById('finderStatus').textContent =
    '🎤 அழுத்தி ஓதுங்கள் · நின்றால் தானே நிற்கும்';
}








function initNabiDua(){
  const cats = ['எல்லாம்'];
  NABI_DUAS.forEach(function(d){ if(cats.indexOf(d.cat)===-1) cats.push(d.cat); });
  const catBox = document.getElementById('nabiDuaCats');
  if(catBox){
    catBox.innerHTML = cats.map(function(c){
      return '<button type="button" class="nabi-cat'+(c===nabiDuaCat?' active':'')+'" data-cat="'+c+'">'+c+'</button>';
    }).join('');
    catBox.querySelectorAll('.nabi-cat').forEach(function(btn){
      btn.onclick = function(){
        nabiDuaCat = btn.getAttribute('data-cat');
        catBox.querySelectorAll('.nabi-cat').forEach(function(b){ b.classList.toggle('active', b===btn); });
        renderNabiDuaList();
      };
    });
  }
  const s = document.getElementById('nabiDuaSearch');
  if(s && !s._bound){
    s._bound = true;
    s.oninput = function(){ renderNabiDuaList(); };
  }
  renderNabiDuaList();
}


function initDua(){
  renderDuaList('');
  const s = document.getElementById('duaSearch');
  if(s && !s._bound){
    s._bound = true;
    s.oninput = function(){ renderDuaList(s.value); };
  }
}


function initDhikr(){
  if(dhikrMode !== 'salah'){
    dhikrMode = 'free';
    if(!dhikrCurrent) dhikrCurrent = DHIKR_LIST[0];
  }
  renderDhikrList();
  updateSalahDhikrUI();

  const plus = document.getElementById('dhikrPlus');
  const minus = document.getElementById('dhikrMinus');
  const reset = document.getElementById('dhikrReset');
  const salahBtn = document.getElementById('dhikrSalahMode');
  const tapArea = document.getElementById('dhikrTapArea');

  if(plus) plus.onclick = (e)=>{ e.stopPropagation(); dhikrInc(1, e); };
  if(minus) minus.onclick = (e)=>{ e.stopPropagation(); dhikrInc(-1); };
  if(reset) reset.onclick = (e)=>{
    e.stopPropagation();
    dhikrCount = 0;
    if(dhikrMode==='salah') dhikrStep = 0;
    updateSalahDhikrUI();
  };
  if(salahBtn) salahBtn.onclick = (e)=>{
    e.stopPropagation();
    dhikrMode = 'salah';
    dhikrStep = 0;
    dhikrCount = 0;
    renderDhikrList();
    updateSalahDhikrUI();
  };
  if(tapArea){
    tapArea.onclick = function(e){
      if(e.target.closest('button')) return;
      dhikrInc(1, e);
    };
  }
  const soundBtn = document.getElementById('dhikrSoundBtn');
  if(soundBtn){
    soundBtn.textContent = DhikrSFX.enabled ? '🔊 ஒலி' : '🔇 ஒலி';
    soundBtn.onclick = function(e){
      e.stopPropagation();
      DhikrSFX.enabled = !DhikrSFX.enabled;
      soundBtn.textContent = DhikrSFX.enabled ? '🔊 ஒலி' : '🔇 ஒலி';
      if(DhikrSFX.enabled) try{ DhikrSFX.click(); }catch(err){}
    };
  }
}

document.querySelectorAll('.side-nav-item[data-screen]').forEach(btn=>{
  btn.onclick = function(){
    document.querySelectorAll('.side-nav-item').forEach(b=>b.classList.remove('active'));
    btn.classList.add('active');
    closeSideMenu();
    if(btn.dataset.screen==='screenSelect') renderPlotsGrid();
    switchScreen(btn.dataset.screen);
  };
});
document.getElementById('sideAdminBtn').onclick = function(){
  closeSideMenu();
  document.getElementById('adminOverlay').classList.add('active');
};
document.getElementById('sideSoundBtn').onclick = function(){
  meta.sound = !meta.sound; AudioFX.enabled = meta.sound; saveMeta(); updateHeader();
};
/* Export removed from Settings UI */
(function(){
  var sideExp = document.getElementById('sideExportBtn2');
  var expBtn = document.getElementById('exportBtn');
  if(sideExp && expBtn){
    sideExp.onclick = function(){ closeSideMenu(); expBtn.click(); };
  }
})();
document.getElementById('soundBtn').onclick = function(){
  meta.sound = !meta.sound; AudioFX.enabled = meta.sound; saveMeta(); updateHeader();
};
document.getElementById('surahSearchInput').oninput = renderPlotsGrid;
document.getElementById('backBtn').onclick = function(){ stopContinuous(); renderPlotsGrid(); switchScreen('screenSelect'); };
document.getElementById('juzBackBtn').onclick = function(){
  stopContinuous();
  if(currentJuzView !== null){
    showJuzNumberGrid();
    document.getElementById('juzBackBtn').textContent = '⬅ தோட்டம்';
  } else {
    renderPlotsGrid();
    switchScreen('screenSelect');
  }
};
document.getElementById('resetBtn').onclick = function(){
  if(!confirm('ரீசெட் செய்யவா?')) return;
  state.gardens[currentSurah].planted.fill(false); saveGame(); renderTree(); renderDots();
};
document.getElementById('playSurahAllBtn').onclick = function(){
  if(!currentSurah) return;
  if(contPlaying && contQueue.length && contQueue[0] && contQueue[0].id===currentSurah){
    stopContinuous();
    this.textContent = '🔊 சூரா முழுவதும் கேளுங்கள்';
    return;
  }
  stopContinuous();
  contQueue = buildSurahQueue(currentSurah);
  contIndex = 0;
  if(!contQueue.length){ alert('Audio இல்லை (surahNum தேவை)'); return; }
  playContinuousAt(0);
};
document.getElementById('juzPlayBtn').onclick = toggleContinuousPlay;
document.getElementById('juzStopBtn').onclick = function(){ stopContinuous(); updateJuzUI(); };
document.getElementById('juzPrevBtn').onclick = function(){
  if(contIndex>0) playContinuousAt(contIndex-1);
};
document.getElementById('juzNextBtn').onclick = function(){
  if(contIndex < contQueue.length-1) playContinuousAt(contIndex+1);
};
document.querySelectorAll('.mode-btn').forEach(btn=>{
  btn.onclick = function(){
    document.querySelectorAll('.mode-btn').forEach(b=>b.classList.remove('active'));
    btn.classList.add('active');
    quizMode = btn.dataset.mode;
  };
});
document.getElementById('quizCancel').onclick = function(){
  document.getElementById('quizOverlay').classList.remove('active');
  if(currentAudio){ currentAudio.pause(); currentAudio=null; }
};
document.getElementById('closeAdminBtn').onclick = function(){
  document.getElementById('adminOverlay').classList.remove('active');
};
(function(){
  var copyBtn = document.getElementById('adminWaCopyBtn');
  if(copyBtn){
    copyBtn.onclick = function(){
      var num = '7092427154';
      if(navigator.clipboard && navigator.clipboard.writeText){
        navigator.clipboard.writeText(num).then(function(){
          copyBtn.textContent = '✅ Copy ஆனது';
          setTimeout(function(){ copyBtn.textContent = '📋 Number Copy'; }, 1600);
        }).catch(function(){ prompt('Number copy பண்ணுங்க:', num); });
      } else {
        prompt('Number copy பண்ணுங்க:', num);
      }
    };
  }
})();
function renderAdmin(){ /* legacy no-op — admin is now WhatsApp contact */ }
/* Export / Import removed from Settings — handlers kept optional for future/dev */
(function(){
  var exportBtn = document.getElementById('exportBtn');
  if(exportBtn){
    exportBtn.onclick = function(){
      const blob = new Blob([JSON.stringify({quran:QURAN_DATA, state, meta}, null, 2)], {type:'application/json'});
      const a = document.createElement('a'); a.href = URL.createObjectURL(blob); a.download = 'quran-backup.json'; a.click();
    };
  }
  var importBtn = document.getElementById('importBtn');
  var importFile = document.getElementById('importFile');
  if(importBtn && importFile){
    importBtn.onclick = function(){ importFile.click(); };
    importFile.onchange = function(e){
      const f = e.target.files[0]; if(!f) return;
      const r = new FileReader();
      r.onload = function(){
        try{
          const d = JSON.parse(r.result);
          if(d.quran) QURAN_DATA = d.quran;
          if(d.state) state = d.state;
          if(d.meta) meta = d.meta;
          saveData(); saveGame(); saveMeta();
          renderPlotsGrid(); updateHeader();
          alert('Import வெற்றி!');
        }catch(err){ alert('தவறான file'); }
      };
      r.readAsText(f);
    };
  }
})();
document.getElementById('shareProfileBtn').onclick = function(){
  let done=0;
  Object.keys(QURAN_DATA).forEach(id=>{ const g=state.gardens[id]; if(g&&g.planted.length&&g.planted.every(Boolean)) done++; });
  const text = '🌳 குர்ஆன் தோட்டம்\n🪙 '+state.coins+' coins\n🔥 '+(meta.streak||0)+' streak\n📖 '+done+' சூரா';
  if(navigator.share) navigator.share({title:'Quran Garden', text:text}).catch(function(){});
  else { navigator.clipboard.writeText(text).then(function(){ alert('Copy ஆனது!'); }); }
};


/* ===== SAFE TAJWEED (context only – options stay plain) ===== */
/* ===== QCF V4 Tajweed (page fonts + code_v2 glyphs) ===== */
const QCF_FACE_CACHE = {};
const QCF_VERSE_CACHE = {};
let qcfEnabled = false;

function injectQcfFontFace(fam, url){
  const id = 'ff-' + fam;
  if(document.getElementById(id)) return;
  const style = document.createElement('style');
  style.id = id;
  style.textContent = "@font-face{font-family:'" + fam + "';src:url('" + url + "') format('woff2');font-display:swap;}";
  document.head.appendChild(style);
}

function loadQcfV4Font(page){
  const fam = 'QCF4V_p' + page;
  if(QCF_FACE_CACHE[fam] === 'ready') return Promise.resolve(fam);
  if(QCF_FACE_CACHE[fam] && QCF_FACE_CACHE[fam].then) return QCF_FACE_CACHE[fam];

  const urlColr = 'https://verses.quran.foundation/fonts/quran/hafs/v4/colrv1/woff2/p' + page + '.woff2';
  const urlSvg = 'https://verses.quran.foundation/fonts/quran/hafs/v4/ot-svg/dark/woff2/p' + page + '.woff2';

  QCF_FACE_CACHE[fam] = new Promise(function(resolve, reject){
    // Prefer FontFace API; also inject @font-face for Android WebView
    injectQcfFontFace(fam, urlColr);
    if(typeof FontFace === 'undefined'){
      // wait a bit for CSS font download
      setTimeout(function(){ QCF_FACE_CACHE[fam] = 'ready'; resolve(fam); }, 800);
      return;
    }
    const face = new FontFace(fam, 'url(' + urlColr + ')', { display: 'swap' });
    face.load().then(function(f){
      document.fonts.add(f);
      QCF_FACE_CACHE[fam] = 'ready';
      resolve(fam);
    }).catch(function(){
      injectQcfFontFace(fam + '_svg', urlSvg);
      const face2 = new FontFace(fam, 'url(' + urlSvg + ')', { display: 'swap' });
      return face2.load().then(function(f){
        document.fonts.add(f);
        QCF_FACE_CACHE[fam] = 'ready';
        resolve(fam);
      });
    }).catch(function(err){
      QCF_FACE_CACHE[fam] = null;
      reject(err);
    });
  });
  return QCF_FACE_CACHE[fam];
}

async function getQcfVerse(surahNum, ayahNum){
  const key = surahNum + ':' + ayahNum;
  if(QCF_VERSE_CACHE[key]) return QCF_VERSE_CACHE[key];
  try{
    const res = await fetch('https://api.quran.com/api/v4/quran/verses/code_v2?verse_key=' + encodeURIComponent(key));
    if(!res.ok) throw new Error('fail');
    const data = await res.json();
    const v = (data.verses && data.verses[0]) || null;
    if(!v || !v.code_v2) throw new Error('no verse');
    const out = { code: v.code_v2, page: v.v2_page };
    QCF_VERSE_CACHE[key] = out;
    return out;
  }catch(e){
    return null;
  }
}

function renderUnicodeAyah(el, arabic, meaning){
  el.classList.remove('qcf-ayah', 'loading');
  el.style.fontFamily = '';
  el.innerHTML = '';
  if(tajweedOn) el.innerHTML = tajweedify(arabic||'');
  else el.textContent = arabic||'';
  if(showMeaning && meaning){
    const md = document.createElement('div');
    md.className = 'ta-meaning';
    md.textContent = meaning;
    el.appendChild(md);
  }
}

async function renderQcfInto(el, surahNum, ayahNum, fallbackArabic, meaning){
  el.classList.add('loading');
  el.classList.remove('qcf-ayah');
  el.innerHTML = '<span style="font-size:14px;color:#8899aa">⏳ QCF font...</span>';
  try{
    if(!qcfEnabled || !surahNum || !ayahNum){
      renderUnicodeAyah(el, fallbackArabic, meaning);
      return;
    }
    const v = await getQcfVerse(surahNum, ayahNum);
    if(!v || !v.code || !v.page){
      renderUnicodeAyah(el, fallbackArabic, meaning);
      return;
    }
    let fam;
    try {
      fam = await loadQcfV4Font(v.page);
    } catch(e){
      renderUnicodeAyah(el, fallbackArabic, meaning);
      return;
    }
    // CRITICAL: only set QCF codes with the QCF font — never fallback fonts
    // (fallback fonts show circles/boxes for Private Use glyphs)
    el.classList.remove('loading');
    el.classList.add('qcf-ayah');
    el.style.fontFamily = "'" + fam + "'";
    el.textContent = v.code;
    if(showMeaning && meaning){
      const md = document.createElement('div');
      md.className = 'ta-meaning';
      md.textContent = meaning;
      el.appendChild(md);
    }
  }catch(e){
    renderUnicodeAyah(el, fallbackArabic, meaning);
  }
}

let tajweedOn = true;
// showMeaning already declared above

/* Harakat + ALL Uthmani annotation marks must stay attached to base letter */
const TW_HARAKAT = /[\u064B-\u065F\u0670\u06D6-\u06ED\u08F0-\u08FF\u0640]/;
const TW_QALQALAH = new Set(['ق','ط','ب','ج','د']);
const TW_GHUNNAH = new Set(['ن','م']);
const TW_IDGHAM_G = new Set(['ي','ن','م','و']);
const TW_IDGHAM_NG = new Set(['ل','ر']);
const TW_IQLAB = new Set(['ب']);
const TW_HAMZA = new Set(['ء','أ','إ','ئ','ؤ','آ']);
const TW_IZHAR = new Set(['ه','ع','ح','غ','خ']);
const TW_ALIF = new Set(['ا','آ','ٱ','ى']);

function tajweedify(text){
  if(!tajweedOn || !text) return text;
  try {
    const chars = Array.from(text);
    const clusters = [];
    for(const ch of chars){
      if(TW_HARAKAT.test(ch) && clusters.length) clusters[clusters.length-1].marks += ch;
      else clusters.push({base:ch, marks:''});
    }
    function nextLetter(i){
      let j=i+1, crossed=false;
      while(j<clusters.length && (clusters[j].base===' ' || clusters[j].base==='\u200c')){ crossed=true; j++; }
      if(j>=clusters.length) return null;
      return {cluster:clusters[j], index:j, crossedWord:crossed};
    }
    function prevLetter(i){
      let j=i-1;
      while(j>=0 && clusters[j].base===' ') j--;
      return j>=0 ? clusters[j] : null;
    }
    const tokens = [];
    for(let i=0;i<clusters.length;i++){
      const c = clusters[i];
      const prev = prevLetter(i);
      const hasShadda = c.marks.includes('\u0651');
      const hasSukun = c.marks.includes('\u0652');
      const hasTanween = /[\u064B\u064C\u064D]/.test(c.marks);
      const hasDagger = c.marks.includes('\u0670');
      const hasMaddah = c.marks.includes('\u0653');
      let cls = null;

      if(TW_GHUNNAH.has(c.base) && hasShadda) cls = 'tw-ghunnah';
      else if(TW_QALQALAH.has(c.base) && hasSukun) cls = 'tw-qalqalah';
      else if((c.base==='ن' && hasSukun) || hasTanween){
        let nxt = nextLetter(i);
        if(nxt && !nxt.crossedWord && c.marks.includes('\u064B') && TW_ALIF.has(nxt.cluster.base) && nxt.cluster.marks===''){
          nxt = nextLetter(nxt.index);
        }
        if(nxt){
          const nb = nxt.cluster.base;
          const sameYW = !nxt.crossedWord && (nb==='ي'||nb==='و');
          if(sameYW || TW_HAMZA.has(nb) || TW_IZHAR.has(nb)) cls = null;
          else if(TW_IDGHAM_G.has(nb)) cls = 'tw-ghunnah';
          else if(TW_IDGHAM_NG.has(nb)) cls = 'tw-idgham';
          else if(TW_IQLAB.has(nb)) cls = 'tw-iqlab';
          else cls = 'tw-ikhfa';
        }
      } else {
        let isMadd = false;
        let forceLong = hasMaddah;

        if(hasDagger) isMadd = true;
        if(c.base === 'آ'){ isMadd = true; forceLong = true; }
        if(TW_ALIF.has(c.base) && prev && prev.marks.includes('\u064E')) isMadd = true;
        if(c.base === 'و' && (c.marks === '' || hasSukun) && prev && prev.marks.includes('\u064F')) isMadd = true;
        if((c.base === 'ي' || c.base === 'ى') && (c.marks === '' || hasSukun) && prev && prev.marks.includes('\u0650')) isMadd = true;
        if(hasMaddah && (TW_ALIF.has(c.base) || c.base==='و' || c.base==='ي')){ isMadd = true; forceLong = true; }

        if(isMadd){
          const nxt = nextLetter(i);
          const beforeHamza = nxt && TW_HAMZA.has(nxt.cluster.base);
          const beforeShadda = nxt && !nxt.crossedWord && nxt.cluster.marks.includes('\u0651');
          if(forceLong || beforeHamza || beforeShadda) cls = 'tw-madd-long';
          else cls = 'tw-madd';
        }
      }

      if(!cls && hasShadda) cls = 'tw-shadda';
      tokens.push({text: c.base + c.marks, cls: cls});
    }
    return tokens.map(t => t.cls ? ('<span class="'+t.cls+'">'+t.text+'</span>') : t.text).join('');
  } catch(e){
    return text;
  }
}


function setContextText(el, arabic, meaning, surahNum, ayahNum){
  el.classList.remove('qcf-ayah');
  el.style.fontFamily = '';
  // Prefer QCF V4 when we have verse coordinates and QCF is enabled
  if(qcfEnabled && surahNum && ayahNum){
    renderQcfInto(el, surahNum, ayahNum, arabic, meaning);
    return;
  }
  el.innerHTML = '';
  if(tajweedOn){
    el.innerHTML = tajweedify(arabic||'');
  } else {
    el.textContent = arabic||'';
  }
  if(showMeaning && meaning){
    const md = document.createElement('div');
    md.className = 'ta-meaning';
    md.textContent = meaning;
    el.appendChild(md);
  }
}

document.getElementById('tajweedToggleBtn').onclick = function(){
  tajweedOn = !tajweedOn;
  this.classList.toggle('on', tajweedOn);
  document.getElementById('tajweedLegend').classList.toggle('show', tajweedOn);
  if(document.getElementById('quizOverlay').classList.contains('active') && window.__qi !== undefined){
    openQuiz(window.__qi);
  }
  // refresh juz ayah panel if open
  const panel = document.getElementById('juzAyahPanel');
  if(panel){ panel.dataset.sid = ''; renderAyahPanel(); }
};
document.getElementById('meaningToggleBtn').onclick = function(){
  showMeaning = !showMeaning;
  this.classList.toggle('on', showMeaning);
  if(document.getElementById('quizOverlay').classList.contains('active') && window.__qi !== undefined){
    openQuiz(window.__qi);
  }
};

// Init

/* ===== Themes (11 colors) ===== */
const THEMES = [
  {id:'midnight', name:'Midnight',  bg:'linear-gradient(145deg,#1e3a5f 0%,#182140 40%,#060a1a 100%)'},
  {id:'emerald',  name:'Emerald',   bg:'linear-gradient(145deg,#065f46 0%,#0f3d2a 45%,#041a12 100%)'},
  {id:'purple',   name:'Purple',    bg:'linear-gradient(145deg,#6b21a8 0%,#2e1065 45%,#12081f 100%)'},
  {id:'sunset',   name:'Sunset',    bg:'linear-gradient(145deg,#c2410c 0%,#7c2d12 45%,#1a0a05 100%)'},
  {id:'ocean',    name:'Ocean',     bg:'linear-gradient(145deg,#0369a1 0%,#0c4a6e 45%,#02131f 100%)'},
  {id:'rose',     name:'Rose',      bg:'linear-gradient(145deg,#be185d 0%,#9d174d 45%,#1a0810 100%)'},
  {id:'forest',   name:'Forest',    bg:'linear-gradient(145deg,#166534 0%,#14532d 45%,#0a1208 100%)'},
  {id:'gold',     name:'Gold',      bg:'linear-gradient(145deg,#b45309 0%,#78350f 45%,#14100a 100%)'},
  {id:'crimson',  name:'Crimson',   bg:'linear-gradient(145deg,#b91c1c 0%,#7f1d1d 45%,#160508 100%)'},
  {id:'cyan',     name:'Cyan',      bg:'linear-gradient(145deg,#0e7490 0%,#164e63 45%,#042f2e 100%)'},
  {id:'cream',    name:'Cream',     bg:'linear-gradient(145deg,#fffef9 0%,#faf7f2 50%,#e8e0d4 100%)'},
  {id:'black',    name:'Black',     bg:'linear-gradient(145deg,#3a3a3a 0%,#1a1a1a 45%,#000000 100%)'},
  {id:'white',    name:'White',     bg:'linear-gradient(145deg,#ffffff 0%,#f0f0f0 50%,#d4d4d4 100%)'},
  {id:'hcdark',   name:'HC Dark',   bg:'linear-gradient(145deg,#333 0%,#111 40%,#000 100%)'},
  {id:'hclight',  name:'HC Light',  bg:'linear-gradient(145deg,#fff 0%,#f5f5f5 50%,#ddd 100%)'},
];
const THEME_KEY = 'quran_theme_v1';

function applyTheme(id){
  const t = THEMES.find(x=>x.id===id) || THEMES[0];
  THEMES.forEach(th=> document.body.classList.remove('theme-'+th.id));
  document.body.classList.add('theme-'+t.id);
  try{ localStorage.setItem(THEME_KEY, t.id); }catch(e){}
  const label = document.getElementById('themeLabel');
  if(label) label.textContent = t.name;
  document.querySelectorAll('.theme-swatch').forEach(el=>{
    el.classList.toggle('active', el.dataset.theme === t.id);
  });
  // update meta theme-color
  const meta = document.querySelector('meta[name="theme-color"]');
  if(meta){
    const colors = {midnight:'#060a1a',emerald:'#041a12',purple:'#12081f',sunset:'#1a0a05',ocean:'#02131f',rose:'#1a0810',forest:'#0a1208',gold:'#14100a',crimson:'#160508',cyan:'#042f2e',cream:'#f5f0e8',black:'#000000',white:'#fafafa',hcdark:'#000000',hclight:'#ffffff'};
    meta.setAttribute('content', colors[t.id]||'#060a1a');
  }
}

function renderThemeGrid(){
  const grid = document.getElementById('themeGrid');
  if(!grid) return;
  grid.innerHTML = '';
  THEMES.forEach(t=>{
    const el = document.createElement('div');
    el.className = 'theme-swatch';
    el.dataset.theme = t.id;
    el.style.background = t.bg;
    el.innerHTML = '<span class="ts-name">'+t.name+'</span>';
    el.onclick = function(){ applyTheme(t.id); };
    grid.appendChild(el);
  });
  let saved = 'midnight';
  try{ saved = localStorage.getItem(THEME_KEY) || 'midnight'; }catch(e){}
  applyTheme(saved);
}



/* ===== Simple Mushaf Reader ===== */



/* Mushaf viewer removed */
const PdfMushaf = { mode:'text', buildShell:function(){}, setMode:function(){}, openForSurah:function(){}, render:function(){}, tryRestorePdf:function(){return Promise.resolve(false);} };
function initPdfMushaf(){}
function openMushafView(){ if(typeof switchScreen==='function'){ try{ switchScreen('screenSelect'); }catch(e){} } }
const MUSHAF_LINES = 15;
function buildMushafLines(){ return []; }
function renderMushaf15Page(){}
function initMushafButtons(){}




/* ===== Mini Games (fixed) ===== */

/* ===== Asmaul Husna (99 Names) — Arabic + Tamil name ===== */
const ASMAUL_HUSNA = [
  {ar:'الرَّحْمَٰنُ', ta:'அர்-ரஹ்மான்'},
  {ar:'الرَّحِيمُ', ta:'அர்-ரஹீம்'},
  {ar:'الْمَلِكُ', ta:'அல்-மலிக்'},
  {ar:'الْقُدُّوسُ', ta:'அல்-குத்தூஸ்'},
  {ar:'السَّلَامُ', ta:'அஸ்-சலாம்'},
  {ar:'الْمُؤْمِنُ', ta:'அல்-முஃமின்'},
  {ar:'الْمُهَيْمِنُ', ta:'அல்-முஹைமின்'},
  {ar:'الْعَزِيزُ', ta:'அல்-அஸீஸ்'},
  {ar:'الْجَبَّارُ', ta:'அல்-ஜப்பார்'},
  {ar:'الْمُتَكَبِّرُ', ta:'அல்-முதகப்பீர்'},
  {ar:'الْخَالِقُ', ta:'அல்-காலிக்'},
  {ar:'الْبَارِئُ', ta:'அல்-பாரிஉ'},
  {ar:'الْمُصَوِّرُ', ta:'அல்-முஸவ்விர்'},
  {ar:'الْغَفَّارُ', ta:'அல்-கஃபார்'},
  {ar:'الْقَهَّارُ', ta:'அல்-கஹ்ஹார்'},
  {ar:'الْوَهَّابُ', ta:'அல்-வஹ்ஹாப்'},
  {ar:'الرَّزَّاقُ', ta:'அர்-ரஸ்ஸாக்'},
  {ar:'الْفَتَّاحُ', ta:'அல்-ஃபத்தாஹ்'},
  {ar:'الْعَلِيمُ', ta:'அல்-அலீம்'},
  {ar:'الْقَابِضُ', ta:'அல்-காபிள்'},
  {ar:'الْبَاسِطُ', ta:'அல்-பாசித்'},
  {ar:'الْخَافِضُ', ta:'அல்-காஃபிள்'},
  {ar:'الرَّافِعُ', ta:'அர்-ராஃபிஉ'},
  {ar:'الْمُعِزُّ', ta:'அல்-முஇஸ்ஸ்'},
  {ar:'الْمُذِلُّ', ta:'அல்-முதில்லு'},
  {ar:'السَّمِيعُ', ta:'அஸ்-சமீஉ'},
  {ar:'الْبَصِيرُ', ta:'அல்-பஸீர்'},
  {ar:'الْحَكَمُ', ta:'அல்-ஹகம்'},
  {ar:'الْعَدْلُ', ta:'அல்-அத்ல்'},
  {ar:'اللَّطِيفُ', ta:'அல்-லதீஃப்'},
  {ar:'الْخَبِيرُ', ta:'அல்-கபீர் (Khabīr)'},
  {ar:'الْحَلِيمُ', ta:'அல்-ஹலீம்'},
  {ar:'الْعَظِيمُ', ta:'அல்-அஸீம்'},
  {ar:'الْغَفُورُ', ta:'அல்-கஃபூர்'},
  {ar:'الشَّكُورُ', ta:'அஷ்-ஷகூர்'},
  {ar:'الْعَلِيُّ', ta:'அல்-அலீயு'},
  {ar:'الْكَبِيرُ', ta:'அல்-கபீர் (Kabīr)'},
  {ar:'الْحَفِيظُ', ta:'அல்-ஹஃபீழ்'},
  {ar:'الْمُقِيتُ', ta:'அல்-முகீத்'},
  {ar:'الْحَسِيبُ', ta:'அல்-ஹஸீப்'},
  {ar:'الْجَلِيلُ', ta:'அல்-ஜலீல்'},
  {ar:'الْكَرِيمُ', ta:'அல்-கரீம்'},
  {ar:'الرَّقِيبُ', ta:'அர்-ரகீப்'},
  {ar:'الْمُجِيبُ', ta:'அல்-முஜீப்'},
  {ar:'الْوَاسِعُ', ta:'அல்-வாசிஉ'},
  {ar:'الْحَكِيمُ', ta:'அல்-ஹகீம்'},
  {ar:'الْوَدُودُ', ta:'அல்-வதூத்'},
  {ar:'الْمَجِيدُ', ta:'அல்-மஜீத்'},
  {ar:'الْبَاعِثُ', ta:'அல்-பாஇத்'},
  {ar:'الشَّهِيدُ', ta:'அஷ்-ஷஹீத்'},
  {ar:'الْحَقُّ', ta:'அல்-ஹக்'},
  {ar:'الْوَكِيلُ', ta:'அல்-வகீல்'},
  {ar:'الْقَوِيُّ', ta:'அல்-கவீ'},
  {ar:'الْمَتِينُ', ta:'அல்-மதீன்'},
  {ar:'الْوَلِيُّ', ta:'அல்-வலீ'},
  {ar:'الْحَمِيدُ', ta:'அல்-ஹமீத்'},
  {ar:'الْمُحْصِي', ta:'அல்-முஹ்ஸீ'},
  {ar:'الْمُبْدِئُ', ta:'அல்-முப்திஉ'},
  {ar:'الْمُعِيدُ', ta:'அல்-முஈத்'},
  {ar:'الْمُحْيِي', ta:'அல்-முஹ்யீ'},
  {ar:'الْمُمِيتُ', ta:'அல்-முமீத்'},
  {ar:'الْحَيُّ', ta:'அல்-ஹய்'},
  {ar:'الْقَيُّومُ', ta:'அல்-கய்யூம்'},
  {ar:'الْوَاجِدُ', ta:'அல்-வாஜித்'},
  {ar:'الْمَاجِدُ', ta:'அல்-மாஜித்'},
  {ar:'الْوَاحِدُ', ta:'அல்-வாஹித்'},
  {ar:'الْأَحَدُ', ta:'அல்-அஹத்'},
  {ar:'الصَّمَدُ', ta:'அஸ்-ஸமத்'},
  {ar:'الْقَادِرُ', ta:'அல்-காதிர்'},
  {ar:'الْمُقْتَدِرُ', ta:'அல்-முக்ததிர்'},
  {ar:'الْمُقَدِّمُ', ta:'அல்-முகத்திம்'},
  {ar:'الْمُؤَخِّرُ', ta:'அல்-முஅக்கிர்'},
  {ar:'الْأَوَّلُ', ta:'அல்-அவ்வல்'},
  {ar:'الْآخِرُ', ta:'அல்-ஆகிர்'},
  {ar:'الظَّاهِرُ', ta:'அழ்-ழாஹிர்'},
  {ar:'الْبَاطِنُ', ta:'அல்-பாதின்'},
  {ar:'الْوَالِي', ta:'அல்-வாலீ'},
  {ar:'الْمُتَعَالِي', ta:'அல்-முதஆலீ'},
  {ar:'الْبَرُّ', ta:'அல்-பர்ர்'},
  {ar:'التَّوَّابُ', ta:'அத்-தவ்வாப்'},
  {ar:'الْمُنْتَقِمُ', ta:'அல்-முன்தகிம்'},
  {ar:'الْعَفُوُّ', ta:'அல்-அஃபூவ்'},
  {ar:'الرَّءُوفُ', ta:'அர்-ரஊஃப்'},
  {ar:'مَالِكُ الْمُلْكِ', ta:'மாலிகுல்-முல்க்'},
  {ar:'ذُو الْجَلَالِ وَالْإِكْرَامِ', ta:'துல்-ஜலாலி வல்-இக்ராம்'},
  {ar:'الْمُقْسِطُ', ta:'அல்-முக்சித்'},
  {ar:'الْجَامِعُ', ta:'அல்-ஜாமிஉ'},
  {ar:'الْغَنِيُّ', ta:'அல்-கனீ'},
  {ar:'الْمُغْنِي', ta:'அல்-முக்னீ'},
  {ar:'الْمَانِعُ', ta:'அல்-மானிஉ'},
  {ar:'الضَّارُّ', ta:'அழ்-ழார்ர்'},
  {ar:'النَّافِعُ', ta:'அன்-நாஃபிஉ'},
  {ar:'النُّورُ', ta:'அன்-நூர்'},
  {ar:'الْهَادِي', ta:'அல்-ஹாதீ'},
  {ar:'الْبَدِيعُ', ta:'அல்-பதீஉ'},
  {ar:'الْبَاقِي', ta:'அல்-பாகீ'},
  {ar:'الْوَارِثُ', ta:'அல்-வாரித்'},
  {ar:'الرَّشِيدُ', ta:'அர்-ரஷீத்'},
  {ar:'الصَّبُورُ', ta:'அஸ்-ஸபூர்'}
];

const Games = {
  score: 0,
  timer: null,
  timeLeft: 0,
  active: null,
  lock: false,
  _mem: null,
  _speed: null,
  _order: null,
  _blank: null,
  _surah: null,
  _tf: null,

  getLocalSurahs: function(){
    if(typeof QURAN_DATA !== 'object' || !QURAN_DATA) return [];
    return Object.keys(QURAN_DATA).filter(function(id){
      const s = QURAN_DATA[id];
      return s && Array.isArray(s.ayat) && s.ayat.length > 0;
    });
  },

  randomAyahs: function(n){
    const ids = this.getLocalSurahs();
    const pool = [];
    ids.forEach(function(id){
      const s = QURAN_DATA[id];
      (s.ayat || []).forEach(function(a, i){
        const ar = (a && a.ar) ? String(a.ar).trim() : '';
        const ta = (a && a.ta) ? String(a.ta).trim() : '';
        if(ar){
          pool.push({
            id: id, idx: i, ar: ar, ta: ta,
            name: s.nameTa || s.nameAr || id,
            surahNum: s.surahNum
          });
        }
      });
    });
    for(let i = pool.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = pool[i]; pool[i] = pool[j]; pool[j] = t;
    }
    return pool.slice(0, n);
  },

  showMenu: function(){
    const menu = document.getElementById('gamesMenu');
    const play = document.getElementById('gamePlayArea');
    if(menu) menu.style.display = '';
    if(play) play.style.display = 'none';
    if(this.timer){ clearInterval(this.timer); this.timer = null; }
    this.active = null;
    this.lock = false;
  },

  start: function(type){
    this.score = 0;
    this.lock = false;
    this.active = type;
    const menu = document.getElementById('gamesMenu');
    const play = document.getElementById('gamePlayArea');
    if(menu) menu.style.display = 'none';
    if(play) play.style.display = 'block';
    const sc = document.getElementById('gameScore');
    const tm = document.getElementById('gameTimer');
    if(sc) sc.textContent = '⭐ 0';
    if(tm){ tm.textContent = '⏱ —'; tm.classList.remove('warn'); }
    if(type === 'memory') this.startMemory();
    else if(type === 'speed') this.startSpeed();
    else if(type === 'order') this.startOrder();
    else if(type === 'blank') this.startBlank();
    else if(type === 'surah') this.startSurahQuiz();
    else if(type === 'tf') this.startTF();
  },

  addScore: function(n){
    this.score += n;
    const sc = document.getElementById('gameScore');
    if(sc) sc.textContent = '⭐ ' + this.score;
  },

  finish: function(msg, coins){
    if(this.timer){ clearInterval(this.timer); this.timer = null; }
    const body = document.getElementById('gameBody');
    if(body){
      body.innerHTML = '<div class="game-result"><h3>🎉 முடிந்தது!</h3><p>'+msg+'</p><p style="color:var(--gold-light);font-weight:800">+'+coins+' coins</p>'+
        '<button type="button" class="play-all-btn" id="gameAgainBtn" style="margin-top:12px">🔄 மீண்டும்</button></div>';
      const self = this;
      const again = document.getElementById('gameAgainBtn');
      if(again) again.onclick = function(){ self.start(self.active); };
    }
    if(typeof state !== 'undefined'){
      state.coins = (state.coins || 0) + coins;
      if(typeof saveGame === 'function') saveGame();
      if(typeof updateHeader === 'function') updateHeader();
      if(typeof updateStreak === 'function') try{ updateStreak(); }catch(e){}
    }
    if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
  },

  /* ---- Memory Match (Asmaul Husna + Ayah) ---- */
  startMemory: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '🃏 Memory · அஸ்மாஉல் ஹுஸ்னா';
    const body = document.getElementById('gameBody');
    if(!body) return;

    // Prefer Asmaul Husna; fallback to ayahs if missing
    let pairs = [];
    if(typeof ASMAUL_HUSNA !== 'undefined' && ASMAUL_HUSNA.length >= 4){
      const pool = ASMAUL_HUSNA.slice();
      for(let i = pool.length - 1; i > 0; i--){
        const j = Math.floor(Math.random() * (i + 1));
        const t = pool[i]; pool[i] = pool[j]; pool[j] = t;
      }
      pairs = pool.slice(0, 6).map(function(n){
        return { ar: n.ar, ta: n.ta };
      });
    } else {
      const ayahs = this.randomAyahs(6);
      if(ayahs.length < 3){
        body.innerHTML = '<p style="text-align:center;color:var(--text-dim);padding:20px">Data இல்லை</p>';
        return;
      }
      pairs = ayahs.map(function(a){ return { ar: a.ar, ta: a.ta }; });
    }

    const cards = [];
    pairs.forEach(function(a, i){
      cards.push({
        id: 'ar'+i, type: 'ar', pair: i,
        text: a.ar.length > 40 ? a.ar.slice(0, 38) + '…' : a.ar,
        show: false, matched: false
      });
      cards.push({
        id: 'ta'+i, type: 'ta', pair: i,
        text: a.ta.length > 42 ? a.ta.slice(0, 40) + '…' : a.ta,
        show: false, matched: false
      });
    });
    for(let i = cards.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = cards[i]; cards[i] = cards[j]; cards[j] = t;
    }
    this._mem = { cards: cards, flipped: [], matched: 0, total: pairs.length };
    this.renderMemory();
  },

  renderMemory: function(){
    const body = document.getElementById('gameBody');
    if(!body || !this._mem) return;
    const self = this;
    const grid = document.createElement('div');
    grid.className = 'memory-grid';
    grid.id = 'memoryGrid';
    this._mem.cards.forEach(function(c, idx){
      const el = document.createElement('button');
      el.type = 'button';
      el.className = 'memory-card';
      el.dataset.idx = String(idx);
      if(c.matched) el.classList.add('matched');
      if(c.show || c.matched){
        el.classList.add('flipped');
        if(c.type === 'ar'){
          el.classList.add('face-ar');
        } else {
          el.style.fontFamily = 'var(--font-ui)';
          el.style.direction = 'ltr';
          el.style.fontSize = '13px';
          el.style.fontWeight = '700';
          el.style.lineHeight = '1.3';
        }
        el.textContent = c.text;
      } else {
        el.innerHTML = '<span class="mc-back">🌿</span>';
      }
      el.disabled = !!c.matched;
      grid.appendChild(el);
    });
    body.innerHTML = '';
    body.appendChild(grid);
    // event delegation — one listener
    grid.onclick = function(ev){
      let t = ev.target;
      while(t && t !== grid && !t.classList.contains('memory-card')) t = t.parentNode;
      if(!t || !t.classList.contains('memory-card')) return;
      const idx = parseInt(t.dataset.idx, 10);
      if(!isNaN(idx)) self.flipMemory(idx);
    };
  },

  flipMemory: function(idx){
    if(this.lock || !this._mem) return;
    const m = this._mem;
    const c = m.cards[idx];
    if(!c || c.matched || c.show) return;
    if(m.flipped.length >= 2) return;

    c.show = true;
    m.flipped.push(idx);
    this.renderMemory();

    if(m.flipped.length < 2) return;

    this.lock = true;
    const a = m.cards[m.flipped[0]];
    const b = m.cards[m.flipped[1]];
    const self = this;

    if(a.pair === b.pair && a.type !== b.type){
      a.matched = true;
      b.matched = true;
      m.matched++;
      this.addScore(5);
      m.flipped = [];
      this.lock = false;
      this.renderMemory();
      if(m.matched >= m.total){
        setTimeout(function(){ self.finish('எல்லா ஜோடிகளும் பொருந்தியது!', 15); }, 350);
      }
    } else {
      setTimeout(function(){
        a.show = false;
        b.show = false;
        m.flipped = [];
        self.lock = false;
        self.renderMemory();
      }, 650);
    }
  },

  /* ---- Speed Quiz ---- */
  startSpeed: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '⚡ Speed';
    this.timeLeft = 30;
    this._speed = { q: 0, correct: 0 };
    const el = document.getElementById('gameTimer');
    if(el){ el.textContent = '⏱ 30'; el.classList.remove('warn'); }
    const self = this;
    if(this.timer) clearInterval(this.timer);
    this.timer = setInterval(function(){
      self.timeLeft--;
      const t = document.getElementById('gameTimer');
      if(t){
        t.textContent = '⏱ ' + self.timeLeft;
        if(self.timeLeft <= 8) t.classList.add('warn');
      }
      if(self.timeLeft <= 0){
        clearInterval(self.timer); self.timer = null;
        const coins = Math.min(20, 5 + self._speed.correct * 2);
        self.finish(self._speed.correct + ' சரி', coins);
      }
    }, 1000);
    this.nextSpeedQ();
  },

  nextSpeedQ: function(){
    if(this.timeLeft <= 0) return;
    const self = this;
    const pool = this.randomAyahs(12);
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(pool.length < 4){
      this.finish('Data குறைவு', 0);
      return;
    }
    this._speed.q++;
    const correct = pool[0];
    const opts = [correct];
    for(let i = 1; i < pool.length && opts.length < 4; i++){
      if(pool[i].ta !== correct.ta) opts.push(pool[i]);
    }
    while(opts.length < 4) opts.push(pool[opts.length % pool.length]);
    for(let i = opts.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = opts[i]; opts[i] = opts[j]; opts[j] = t;
    }
    const mode = 'ar2surah';
    let html = '<div class="speed-q">';
    html += '<div class="sq-prompt">இந்த ஆயத்து எந்த சூரா?</div><div class="sq-ar">'+correct.ar+'</div>';
    html += '</div><div class="speed-opts" id="speedOpts"></div>';
    body.innerHTML = html;
    const box = document.getElementById('speedOpts');
    // unique surah options
    const seen = {};
    const sopts = [];
    opts.forEach(function(o){
      if(!seen[o.id]){ seen[o.id]=true; sopts.push(o); }
    });
    while(sopts.length < 4){
      const extra = pool[sopts.length % pool.length];
      if(extra && !seen[extra.id]){ seen[extra.id]=true; sopts.push(extra); }
      else break;
    }
    sopts.forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o.name;
      btn.style.fontFamily = 'var(--font-ui)';
      btn.style.direction = 'ltr';
      btn.style.textAlign = 'left';
      btn.onclick = function(){
        if(self.lock || self.timeLeft <= 0) return;
        self.lock = true;
        const ok = (o.id === correct.id);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._speed.correct++;
          self.addScore(3);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.lock = false; self.nextSpeedQ(); }, 400);
      };
      box.appendChild(btn);
    });
  },

  /* ---- Ayah Order ---- */
  startOrder: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '🔢 Order';
    const ids = this.getLocalSurahs();
    let chosen = null;
    const shuffled = ids.slice().sort(function(){ return Math.random() - 0.5; });
    for(let i = 0; i < shuffled.length; i++){
      if(QURAN_DATA[shuffled[i]].ayat.length >= 4){ chosen = shuffled[i]; break; }
    }
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(!chosen){
      body.innerHTML = '<p style="text-align:center;padding:20px">போதிய ஆயத்துகள் இல்லை</p>';
      return;
    }
    const s = QURAN_DATA[chosen];
    const startIdx = Math.floor(Math.random() * Math.max(1, s.ayat.length - 3));
    const slice = s.ayat.slice(startIdx, startIdx + 4).map(function(a, i){
      const ar = a.ar || '';
      return { ar: ar, real: startIdx + i + 1, text: ar.length > 70 ? ar.slice(0, 68) + '…' : ar };
    });
    const order = slice.slice();
    for(let i = order.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = order[i]; order[i] = order[j]; order[j] = t;
    }
    this._order = { items: order, correct: slice.map(function(x){ return x.real; }), name: s.nameTa || s.nameAr };
    this.renderOrder();
  },

  renderOrder: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body || !this._order) return;
    body.innerHTML = '<p style="text-align:center;font-size:12px;color:var(--text-dim);margin-bottom:8px">'+this._order.name+' · அழுத்தி மேலே நகர்த்துங்கள்</p>';
    const list = document.createElement('div');
    list.className = 'order-list';
    this._order.items.forEach(function(it, idx){
      const el = document.createElement('button');
      el.type = 'button';
      el.className = 'order-item';
      el.style.width = '100%';
      el.style.cursor = 'pointer';
      el.innerHTML = '<div class="oi-num">#'+(idx+1)+' · மேலே ⬆</div>'+it.text;
      el.onclick = function(){
        if(idx === 0) return;
        const arr = self._order.items;
        const t = arr[idx]; arr[idx] = arr[idx-1]; arr[idx-1] = t;
        self.renderOrder();
      };
      list.appendChild(el);
    });
    body.appendChild(list);
    const check = document.createElement('button');
    check.type = 'button';
    check.className = 'play-all-btn';
    check.style.display = 'block';
    check.style.margin = '14px auto';
    check.textContent = '✅ சரிபார்';
    check.onclick = function(){ self.checkOrder(); };
    body.appendChild(check);
  },

  checkOrder: function(){
    const items = this._order.items;
    let ok = true;
    for(let i = 0; i < items.length; i++){
      if(items[i].real !== this._order.correct[i]){ ok = false; break; }
    }
    if(ok){
      this.addScore(10);
      this.finish('வரிசை சரியானது!', 25);
    } else {
      alert('❌ வரிசை தவறு — மீண்டும் முயற்சிக்கவும்');
      if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
    }
  },

  startBlank: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '📝 Missing Word';
    this._blank = { q: 0, correct: 0, total: 6 };
    this.nextBlankQ();
  },

  nextBlankQ: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(this._blank.q >= this._blank.total){
      const coins = Math.min(20, 6 + this._blank.correct * 2);
      this.finish(this._blank.correct + ' / ' + this._blank.total + ' சரி', coins);
      return;
    }
    const pool = this.randomAyahs(10);
    if(pool.length < 4){ this.finish('Data குறைவு', 0); return; }
    let chosen = null;
    for(let i = 0; i < pool.length; i++){
      const words = pool[i].ar.trim().split(/\s+/).filter(function(w){ return w.length > 1; });
      if(words.length >= 3){ chosen = pool[i]; chosen._words = words; break; }
    }
    if(!chosen){ chosen = pool[0]; chosen._words = chosen.ar.trim().split(/\s+/); }
    const words = chosen._words;
    const blankIdx = Math.floor(Math.random() * words.length);
    const answer = words[blankIdx];
    const display = words.map(function(w, i){ return i === blankIdx ? '____' : w; }).join(' ');
    const opts = [answer];
    pool.forEach(function(p){
      if(opts.length >= 4) return;
      (p.ar || '').split(/\s+/).forEach(function(w){
        if(opts.length >= 4) return;
        w = w.trim();
        if(w.length > 1 && opts.indexOf(w) === -1) opts.push(w);
      });
    });
    while(opts.length < 4) opts.push(opts[opts.length % Math.max(1,opts.length)] || 'ٱللَّه');
    for(let i = opts.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = opts[i]; opts[i] = opts[j]; opts[j] = t;
    }
    this._blank.q++;
    this.lock = false;
    body.innerHTML =
      '<div class="speed-q">'+
        '<div class="sq-prompt">மறைந்த சொல் எது? ('+this._blank.q+'/'+this._blank.total+')</div>'+
        '<div class="sq-ar" style="font-size:20px;line-height:1.8">'+display+'</div>'+
        '<div style="font-size:12px;color:var(--text-dim);margin-top:6px">'+chosen.name+'</div>'+
      '</div><div class="speed-opts" id="blankOpts"></div>';
    const box = document.getElementById('blankOpts');
    opts.forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o;
      btn.style.fontFamily = 'var(--font-ar)';
      btn.style.direction = 'rtl';
      btn.onclick = function(){
        if(self.lock) return;
        self.lock = true;
        const ok = (o === answer);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._blank.correct++;
          self.addScore(3);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.nextBlankQ(); }, 450);
      };
      box.appendChild(btn);
    });
  },

  startSurahQuiz: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '📖 Which Surah?';
    this._surah = { q: 0, correct: 0, total: 6 };
    this.nextSurahQ();
  },

  nextSurahQ: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(this._surah.q >= this._surah.total){
      const coins = Math.min(20, 6 + this._surah.correct * 2);
      this.finish(this._surah.correct + ' / ' + this._surah.total + ' சரி', coins);
      return;
    }
    const pool = this.randomAyahs(12);
    if(pool.length < 4){ this.finish('Data குறைவு', 0); return; }
    const correct = pool[0];
    const seen = {};
    const opts = [{ name: correct.name, id: correct.id }];
    seen[correct.id] = true;
    for(let i = 1; i < pool.length && opts.length < 4; i++){
      if(!seen[pool[i].id]){
        seen[pool[i].id] = true;
        opts.push({ name: pool[i].name, id: pool[i].id });
      }
    }
    if(opts.length < 4){
      this.getLocalSurahs().forEach(function(id){
        if(opts.length >= 4) return;
        if(!seen[id]){
          seen[id] = true;
          const s = QURAN_DATA[id];
          opts.push({ name: s.nameTa || s.nameAr || id, id: id });
        }
      });
    }
    for(let i = opts.length - 1; i > 0; i--){
      const j = Math.floor(Math.random() * (i + 1));
      const t = opts[i]; opts[i] = opts[j]; opts[j] = t;
    }
    this._surah.q++;
    this.lock = false;
    body.innerHTML =
      '<div class="speed-q">'+
        '<div class="sq-prompt">இந்த ஆயத்து எந்த சூரா? ('+this._surah.q+'/'+this._surah.total+')</div>'+
        '<div class="sq-ar" style="font-size:20px;line-height:1.8">'+correct.ar+'</div>'+
      '</div><div class="speed-opts" id="surahOpts"></div>';
    const box = document.getElementById('surahOpts');
    opts.forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o.name;
      btn.style.fontFamily = 'var(--font-ui)';
      btn.style.direction = 'ltr';
      btn.style.textAlign = 'left';
      btn.onclick = function(){
        if(self.lock) return;
        self.lock = true;
        const ok = (o.id === correct.id);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._surah.correct++;
          self.addScore(3);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.nextSurahQ(); }, 450);
      };
      box.appendChild(btn);
    });
  },

  startTF: function(){
    const title = document.getElementById('gameTitle');
    if(title) title.textContent = '✅ True / False';
    this._tf = { q: 0, correct: 0, total: 8 };
    this.nextTFQ();
  },

  nextTFQ: function(){
    const self = this;
    const body = document.getElementById('gameBody');
    if(!body) return;
    if(this._tf.q >= this._tf.total){
      const coins = Math.min(15, 4 + this._tf.correct);
      this.finish(this._tf.correct + ' / ' + this._tf.total + ' சரி', coins);
      return;
    }
    const pool = this.randomAyahs(8);
    if(pool.length < 2){ this.finish('Data குறைவு', 0); return; }
    const ayah = pool[0];
    // True = correct surah name, False = wrong surah name
    const isTrue = Math.random() > 0.45;
    let shownName = ayah.name;
    if(!isTrue){
      for(let i = 1; i < pool.length; i++){
        if(pool[i].id !== ayah.id){ shownName = pool[i].name; break; }
      }
    }
    this._tf.q++;
    this.lock = false;
    body.innerHTML =
      '<div class="speed-q">'+
        '<div class="sq-prompt">இந்த ஆயத்து இந்த சூராவிற்கு சரியானதா? ('+this._tf.q+'/'+this._tf.total+')</div>'+
        '<div class="sq-ar" style="font-size:20px;line-height:1.8;margin-bottom:10px">'+ayah.ar+'</div>'+
        '<div class="sq-ta" style="font-size:15px;color:var(--gold-light);padding:10px;background:rgba(255,255,255,.06);border-radius:10px">📖 '+shownName+'</div>'+
      '</div><div class="speed-opts" id="tfOpts" style="flex-direction:row;gap:12px;justify-content:center"></div>';
    const box = document.getElementById('tfOpts');
    [
      { label: '✅ சரி (True)', val: true },
      { label: '❌ தவறு (False)', val: false }
    ].forEach(function(o){
      const btn = document.createElement('button');
      btn.type = 'button';
      btn.textContent = o.label;
      btn.style.fontFamily = 'var(--font-ui)';
      btn.style.flex = '1';
      btn.style.minWidth = '120px';
      btn.onclick = function(){
        if(self.lock) return;
        self.lock = true;
        const ok = (o.val === isTrue);
        btn.classList.add(ok ? 'correct' : 'wrong');
        if(ok){
          self._tf.correct++;
          self.addScore(2);
          if(typeof AudioFX !== 'undefined' && AudioFX.playCorrect) try{ AudioFX.playCorrect(); }catch(e){}
        } else {
          if(typeof AudioFX !== 'undefined' && AudioFX.playWrong) try{ AudioFX.playWrong(); }catch(e){}
        }
        setTimeout(function(){ self.nextTFQ(); }, 450);
      };
      box.appendChild(btn);
    });
  }
};

function initGames(){
  document.querySelectorAll('.game-card[data-game]').forEach(function(card){
    card.onclick = function(e){
      e.preventDefault();
      const g = card.getAttribute('data-game');
      if(g) Games.start(g);
    };
  });
  const back = document.getElementById('gamesBackBtn');
  if(back) back.onclick = function(){ Games.showMenu(); if(typeof switchScreen==='function') switchScreen('screenSelect'); };
  const quit = document.getElementById('gameQuitBtn');
  if(quit) quit.onclick = function(){ Games.showMenu(); };
}





loadAll();
renderThemeGrid();

/* ===== Touch helpers ===== */
function initTouchOptimizations(){
  // Prevent double-tap zoom on interactive elements (iOS)
  let lastTouchEnd = 0;
  document.addEventListener('touchend', function(e){
    const now = Date.now();
    if(now - lastTouchEnd <= 300){
      const t = e.target;
      if(t && (t.closest('button') || t.closest('.level-tile') || t.closest('.memory-card') ||
               t.closest('.game-card') || t.closest('.opt-btn') || t.closest('.ayah-dot'))){
        e.preventDefault();
      }
    }
    lastTouchEnd = now;
  }, {passive: false});

  // Visual pressed state via class for devices without :active reliability
  document.addEventListener('touchstart', function(e){
    const t = e.target.closest('button, .level-tile, .memory-card, .game-card, .opt-btn, .mode-btn, .ayah-dot');
    if(t) t.classList.add('is-pressed');
  }, {passive: true});
  document.addEventListener('touchend', function(e){
    document.querySelectorAll('.is-pressed').forEach(function(el){ el.classList.remove('is-pressed'); });
  }, {passive: true});
  document.addEventListener('touchcancel', function(){
    document.querySelectorAll('.is-pressed').forEach(function(el){ el.classList.remove('is-pressed'); });
  }, {passive: true});
}

initGames();

function initQuizOverlayUX(){
  const ov = document.getElementById('quizOverlay');
  if(!ov) return;
  ov.addEventListener('click', function(e){
    if(e.target === ov){
      ov.classList.remove('active');
      if(currentAudio){ try{currentAudio.pause();}catch(err){} currentAudio=null; }
    }
  });
  const cancel = document.getElementById('quizCancel');
  if(cancel){
    cancel.onclick = function(){
      ov.classList.remove('active');
      if(currentAudio){ try{currentAudio.pause();}catch(err){} currentAudio=null; }
    };
  }
}

initTouchOptimizations();
initQuizOverlayUX();

/* ===== Script: Indo-Pak / Uthmani ===== */
const SCRIPT_KEY = 'quran_script_v1';
let currentScript = 'indopak';

function applyScriptFonts(){
  document.body.classList.remove('script-uthmani','script-indopak');
  if(currentScript === 'uthmani'){
    document.body.classList.add('script-uthmani');
    document.documentElement.style.setProperty('--font-ar', "'UthmanicHafs','Amiri Quran','Scheherazade New','Noto Naskh Arabic','AlMajeed',serif");
  } else {
    document.body.classList.add('script-indopak');
    document.documentElement.style.setProperty('--font-ar', "'AlMajeed','MuhammadiQuranic','UthmanicHafs','Amiri Quran','Scheherazade New','Noto Naskh Arabic',serif");
  }
}

function getDefaultForScript(script){
  return script === 'uthmani' ? DEFAULT_QURAN_UTHMANI : DEFAULT_QURAN_INDOPAK;
}

function applyScript(script, forceReload){
  const s = (script === 'uthmani') ? 'uthmani' : 'indopak';
  if(s === currentScript && !forceReload) {
    // just update UI
  } else {
    currentScript = s;
    try{ localStorage.setItem(SCRIPT_KEY, s); }catch(e){}
    // Replace local surah texts from embedded defaults; keep garden progress
    const src = getDefaultForScript(s);
    Object.keys(src).forEach(id=>{
      const keepGarden = state.gardens[id];
      QURAN_DATA[id] = structuredClone(src[id]);
      if(keepGarden && keepGarden.planted && keepGarden.planted.length === QURAN_DATA[id].ayat.length){
        state.gardens[id] = keepGarden;
      } else {
        state.gardens[id] = {planted: Array(QURAN_DATA[id].ayat.length).fill(false)};
      }
    });
    // Clear non-local surahs so they re-fetch with new script
    Object.keys(QURAN_DATA).forEach(id=>{
      if(!src[id]) delete QURAN_DATA[id];
    });
    JUZ_CACHE = {};
    saveData(); saveGame();
    applyScriptFonts();
  }
  const label = document.getElementById('scriptLabel');
  if(label) label.textContent = s === 'uthmani' ? 'Uthmani (மதீனா)' : 'Indo-Pak (தெற்காசிய)';
  document.querySelectorAll('.script-btn').forEach(btn=>{
    btn.classList.toggle('active', btn.dataset.script === currentScript);
  });
}

function initScriptSelector(){
  let saved = 'indopak';
  try{ saved = localStorage.getItem(SCRIPT_KEY) || 'indopak'; }catch(e){}
  currentScript = saved;
  applyScriptFonts();
  document.querySelectorAll('.script-btn').forEach(btn=>{
    btn.onclick = function(){
      if(btn.dataset.script === currentScript) return;
      applyScript(btn.dataset.script, true);
      // refresh current view if open
      if(currentSurah && QURAN_DATA[currentSurah]){
        try{ openGarden(currentSurah); }catch(e){}
      }
    };
  });
  applyScript(saved, false);
  // If saved was uthmani, need to actually load uthmani data
  if(saved === 'uthmani') applyScript('uthmani', true);
}


(function(){
  var b=document.getElementById('openDuaBtn');
  if(b) b.onclick=function(){ if(typeof switchScreen==='function'){ switchScreen('screenDua'); initDua(); } };
})();
(function(){
  var nb=document.getElementById('openNabiDuaBtn');
  if(nb) nb.onclick=function(){ if(typeof switchScreen==='function'){ switchScreen('screenNabiDua'); initNabiDua(); } };
})();
// Soft staggered boot (folder version — less hang)
(function(){
  var steps = [
    function(){ try{ initMushafButtons(); }catch(e){} },
    function(){ try{ initScriptSelector(); }catch(e){} },
    function(){ try{ initJuzFilterUI(); }catch(e){} },
    function(){ try{ updateHeader(); }catch(e){} },
    function(){ try{ updateDailyUI(); }catch(e){} },
    function(){ try{ renderPlotsGrid(); }catch(e){} },
    function(){
      var s=document.getElementById('bootSplash');
      if(s){ s.style.opacity='0'; setTimeout(function(){ try{s.remove();}catch(e){} }, 300); }
    }
  ];
  var i=0;
  function run(){
    if(i>=steps.length) return;
    try{ steps[i](); }catch(e){ console.warn(e); }
    i++;
    setTimeout(run, 25);
  }
  setTimeout(run, 40);
})();